{
  "course code": "",
  "course title": "Energy And Environmental Science",
  "prerequisites": "",
  "course type": "Epr",
  "course learning objectives": "To Discuss The Complexity Of Issues And Challenges Relating To Energy And EnvironmentalScienceTo Explore The Environmental Impact Of Various Energy Sources And Also The Effects OfDifferent Types Of Pollutants.To Introduce The Principal Renewable Energy Systems.To Discuss The Human Impact On The Environment And Human Exposure To EnvironmentalContaminants.",
  "course content": "Unit 1Multidisciplinary Nature, Ecosystems And Bio-DiversityEnvironment: Definition, Scope And Importance; Need For Public Awareness. Ecosystems:Concept, Structure, Function And Energy Flow In An Ecosystem; Producers, Consumers AndDecomposers. Bio-Diversity: Definition, Value Of Bio-Diversity, Hot Spots And Threats To Bio-Diversity, Conservation.                                                                (5L)Unit 2Natural ResourcesRenewable And Non-Renewable Resources:Natural Resources And Associated Problems. ForestResources- Use And Over-Exploitation, Deforestation, Case Studies. Timber Extraction, Mining,Dams And Their Effects On Forest And Tribal People. Water Resources- Use And Over-Utilization OfSurface And Ground Water, Floods, Drought, Conflicts Over Water. Mineral Resources- Use AndExploitation, Environmental Effects Of Extracting And Using Mineral Resources, Case Studies.FoodResources-World Food Problems, Changes Caused By Agriculture And Overgrazing, Effects OfModern Agriculture, Fertilizer-Pesticide Problems, Water Logging, Salinity, Case Studies.EnergyResources- Present Energy Resources In India And Its Sustainability, Energy Demand Scenario InIndia, Growing Energy Needs, Renewable And Non-Renewable Energy Sources, Use Of AlternateEnergy Sources; Power Plants: Different Types Of Conventional Power Plants, Advantages&Disadvantages Of Conventional Power Plants, Conventional Vs Non-Conventional PowerGeneration; Solar Energy: Basics Of Solar Energy, Solar Thermal Energy, Photovoltaic (Pv) SolarCells, Advantages & Disadvantages, Environmental Impacts And Safety; Wind Energy: Energy FromWind Turbines, Indias Wind Energy Potential, Types Of Wind Turbines, Off Shore Wind Energy,Environmental Benefits And Impacts.                                                       (8L)Unit 3Environmental PollutionAir Pollution- Sources And Effects Of Pollutants, Primary And Secondary Pollutants, ControlMeasures. Acid Rain: Impacts On Human Communities And Agriculture. Green-House Effect:Definition, Causes And Consequences. Depletion Of Ozone Layer:Cfc, Destruction Of Ozone LayerBy Cfc, Consequences, The Effect Of Ozone Modification, Photochemical Smog, Bhopal GasTragedy. Water Pollution- Water Characteristics, Water Quality (Who Standard), Natural WaterPollutants Their Origin And Effects: Oxygen Demanding Wastes, Pathogens, Nutrients, Salts, HeavyMetals, Pesticides, Volatile Organic Compounds. River/ Lake/ Ground Water Pollution: Do, Bod,Cod, Toc, Oil &Grease, Ph And Eutrophication.Thermal Pollution-Cause, Effects And ControlMeasures. Solid Waste Management- Causes, Effects And Control Measures Of Urban AndIndustrial Wastes Nuclear Hazards- Causes, Effects And Control Measures.                    (8L)Unit 4Social Issues And The EnvironmentUnsustainable To Sustainable Development, Urban Problems Related To Energy, Water Conservation,Rain Water Harvesting, Watershed Management; Environmental Ethics: Issues And PossibleSolutions, Environment Protection Act, Air (Prevention And Control Of Pollution) Act, Water(Prevention And Control Of Pollution) Act                                                (6L)",
  "course outcomes": "Upon Successful Completion Of This Curriculum:Students Will Know The Environmental Pollutants And Their Health Effects, And Environmental Remediation And Management.Students Will Understand The Principal Of Renewable Energy Systems And Explore The Environmental Impact Of Various Energy Sources.Students Will Understand Interrelationships Among Science, Technology, And EnvironmentStudents Will Learn About The Importance Of Saving Energy And Environment.",
  "credits": "2",
  "reference books": "1. Environmental Studies: A. Basak, Pearson Education; 1St Edition (2009).2. Environmental Studies For Undergraduate Courses Of All Branches Of Higher Education By Erachbharucha For University Grants Commission3. Text Book Of Environmental Studies: D. Dave And S.S. Katewa, Cenage Learning.4. Fundamentals Of Environmental Studies: S. Somvanshi And R. Dhupper, S. K. Kataria& Sons.5. Environmental Chemistry: Anil K De, New Age International, 2007.6. Environmental Studies: R. Daniels, Wiley India Private. Ltd.7. Environmental Studies: Benny Joseph, Mcgraw-Hill Education,2Nd Edition.B. Tech. 1St Semester(2017-18 Onwards)"
}
{
  "course code": "",
  "course title": "Environmental Science Lab",
  "prerequisites": "",
  "course type": "Elr",
  "course learning objectives": "To Learn About Laboratory Skills.To Get A Knowledge About Some Important Labotatory Techniques Used In Assessing TheAmount Of Different Pollutants In Water And Air. Laboratory Experiments %1. Determination Of Alkalinity In The Water Sample 2.  Determination Of Dissolved Oxygen (Do) In The Water Sample. 3.  Determination Of Chemical Oxygen Demand (Cod) In The Water Sample. 4.  Determination Of Residual Chlorine In The Water Sample. 5.  Determination Of Total Dissolved Solids In Water/Effluent Sample. 6.  Determination Of Total Ca2+ And Mg2+ Hardness In Water. 7.  Determination Of Strength Of Nitrite Ions In Water Samples. 8.  Analysis Of Btx Through Gas-Chromatography In Air Samples. 9.  Analysis Of Heavy Metal Ions In Industrial Effluent By Atomic Absorption Spectroscopy(Aas). %10. Determination Of Moisture And Ph Of Soil Sample.",
  "course content": "",
  "course outcomes": "",
  "credits": "1",
  "reference books": "%1. Applied Chemistry-Theory And Practice: O. P. Virmani And A. K. Narula, New Age India Publishers, New Delhi. 2. Essentials Of Experimental Engineering Chemistry: Shashi Chawla, Dhanpat Rai Publishing Company Ltd., New Delhi.---"
}
{
  "course code": "Chir12",
  "course title": "Chemistry ( For Ce, Me And Pie )",
  "prerequisites": "",
  "course type": "Epr",
  "course learning objectives": "To Enable The Students To Acquire Knowledge Of The Principles Of Chemistry For Engineering Applications.To Bring Adaptability To New Developments In Engineering Chemistry And A Knowledge Of Contemporary Issues Relevant To Engineering.To Make Them Apply The Knowledge Of Fundamental Chemistry For Identification, Solution And Analysis Of Complex Engineering Problems And Design System Components Or Processes That Meet The Specified Needs With Appropriate Consideration For The Public Health And Safety, And The Cultural, Societal, And Environmental Considerations.",
  "course content": "Unit 1Polymers & CompositesPolymers-Polymerization Techniques (Free Radical, Ionic And Coordination Mechanisms);Preparation, Properties And Technical Applications Of: Phenolformaldehyde Resins, Elastomers:Synthetic Rubbers (Buna-S, Buna-N, Neoprene), Inorganic Polymers: Silicones, Adhesives: EpoxyResins; Introduction And Applications Of Conducting Polymers (Polythiophene, Polyaniline) AndBiodegradable Polymers (Cellulose Acetate, Polyhydroxy Urethanes)                        (4L)Composites-Introduction; Classification And Basic Requirements Of Composite Materials;Different Matrix Materials With Examples: Polymer Matrix, Metal Matrix, Ceramic Matrix, CarbonMatrix, Glass Matrix; Nano-Composites For Electrical, Superconducting And Device Applications.(3L)Unit 2Engineering Materials & CorrosionEngineering Materials- High Energy Materials (Hems)-Introduction; Classification(Explosives, Propellants, Pyrotechnics); Requirements Of Hem: Sensitivity, DetonationPerformance, Oxygen Balance; Important Explosives (Structure, Preparation, Properties): LeadAzide, Ddnp, Dynamites, Tnt, Petn, Rdx, And Plastic Explosives; Cement-Introduction AndTypes Of Cement; Cement Composition; Setting And Hardening Of Portland Cement.    (4L) Corrosion-Introduction; Corrosion Mechanisms: Dry Corrosion And Wet Corrosion; Types OfCorrosion: Concentration/Water-Line Corrosion, Stress Corrosion (Caustic Embrittlement In BoilersAnd Seasonal Cracking), Pitting Corrosion; Factors Affecting The Rate Of Corrosion; RemedialMeasures Against Corrosion: Design, Cathodic Protection, Modification Of Environment, ProtectiveCoatings (Galvanizing And Tinning By Hot Dipping, Metal Cladding).                         (4L)Unit 3Fuels And LubricantsFuels- Introduction; Characteristics Of Good Fuel; Calorific Value (Hcv And Lcv); DeterminationOf Hcv By Bombs Calorimeter; Proximate & Ultimate Analysis Of Coal; Coal Liquefaction(Fischer-Tropsch Method); Coal Gasification (Water Gas); Bio-Diesel, Green Diesel And PowerAlcohol.                                                                                      (3L)Lubricants-Introduction; Classification; Mechanism Of Lubrication; Significant Properties OfLubricants And Their Determination (Viscosity And Viscosity Index, Cloud And Pour Point, Flash AndFire Point, Aniline Point, Carbon , Acid Value, Saponification Value, Iodine Value); Semi-Solid AndSolid Lubricants.                                                                              (4L)Unit4Water & Phase RuleWater-Softening Of Water: Zeolite Process & Demineralization By Ion-Exchange Process; PolishedWater; Boiler Problems And Remedial Measures; Desalination: Advanced ReverseOsmosis,Andelectrodialysis.                                                              (4L)Phase Rule-Description Of Various Terms (Phase, Component And Degrees Of Freedom); OneComponent System (Water And Co2Systems); Two Component System (Pb-Ag, Ki-H2O AndBenzene-Water Systems); Technical Applications: Freeze Drying, Solders, Safety Plugs And FreezingMixtures.                                                                                   (4L)",
  "course outcomes": "Upon Successful Completion Of This Curriculum Students Will Be Able To:Gain The Basic Knowledge Of Polymers And Their Applications In Day To Day Life.Understand The Basic Principles Of Fuels And Lubricants.Learn The Fundamental Principles Of Explosives, Energetic Properties, Their Applications In Civil As Well As Military Applications And Safety Standards For Their Safe Use.",
  "credits": "3",
  "reference books": "---"
}
{
  "course code": "",
  "course title": "Chemistry (For Ece And Ee)",
  "prerequisites": "",
  "course type": "Epr",
  "course learning objectives": "To Introduce The Students To Basic Principles Of Batteries, Fuel Cell Construction And TheImportance Of Advanced Polymers.To Make The Students Learn About Importance Of Nano And Advanced Materials.To Introduce The Spectroscopy And Applications Of Photochemistry.",
  "course content": "Unit 1PolymersIntroduction To Industrially Important Polymers: Liquid-Crystal Polymers (Lcp), ConductingPolymers (Cp), Interpenetrating Polymer Network (Ipn), Smart Polymers Or Stimuli-ResponsivePolymers, Polymer Blends And Polymer Composites;Conducting Polymers:Methods Of SynthesisAnd Properties Of Polyaniline (Pani), Polypyrrol (Ppy) And Polythiophene (Pth); Applications OfThese Polymers In Advanced Technologies.                                                  (7L)Unit 2BatteriesPhysical Concepts; Introduction To Primary, Secondary And Flow Batteries: Zn-Ago, Nickel-MetalHydride, Metal-Acid And Lithium Ion Batteries-Construction, Working Principle, Operation AndApplications; Fuel Cells: Methanol-Oxygen,Solid Oxide Fuel Cell (Sofc) And PolymerElectrolyte Fuel Cell (Pefc)- Construction, Working Principle And Applications;Solar Battery-Working Principle And Applications.                                                      (7L)Unit 3Advanced MaterialsComposite Materials: Introduction; Different Types And Applications. Photovoltaic Materials:Solar Cells And Dye Sensitized Solar Cells- Principle And Applications. Nanomaterials:Synthesis,Characterization And Applications Of Nano Materials (Fullerene, Graphene, Carbon Nanotubes AndQuantum Dots) In Electronic And Nano Devices.                                             (8L)Unit 4Photochemistry And SpectroscopyPhotochemistry:Introduction; Significance;Laws Governing Light Absorption; Excited States,Jablonski       Diagram;     Fluorescence,      Phosphorescence,     Chemiluminescence      AndPhotosensitisation;Applications In Light Emitting Diodes (Led), Laser, Photodynamic Therapy AndArtificial Photosynthesis.                                                                (4L)Spectroscopy: Introduction To Atomic Spectroscopy And Molecular Spectroscopy; InstrumentationAnd Applications Of: Ultra Violet-Visible (Uv-Vis), Infrared (Ir) And Nuclear MagneticResonance (Nmr) Spectroscopy For Material Characterization.                            (4L)",
  "course outcomes": "Upon Completing This Curriculum:Students Will Learn The Significance And Applications Of Industrially Important Advanced Polymers.Students Will Be Able To Understand The Basics Of Batteries And Their Working.Students Will Get Knowledge In Spectroscopic Techniques And Applications Of Photochemistry In Engineering.",
  "credits": "3",
  "reference books": "%1. Materials Science And Engineering: An Introduction: W. D. Callister, Wiley India Pvt. Ltd., New Delhi. 2. Engineering Chemistry: P.C. Jain And Monica Jain(16Th Edition), Dhanpat Rai Publishing Company, New Delhi. 3. A Text Book Ofengineering Chemistry: Shashi Chawla(3Rd Edition),Dhanpat Rai Publishing Company, New Delhi. 4. A Text Book Ofengineering Chemistry: S. S. Dara And S. S. Umare(12Th Edition), S. Chand Publishing Company, New Delhi. 5. An Introduction To Composite Materials: D. Hull And T. W. Clyne, Cambridge University Press. 6. A Text Book Ofengineering Chemistry: O. G. Palanna(4Th Reprint 2012), Mcgraw Hill, New Delhi. 7. Principles Of Physical Chemistry: Puri, Sharma And Pathania, W. H. Freeman And Company. 8. Fundamentals Of Molecular Spectroscopy: C. N. Benwell And E. M. Mccash, Tata Mcgraw Hill Publishing Co. Ltd., New Delhi.---"
}
{
  "course code": "",
  "course title": "Chemistry (For Cs And It)",
  "prerequisites": "",
  "course type": "Epr",
  "course learning objectives": "To Introduce The Students To Basic Principles Of Molecular Modelling And ApplicationsOf Computers In ChemistryTo Introduce The Students To Basic Principles Of Batteries, Fuel Cell Construction And TheImportance Of Advanced Polymers.To Give The Students The Knowledge Of Engineering Materials And Their Applications InIndustry.",
  "course content": "Unit 1Molecular ModellingPotential Energy Surface: Energy Minimisation, Geometry Optimisation, Conformational Analysis,Global And Local Minimum Determination, Approaches And Problems, Bioactive Vs Global MinimaConformations, Automated Methods Of Conformation Search, Advantages And Limitations OfAvailable Softwares.                                                                   (8 L)Unit 2Engineering MaterialsComposite Materials: Introduction; Different Types And Applications. Photovoltaic Materials:Solar Cells And Dye Sensitized Solar Cells- Principle And Applications. Nanomaterials:Synthesis,Characterization And Applications Of Nano Materials (Fullerene, Graphene, Carbon Nanotubes AndQuantum Dots) In Electronic And Nano Devices.                                             (8L)Unit 3BatteriesPhysical Concepts; Introduction To Primary, Secondary And Flow Batteries: Zn-Ago, Nickel-MetalHydride, Metal-Acid And Lithium Ion Batteries-Construction, Working Principle, Operation AndApplications; Fuel Cells: Methanol-Oxygen,Solid Oxide Fuel Cell (Sofc) Andpolymer ElectrolyteFuel Cell (Pefc)-Construction, Working Principle And Applications;Solar Battery-WorkingPrinciple And Applications.                                                              (7L)Unit 4PolymersIntroduction To Industrially Important Polymers: Liquid-Crystal Polymers (Lcp), ConductingPolymers (Cp), Interpenetrating Polymer Network (Ipn), Smart Polymers Or Stimuli-ResponsivePolymers, Polymer Blends And Polymer Composites;Conducting Polymers:Methods Of SynthesisAnd Properties Of Polyaniline (Pani), Polypyrrol (Ppy) And Polythiophene (Pth); Applications OfThese Polymers In Advanced Technologies.                                                  (7L)",
  "course outcomes": "Upon Completion Of This Curriculum:Students Will Be Able To Understand The Principles Of Molecular Modelling And Applications Of Computers In ChemistryStudents Will Learn The Significance And Construction Of Batteries And Fuel Cells",
  "credits": "3",
  "reference books": "Quantum Mechanics, Errol G. Lewars, Springer %2011. 9. Introduction To Computational Chemistry, Frank Jensen, Third Ed. Wiley.---"
}
{
  "course code": "",
  "course title": "Chemistry Lab(Common For All)",
  "prerequisites": "",
  "course type": "Elr",
  "course learning objectives": "To Learn About Laboratory Skills.To Get A Knowledge About Some Important Labotatory Techniques Used In Quantitative Assessment Of Lubricant Properties.To Learn About Working Of Instruments In Characterization Of Advanced Materials. Laboratory Experiments 1) Preparationof Phenol-Formaldehyde Resin. 2) Determination Of Viscosity Of Lubricants By Redwood Viscometer. 3) Determination Of Acid Value Of Lubricant Oil. 4) Determination Of Saponification Value Of Lubricant Oil. 5) Determination Of Flash And Fire Point Of Lubricant.-1 6) Determination Of The Strength (Gl ) Of Strong Acid And Strong Base/Weak Acid And StrongBase Using Conductometrictitration Method. 7) Investigation On Effects Of Different Substitutions On Electronic Absorption Bands Of AromaticCompounds Using Uv-Vis Spectroscopy. 8) Assignment Of Functional Groups Of Given Organic Compounds(Acids, Esters, Alcohols,Aldehydes, Amines Etc.) By Ir Spectroscopic Technique. 9) Determination Of Calcium As Calcium Oxide Volumetrically In Cement Extract Solution. 10) Synthesis Of High Energy Materials: (A) Tri-Nitroresorcinol (B) Tri-Nitrophloroglucinol AndTheir Characterization By Different Spectroscopic Techniques (Uv-Vis, Ir And Nmr). 11) Analysis Of Composite Solids By Different Characterization Techniques (Xrd, Ir,Absorbance And Emission Spectra). 12) Investigatory Project Based On Syllabus.Note: Eight To Ten Experiments Out Of The List Shall Be Performed By The Students.",
  "course content": "",
  "course outcomes": "",
  "credits": "1",
  "reference books": "1. Applied Chemistry-Theory And Practice: O. P. Virmani And A. K. Narula, New Age IndiaPublishers, New Delhi.2. Essentials Of Experimental Engineering Chemistry: Shashi Chawla, Dhanpat Rai PublishingCompany Ltd., New Delhi.3.A Text Book On Experiments And Calculations In Engineering Chemistry: S. S. Dara, S. ChandAnd Company Ltd., New Delhi."
}
