{
  "course code": "Csir11",
  "course title": "Basics Of Programming",
  "prerequisites": "",
  "course type": "Epr",
  "course learning objectives": "\nThe Objective Of This Course Is To Provide Fundamentals Of Problem Solving Using C Language Programming.\n",
  "course content": "\n1. Programming Fundamentals & Control Statements: Block Diagram Of Computer, Hardware Vs Software, Concept Of Operating System And Compiler, Software Development Life Cycle And Structured Programming. Introduction To C Programming, Basic Programming Using Input And Output Operators And Expressions, Programming Using If And If-Else, Programming Using Looping-For, While, Do-While; Use Of Switch And Break.\n2. Arrays Based Programming Defining And Processing 1-D And 2-D Arrays For Problem Solving.\n3. Modular Programming Using Functions Defining And Calling A Function, Modular Programming Using Functions, Passing Arguments And Arrays To Functions, Functions Of Void And Returning Values.\n4. Programming Using Strings & Structures Defining And Processing String As Array Of Character, Use Of Null Char, Defining And Processing Structures, Passing Strings And Structures To Functions.\n",
  "course outcomes": "",
  "credits": "3",
  "books": "\n1. Byron S. Gottfried, Programming With C Language, Schaum Series, Tata Mcgraw Hill, 2015.\n2. E Balaguruswamy, Programming With C, Tata Mcgraw Hill, 2015.\n3. Kernighan & Richie, C Programming, Prentice Hall Of India, 2002.\n"
}
{
  "course code": "Csir13",
  "course title": "Introduction To Discipline Engineering",
  "prerequisites": "",
  "course type": "Epr",
  "course learning objectives": "\nThe Objective Of This Course Is To Provide Knowledge Of The Core Branch Of Engineering And Technology\nAnd Different Courses That The Student Is Going To Study In Next Four Years.\n",
  "course content": "",
  "course outcomes": "\n1. Understand The Use Of Software And Programming For Problem Solving.\n2. Learn Programming Using Simple Concepts Of Input, Output And Control Statements.\n3. Use Arrays, Functions, Strings And Structure For Problem Solving.\n\n",
  "credits": "2",
  "books": ""
}
{
  "course code": "Cspc10",
  "course title": "Digital System Design",
  "prerequisites": "",
  "course type": "Pc",
  "course learning objectives": "",
  "course content": "\n1. Overview Of Cse & It As A Discipline, Differentiation Between Cs & It, Broader Industrial Applications Of Cse &It Such As Software Development, Database Oriented Applications, Computer Networks And Related Applications, System Oriented Scope At Operating System Level And Hardware Level.\n2. Programming Oriented Directions And Scope, Competitive Programming, Algorithms And Their Performance Related Issues; Necessity Of Data Base Systems And Its Applications, Discussion About Data Mining; Conceptual Overview Of Computer Architecture, Operating System'S Functioning,\n8 Automata Theory And Its Applications, Basics Of Computer Networks And Recent Developments In This Area; Visit To Department Labs, Ccn And Server Rooms, Library And Institute Automation Software.\n3. Overview Of Adding Intelligence To Machines Using Soft Computing, Importance Of Information Security And Introduction To Basis Terminologies Such As Virus, Worm, Trojan, Vulnerabilities, Denial Of Services, Ethical Hacking Overview Of Applications And Scope Of Mobile Application Development, Image Processing And Natural Language Processing.\n4. Recent Developments In The Area Of Computer Vision, And Human Computer Interaction Awareness About Cloud And Distributed Computing Technologies And Issues Behind Social Networking Oriented System Design And Development Futuristic Areas Like Machine Learning, Big Data Analytics.\n",
  "course outcomes": "\n1. Student Will Be Aware Of Different Domains Of The Computer Engineering And Information Technology.\n2. Student Will Be Able To Distinguish Between Core And Elective Courses Being Offered In The Programme Of Study.\n3. Student Will Become Aware Of Facilities And Infrastructure Of The Department.\n\n\n---",
  "credits": "3",
  "books": ""
}
{
  "course code": "Cspc12",
  "course title": "Data Structures",
  "prerequisites": "Csir11",
  "course type": "Pc",
  "course learning objectives": "\n1. To Provide The Basic Knowledge Gates, Number Systems And Their Arithmetic, Computer Codes, Digital Logic Families, Sop And Pos Simplifications.\n2. Ability To Design Msi Circuits.\n3. Gain Knowledge About The Function Of Flip-Flops, Counters, Registers.\n4. Understanding The Concepts Of Sequential Circuits.\n",
  "course content": "\n1. Number Systems And Codes Introduction To The Positional Number System, Signed Magnitude Numbers, Floating Point Numbers, Binary Arithmetic: Addition, Subtraction, Multiplication And Division, Base Conversion, Conversion Formulas With Examples, Ones And Twos Compliment Arithmetic, Computer Codes  Bcd Codes, Gray Codes, Excess-3 Codes, Parity Checks, Hamming And Alphanumeric Codes.\n2. Digital Logic Families Introduction To Digital Ics, Ttl, Schottky Ttl, Ecl, Mos Logic, Cmos Logic, Tri-State Logic: Characteristics And Properties.\n3. Combinational Logic Design Introduction, Standard Representations For Logical Functions, Karnaugh Map Representation, Simplification Of Logical Functions Using K-Map, Minimization Of Logical Functions Specified In Minterms/Maxterms Or Truth Table, Minimization Of Logical Functions Not Specified In Minterms/Maxterms, Dont Care Conditions, Design Examples, Ex-Or And Ex-Nor Simplification Of K- Maps, Five And Six-Variable K-Maps, Qm Method, Mev Method, Introduction Of Multiplexers And Their Use In Combinational Logic Design, Demultiplexers/Decoders And Their Use In Combinational Logic Design, Adders And Their Use As Subtractors, Digital Comparators, Parity Generators/Checkers, Code Converters, Priority Encoders, 7-Segment Decoder/Driver.\n4. Synchronous Sequential Circuits And Asynchronous Sequential Circuits Introduction, Fsm Model, Memory Elements And Their Excitation Functions. Synthesis Of Synchronous Sequential Circuits, Capabilities And Limitation Of Fsm, State Equivalence And Minimization, Simplification Of Incompletely Specified Machines, Fundamental Mode Circuits Synthesis, State Assignment, Pulse Mode Circuits.\n",
  "course outcomes": "\n1. Understand The Basic Fundamentals Of Digital Systems.\n2. Apply Fundamental To Implement Real Systems That Are Useful For The Society.\n3. Understand The Basic Concept Of Synthesis Of Synchronous As Well As Asynchronous Sequential Circuits.\n\n\n---",
  "credits": "4",
  "books": "\n8\n1. R.P. Jain: Modern Digital Electronics, Tmh.\n2. Z Kohavi: Switching And Finite Automata Theory, Tmh\n3. M.M. Mano: Digital Logic Design, Phi.\n4. Dr. B.R. Gupta: Digital Electronics, Katson.\n5. James W. Bignell& Robert Donovan: Digital Electronics, Cengage Learning .\n6. Sanjay Kumar Bose: Digital Systems, New Age International Publishers\n"
}
{
  "course code": "Cspc14",
  "course title": "Object Oriented Programming Using C++",
  "prerequisites": "",
  "course type": "",
  "course learning objectives": "\n1. This Course Introduces The Concept Of Data Structures Used In Various Computer Science Applications.\n2. The Students Are Introduced To Understand And Efficiently Apply Various Data Structures Such As Stacks, Queues, Linked Lists, Trees And Graphs For Solving Various Computing Problems Using C Programming Language.\n",
  "course content": "\n1. Fundamentals Of Pointers & Files: Pointers In C: Pointer Declaration, Passing Pointer To Functions, Pointers And Arrays, Dynamic Memory Allocation, Files And Related Operations. Searching Techniques: Linear And Binary, Sorting Techniques: Selection, Bubble, Insertion, Merge Sort, Quicksort.\n2. Simple Data Structures Arrays Based Linear Data Str: Array Storage, Sparse Arrays; Transpose, Addition, And Multiplication Of Sparse Matrices, Stacks And Queues And Their Applications, Multiple Stacks And Queues In An Array.\n3. Linked Data Structures Singly, Doubly & Circular Linked Lists; Representation, Operations And Applications, Linked Stacks And Queues. Linked Lists Based Polynomial Addition\n4. Advanced Data Structures Trees, Basic Concepts And Definitions Of A Tree And Binary Tree And Associated Terminology, Binary Tree Traversal Techniques, Some More Operations On Binary Trees, Heaps And Heapsort.\n",
  "course outcomes": "\n1. Develop Skill To Identify And Determine The Usage Of Various Data Structures, Operations, Associated Algorithms And Implement Their Applications.\n2. Apply Knowledge Of Pointers, Memory Allocation And String Handling For Solving Programming Problems.\n3. Understand The Concept Of Trees And Graphs, Their Implementation And Applications.\n4. Able To Implement Standard Algorithms For Searching And Sorting.\n5. Analyze Efficiency Of Different Algorithms Using Time And Space Complexity.\n8\n---",
  "credits": "4",
  "books": "\n1. E Horowitz And S. Sahni: Fundamentals Of Data Structures In C, Second Edition, Universities Press, Hyderabad.\n2. R.L. Kruse: Data Structures & Program Design In C, Phi.\n3. D.F. Knuth: The Art Of Computer Programming Vol 1, Narosa Publications, 1985.\n4. Byron S. Gottfried & J K Chhabra: Theory And Problems Of Programming With C Language, Schaums Outlines Series, Tmh, 2005.\n"
}
{
  "course code": "Csir12",
  "course title": "",
  "prerequisites": "Csir11",
  "course type": "Pc",
  "course learning objectives": "\n1. Able To Differentiate Between Structure Oriented Programming And Object Oriented Programming And To Specify Simple Abstract Data Types And Design Implementations\n2. Recognize Features Of Object Oriented Design Such As Encapsulation, Polymorphism, Inheritance And Composition Of Systems Based On Object Identity.\n3. Able To Use Object Oriented Programming Language Like C++ And Associated Library To Develop Object Oriented Programs.\n4. Able To Understand And To Use Basic Fundamentals Of Java.\n",
  "course content": "\n1. Object Oriented Programming And Design Review Of Abstraction, Objects And Other Basics, Encapsulation, Information Hiding, Method, Signature, Classes And Instances, Polymorphism, Inheritance, Exceptions And Exception Handling With Reference To Object Modeling, Object Oriented Design  Process, Exploration And Analysis.\n2. C++ Programming Basics Fundamentals: Variables And Assignments, Input And Output, Data Types And Expressions, Flow Of Control, Subprograms: Top Down Design, Predefined Functions, Programmer Defined Functions, Procedural Abstractions, Local Variables, Overloading Function Names, Parameter Passing, Structures For Diverse Data, Structures As Function Arguments, Initializing Structures, Defining Classes And Member Functions, Public And Private Members ,Constructors For Initializations, , Destructors, Copy Constructors, Friend Functions.\n3. C++ Object Oriented Concepts Objects And Classes: Operator Overloading , Overloading The Assignment Operator ,Subscript Operator , This Pointer ,Use Of File For I/O, Formatting Output With Stream Functions, Character I/O, Inheritance, Constructors In Inheritance , Standard C++ Classes, Derived Classes ,Virtual Functions, Virtual Base Class.\n4. C++ Data Structures And Advanced Topics Arrays  Programming With Arrays, Arrays Of Classes, Arrays As Function Arguments, Strings, Multidimensional Arrays, Arrays Of Strings, Pointers, Dynamic Arrays, Classes And Dynamic Arrays, Templates  Generic Classes And Functions, Namespaces, Introduction To Stl.\n5. Introduction To Java Data Types, Variables And Assignment, String And Characters, Arrays, Control Statements, Loops, Operators.Introduction To Classes, Constructors, This Keyword, Static, Local And Instance Variables, Methods, Method Overloading, Method Overriding, Subclasses, Inheritance, Modifiers, Polymorphism.\n",
  "course outcomes": "\n1. Able To Differentiate Between Structure Oriented Programming And Object Oriented Programming And To Specify Simple Abstract Data Types And Design Implementations\n\n\n8\n2. Recognize Features Of Object Oriented Design Such As Encapsulation, Polymorphism, Inheritance And Composition Of Systems Based On Object Identity.\n3. Able To Use Object Oriented Programming Language Like C++ And Associated Library To Develop Object Oriented Programs.\n4. Able To Understand And To Use Basic Fundamentals Of Java.\n\n\n---",
  "credits": "0",
  "books": "\n1. Herb Schildt: C++ - The Complete Reference, Tmh, Delhi\n2. R.Venugopal :Mastering C++,Tmh,Delhi\n3. Bruce Eckel : Thinking In C++ Volume I ,Pearson Education,Delhi.\n4. Horstmann: Computing Concepts With C++ Essentials, John Wiley.\n5. Joseph Oneil And Herb Schildt: Teach Yourself Java, Tmh, Delhi.\n6. Gary Cornell , Sun Microsystems: Core Java 2,Pearson Education, Delhi.\n\n"
}
{
  "course code": "",
  "course title": "Engineering Graphics (Web Designing)",
  "prerequisites": "",
  "course type": "Epr",
  "course learning objectives": "\n1. Introduction And Brief History Of World Wide Web (Www).\n2. Web Essentials: Html, Xhtml, Css.\n3. Addressing Web Standards, Audience Requirements And Principles Of Web Page Design.\n4. Introduction Of Web Architecture.\n",
  "course content": "\n1. Introduction: Brief History Of Internet, Introduction To World Wide Web, Basic Principles Involved In Developing A Web Site, Rules Of Web Designing, Web Standards, Audience Requirements, Design Concept.\n2. Web Essentials And Standards: Clients, Servers, Introduction To Markup Languages, Scripting Languages, Introduction To Elements Of Html, Xhtml And Css, Introduction To Document Object Model (Dom), Working With Text, List, Tables, Frames, Hyperlinks, Images Multimedia, Forms And Controls. Css Properties, Id And Class, Box Model, Creating Page Layout And Site Designs\n3. Javascript Javascript As Programming Language, Data Types, Values, Variables, Expressions And Operators. Javascript Statements, Loops, Arrays, Strings, Methods, Defining And Invoking Functions And Their Closure, Random Functions And Maths Library, Representing Dates. Pattern Matching And Regular Expressions. Javascript In Web Browsers, Difference Between Server Side And Client Side Javascript, Embedding Javascript In Html And Frameworks, Changing Css Style, Hiding Html Elements, Showing Hidden Html Elements. Dom And Event Handling, Error Handling, Mouse, Text, Drag, Drop And Keyboard Events And Node Operations, Node Operations, Cookies, Scripted Http, Animation And Multimedia Forms Of Debugging.\n4. Website Development Tools Google Web Designer, Macaw, Sketch, Firefox, Yslow, Wordpress, Openelement Etc.\n",
  "course outcomes": "",
  "credits": "2",
  "books": "\n1. Thomas A Powell, Html: The Complete Reference, Tata Mcgraw Hill Publications.\n2. Scott Guelich, Shishir Gundavaram, Gunther Birzniek; Cgi Programming With Perl 2/E, Oreilly\n3. Doug Tidwell, James Snell, Pavel Kulchenko; Programming Web Services With Soap, O Reilly\n4. Robert. W. Sebesta, \"Programming The World Wide Web\", Fourth Edition, Pearson Education, 2007.\n5. Yong, Xml Step By Step, Phi.\n6. Chris Bales, Web Programming- Building Internet Application.\n7. Deitel, Deitel, Goldberg, \"Internet & World Wide Web How To Program\", Third Edition, Pearson Education, 2006.\n8. Marty Hall And Larry Brown, Core Web Programming Second Edition, Volume I And Ii, Pearson Education, 2001.\n"
}
{
  "course code": "Cspc21",
  "course title": "Design And Analysis Of Algorithms",
  "prerequisites": "Cspc12",
  "course type": "Pc",
  "course learning objectives": "\n1. Able To Design, Implement And Analysis Of Standard Searching And Sorting Algorithms.\n2. Implement Standard Divide And Conquer, Dynamic Programming, Greedy And Backtracking Algorithms.\n3. Able To Implement Between Different Data Structures I.E., Trees, Heaps Etc. Also, Able To Pick An Appropriate Data Structure For Any Given Design Situation.\n4. Able To Implement The Major Graph Algorithms And Their Analysis.\n",
  "course content": "",
  "course outcomes": "\n1. Understand Basic Principles Of Web Site Design, Considering The Information Architecture.\n2. Incorporate Best Practices In Navigation, Usability In Website Design\n3. Design Of Website Adhering To Current Web Standards (Html, Xml, Css)\n4. Learning Various Scripting Languages To Create Interactive Components In Web Pages.\n\n\n8\n---",
  "credits": "5",
  "books": ""
}
{
  "course code": "Cspc23",
  "course title": "Java Programming",
  "prerequisites": "Csir11",
  "course type": "Pc",
  "course learning objectives": "",
  "course content": "\n1. Introduction Concept Of Time And Space Complexity, Analysis Of Algorithms, Asymptotic Notation, Recurrence Relations, Design And Analysis Of D & C Problems Like Quick Sort Etc, Heap Sort, Priority Queues, Sorting In Linear Time, Hashing, Binary Search Trees.\n2. Graph Algorithms Graph Representation & Traversal (Search), Topological Sort, Strongly Connected Components, Minimum Spanning Trees  Kruskal And Prims, Single Source Shortest Paths, Relaxation, Dijkstras Algorithm, Bellman-Ford Algorithm, Single Source Shortest Paths For Directed Acyclic Graphs, All-Pairs Shortest Path.\n3. B-Trees And Dynamic Programming B-Trees: Representation And Operations; Elements Of Dynamic Programming, Structure And Steps, Matrix-Chain Multiplication, Longest Common Subsequence.\n4. Greedy & Backtracking Approaches: Greedy Algorithms  Elements, Activity-Selection Problem, Huffman Codes, Task Scheduling Problem, Knapsack Problem, Backtracking  Elements, 8  Queens, Graph Coloring, Hamiltonian Cycles.\n",
  "course outcomes": "\n1. Able To Design, Implement And Analysis Of Standard Searching And Sorting Algorithms.\n2. Implement Standard Divide And Conquer, Dynamic Programming, Greedy And Backtracking Algorithms.\n3. Able To Implement Between Different Data Structures I.E., Trees, Heaps Etc. Also, Able To Pick An Appropriate Data Structure For Any Given Design Situation.\n4. Able To Implement The Major Graph Algorithms And Their Analysis.\n\n---",
  "credits": "4",
  "books": "\n1. Cormen, Leiserson And Rivest: Introduction To Algorithms, 3/E, Phi.\n2. Horowitz, Sahni, And Rajasekaran: Fundamentals Of Computer Algorithms, Second Edition, Universities Press, Hyderabad.\n3. Aho, Hopcroft, And Ullman: The Design And Analysis Of Computer Algorithms, Addison Wesley.\n"
}
{
  "course code": "Cspc25",
  "course title": "Database Systems",
  "prerequisites": "",
  "course type": "",
  "course learning objectives": "\n1. Building Robust Applications Using Java'S Object-Oriented Features.\n2. Understanding The Usage Of Java Class Libraries.\n\n8\n3. Building Multithreaded, Platform-Independent And Gui Based Java Applications For Business Problems.\n",
  "course content": "\n1. The Overview Of Javas Architecture And The Architecture Of The Java Virtual Machine (Jvm). Classes: Declaring Members (Fields And Methods), Instance Members, Static Members. Objects: Class Instantiation, Reference Values, And References, Object Aliases. Basic Language Elements, Primitive Data Types, Variable Declarations, Initial Values For Variables, Class Declarations, Method Declarations, This Reference, Method Overloading, Constructors, The Default Constructor And Constructors Overloading. Arrays, Anonymous Arrays, Multidimensional Arrays, Variable Arity Methods, The Main() Method, Program Arguments.\n2. Packages: Defining Packages, Using Packages, Compiling Code Into Packages, Running Code From Packages. Scope Rules, Accessibility Modifiers, Overview Of Other Modifiers For Members. Operators And Expressions, Overview Of Control Flow Statements. Exception Handling: The Try Block, The Catch Block, The Finally Block, The Throw Statement, The Throws Clause, Checked And Unchecked Exceptions, Defining New Exceptions.\n3. Object-Oriented Programming: Single Implementation Inheritance, Overriding Methods, Hiding Members, The Object Reference Super, Chaining Constructors Using This() And Super() Interfaces: Defining Interfaces, Abstract Method Declarations, Implementing Interfaces, Extending Interfaces, Interface References, Constants In Interfaces, Polymorphism And Dynamic Method Lookup. Fundamental Classes: Overview Of The Java.Lang Package, The Object Class, The Wrapper Classes, The String Class, The Stringbuilder And The Stringbuffer Classes.\n4. Multithreading: Overview Of Threads, The Main Thread, Thread Creation, Synchronization, Thread Transitions. Basics Of Event Handling, Graphics Programming Using Awt And Swing, An Overview Of The New Features Of Java 7 & 8.\n",
  "course outcomes": "\n1. Write Java Programs That Solve Simple Business Problems.\n2. Create Java Applications That Are Robust And Multithreaded.\n3. Write Simple Gui Interfaces For A Program To Interact With Users, And To Understand The Event-Based Gui Handling Principles.\n\n\n---",
  "credits": "5",
  "books": "\n1. Bruce Eckel, Thinking In Java, Pearson Education, 4 Ed., 2006.\n2. Dietel & Deitel, Java How To Program, Pearson Education, 10 Ed., 2015.\n3. Kathy Sierra & Bert Bates, Head First Java, Oreilly, 2 Ed., 2005.\n4. Cay S. Horstmann & Gary Cornell, Core Java. Volume I, Fundamentals, Sun Microsystems Press, 8 Ed., 2008.\n"
}
{
  "course code": "Cspc27",
  "course title": "Software Engineering",
  "prerequisites": "",
  "course type": "Pc",
  "course learning objectives": "\n1. To Understand Fundamentals Of Data Models And To Conceptualize A Database System For User Requirement.\n2. To Study The Fundamental Of Database Query Language, Like Sql And Relational Algebra.\n3. To Learn The Concept Of Normalization In Database Design.\n4. To Learn Fundamental Concepts Of Transaction Processing, Concurrency Control Techniques And Database Recovery Procedure.\n5. Understand The Professional, Ethical And Security Issues And Responsibilities In Database Design.\n",
  "course content": "\n\n\n8\n1. Introduction: Overview Of File Systems And Database Systems , Software Architecture Of A Typical Dbms, Data Models, Relational Data Model, Network Data Model, Hierarchical Data Model, Schemas And Instances, Database Administration And Control.\n2. Relational Model And Query Language: Overview Of Relational Database, Key Integrity Constraint, Relational Algebra, Relational Calculus: Domain Relational Calculus, Tuple Relational Calculus, Sql Fundamentals, Basic Operators, Missing Information, Null Values, Additional Operations, Advanced Sql Features, Embedded Sql, Dynamic Sql, Database Views.\n3. Database Design: Overview Of Normalization, Database Anomalies, Functional Dependencies, Candidate And Super Key, Non-Loss Decomposition, Dependency Preservation, Normal Forms: First, Second, Third Normal, Boyce Codd Normal Form, Multi-Valued Functional Dependencies And Fourth Normal Form, Join Dependencies And Fifth Normal Form, Denormalization.\n4. Transaction Processing: Overview Of Database Transactions, Transaction States, Transaction Recovery, Acid Properties, Transaction Recovery: Two Phase Commit, Commit Points, Serializability, Concurrency Control: Need For Concurrency, Locking Protocols: Binary Lock, Two Phase Lock, Deadlock, Starvation, Transaction Timestamp.\n",
  "course outcomes": "\n1. To Understand Fundamental Concepts, Principles And Applications Of Database System.\n2. To Demonstrate Database Related Programming Languages And Perform The Basics Of Commercial Relational Systems.\n3. To Apply The Concepts Of Normalization On Database Design.\n4. To Design And Implement A Small Database Project, Considering The Issues Like Concurrency Control, Recovery And Security.\n5. Comprehend Contemporary Issues Related To Industry And Government Related To Database Domain.\n\n\n---",
  "credits": "4",
  "books": "\n1. A Silberschatz, H.F. Korth & S. Sudarshan: Data Base System Concepts, Tmh, 1997.\n2. A.K. Majumdar And Bhattacharyya: Database Management Systems, Thm, 1996.\n3. C.J. Date: An Introduction To Database Systems 7Th Ed. Addison Wesley, Indian Edition, 2000.\n4. Elmasri & Navathe : Fundamentals Of Database Systems/Oracle 9I Programming 5Th Ed. Pearson, 2009.\n"
}
{
  "course code": "Cspc29",
  "course title": "Computer Organization And Architecture",
  "prerequisites": "",
  "course type": "Pc",
  "course learning objectives": "\n1. Study The Current Software Engineering Techniques And Examines The Software Life-Cycle, Including Software Specification, Design Implementation, Testing And Maintenance.\n2. Present Software Engineering Methodologies For The Development Of Quality, Cost-Effective, Schedule- Meeting Software.\n3. Develop An Understanding Of Ethical And Professional Issues Related To Software Project Delivery.\n",
  "course content": "\n1. Introduction: Introduction Of Software (Sw), Type Of Software, Sw Components: Process, People, Project, Product, Software Crisis, Software Process Models: Details Of People Involve In Each Process, Sdlc Methods/Models: Build & Fix, Waterfall, Prototype (Evolutionary & Throw-Away), Iterative, Incremental Iterative, Spiral, Rad, Agile Methodology.\n2. Requirement Analysis & Specifications: Requirement Analysis, Requirement Specification, Approaches To Requirement Analysis, Specifying Behavioural & Non-Behavioural Requirements, Srs Components & Various Users Of Srs. Introduction Of Requirement Specification: Dataflow(Df) Diagram, Data Dictionaries, Entity-Relationship (Er) Diagram, Object Diagram Etc., Requirement Validation.\n8\n3. Software Design And Testing: Design Architecture And Patterns, Modularity, Function Oriented Design, Object Oriented Design, Software Testing: Software Testing Strategy And Techniques, Functional Testing, Structural Testing, Debugging And Testing Tools, Sw/Hw Reliability, Reliability Concepts And Models, Reliability Allocation, Software Maintenance: Introduction To Sw Maintenance And Types, Sw Maintenance Models: Re-Engineering & Forward Engineering.\n4. Software Project Planning: Role Of Software Project Planning, Estimation Method, Estimation Of Effort & Schedule, Software Metrics: Introduction To Size Metrics, Data Structure Metrics, Information Flow Metrics, Entropy-Based Measures, Metric Analysis. Basic Cocomo, Intermediate Cocomo, Detailed Cocomo, Quality Planning, Planning Parameter, Quality Defect Removal Cycle, Role Of Risk Analysis.\n",
  "course outcomes": "\n1. Able To Apply The Concepts And Choose An Appropriate Sdlc Process Model For User Requirements.\n2. To Analyze Requirement Techniques Like Data Flow Diagram, Entity Relationship Diagram Etc.\n3. Understanding The Concept Of Software Design And Emphasizing Upon Various Software Metrics Used For Analyzing The Software.\n4. Demonstrate Various Testing Methodologies And Debugging Tools For A Prototype Software.\n5. Design Various Software Reliability Measures To Assess The Quality Of Software In Case Of Various Faults And Failures.\n\n\n---",
  "credits": "0",
  "books": "\n1. R.S. Pressman, Software Engineering  A Practitioners Approach, 6Th Edition, Tmh, 2013.\n2. Ian Sommerville, Software Engineering, 8Th Edition, Addison Wesley, 2009.\n3. Pankaj Jalote, An Integrated Approach To Software Engineering, Narosa Publishing, 2010.\n4. K.K.Aggarwal, Yogesh Singh: Software Engineering, New Age International Ltd, 2001.\n"
}
{
  "course code": "",
  "course title": "",
  "prerequisites": "Cspc10",
  "course type": "Pc",
  "course learning objectives": "\n1. Working Of Computer Systems & Its Basic Principles\n2. Concepts Of Processor And Control Design.\n3. Concepts Of Pipelining Techniques.\n4. Memory Hierarchy And Its Organization.\n5. Concept Of I/O Devices And Working.\n",
  "course content": "\n1. Introduction Introduction To Digital Electronics: Combinational Circuits And Sequential Circuits. Basic Machine Principle, Structure And Representation Of Real World Data. Subroutine, Branching & Macro Facility.\n2. Processor Design Processor Organization, Information Representation And Number Format, Instruction Cycle And Instruction Format, Addressing Modes, Arithmetic Operation, Timed Point Addition, Subtraction, Multiplication And Division, Alu Design, Parallel Processing  Performance Consideration, Pipeline Processor.\n3. Control Design Instruction Sequencing And Interpretation, Hardware Control Design Method And Microprogrammed Control.\n4. Memory Organization\n\n\n8 Memory Device Characteristic, Random Access And Serial Access Memories, Virtual Memory  Memory\nHierarchies, Page Replacement Policies, Segments, Pages And File Organization, High Speed Memories\nCache And Associative Memory.\n5. System Organization Programmed I/O, Dma And Interrupts, I/O Processors & Cpu  I/O Interaction.\n",
  "course outcomes": "\n1. Understand The Computer System Concepts.\n2. Understand The Organization Of A Computer System In Terms Of Its Main Components\n3. Understand The Processor And Control Design Of A Computer System.\n4. Understand The Various Types Of Memory.\n5. Understand Input/Output Mechanisms.\n\n\n---",
  "credits": "4",
  "books": "\n1. M.M. Mano: Computer System Architecture, 3 Ed. Phi.\n2. J.P. Hayes: Computer Architecture And Organization, 3Rd Ed. Tmh, 1999.\n3. C.W. Gear: Computer Organization And Programming, Tmh.\n4. T.C. Bartee: Digital Computer Fundamental, Tmh.\n5. A. S. Tanenbaum: Computer System Organization, Phi.\n"
}
{
  "course code": "Cspc20",
  "course title": "Operating Systems",
  "prerequisites": "",
  "course type": "Pc",
  "course learning objectives": "\n1. To Understand The Services And Design Of An Operating System.\n2. To Understand The Structure And Organization Of File System\n3. To Understand The Process States And Various Concepts Such As Scheduling And Synchronization Related With It.\n4. To Understand Different Memory Management Approaches.\n5. Students Should Be Able To Use System Calls For Managing Processes, Memory And File System.\n6. Students Should Understand The Data Structures And Algorithms For Implementation Of Os.\n",
  "course content": "\n1. Computer System Architecture And Organization, Introduction And Evolution Of Os, Introduction To Distributed Os, Real Time Systems And Multimedia Systems. Os Structures: Os Services, System Calls And Programs, Os Design And Implementation. Processes: Process Concept, Scheduling Policies, Algorithms, Multilevel Queuing, Operations On Process, Inter-Process Communication. Threads: Multithreading Models And Threading Issues. Cpu Scheduling: Criteria And Algorithms, Multiprocessor And Thread Scheduling.\n2. Process Synchronization: Critical Sections, Classical Two Process And N-Process Solutions, Hardware Primitives For Synchronization, Semaphores, Monitors, Classical Problems In Synchronization\n(Producer-Consumer, Readers-Writer, Dining Philosophers, Etc.). Deadlocks: Modeling, Resource Allocation, Characterization, Prevention And Avoidance, Detection And Recovery.\n3. Memory Management: Swapping, Contiguous Memory Allocation, Paging, Multilevel Paging, Segmentation, Demand Paging, Page Replacement Algorithms, Allocation Of Frames, Thrashing, Working Set Model. Input/Output: I/O System And Services, Device Controllers And Device Drivers, Disks, Scheduling Algorithms And Management.\n4. File System Interface: Access Methods, Access Control, Directory Structures, File Organization, File Sharing And Protection. System Performance, Protection And Security, Access Matrix, Security Breaches, Types Of Attacks, Attack Prevention Methods, Security Policy And Access Control, Os Design\n\n\n8 Considerations For Security, Access, Policy And Access Control, Os Design Considerations For Security, Access Control Lists And Os Support, Internet And General Network Security.\n\n",
  "course outcomes": "",
  "credits": "5",
  "books": "\n1. A. Silberschatz, Peter B. Galvin And G. Gagne, \"Operating System Concepts,\" (6 Or Newer Edition), Wiley.\n2. H. Brinch, \"Operating System Principles,\" Prentice Hall Of India.\n3. Dhamdhere, \"Systems Programming & Operating Systems,\" Tatamcgraw Hill.\n4. A. N. Habermann, \"Introduction To Operating System Design,\" Galgotia Publication, New Delhi.\n5. A.S. Tanenbaum, \"Modern Operating Systems,\" Prentice Hall Of India.\n"
}
{
  "course code": "Cspc22",
  "course title": "Microprocessor And Interfacing",
  "prerequisites": "Cspc10, Cspc29",
  "course type": "Pc",
  "course learning objectives": "\n1. To Provide An Introduction To The Basic Principles And Applications Of Microprocessor To Solve Real Life Problems.\n2. To Give An Expose Of Assembly Language Programming.\n3. To Make Familiar With The Implementation Of Various Interfaces With Microprocessor.\n",
  "course content": "",
  "course outcomes": "\n1. Understand Functions, Structures And History Of Operating Systems.\n2. Able To Know The Design Issues Associated With Operating Systems.\n3. Master Various Process Management Concepts Such As Scheduling, Synchronization, Multithreading And Deadlocks.\n4. Understand The Various Concepts Associated With Memory Management Such As Virtual Memory, Demand Paging, Page Replacements Algorithms.\n5. Be Familiar With Various Protection And Security Mechanisms.\n\n\n---",
  "credits": "4",
  "books": ""
}
{
  "course code": "Cspc24",
  "course title": "Unix And Linux Programming",
  "prerequisites": "",
  "course type": "Pc",
  "course learning objectives": "",
  "course content": "\n1. Introduction & Architecture History Of Microprocessors, 8086 Architecture, Internal Operation, Machine Language Instructions, Instruction Execution Time (Timing Diagram: Fetch Cycle, Execution Cycle).\n2. Assembly Language Programming Instruction Format, Instruction Types (Data Transfer Instruction, Arithmetic Instructions, Branch Instruction, Nop & Hlt Instructions, Flag Manipulation Instruction, Logical Instruction, Shift And Rotate Instruction, String Instructions), Assembler Directions And Operators.\n3. Memory Interfacing And Modular Programming Memory Interfacing (Static Rams & Roms), Stacks, Procedures, Macros  Local Labels And Nested Macros.\n4. I/O Interface And I/O Programming I/O Consideration, Programmed I/O Block Transfer, Serial Communication, Asynchronous, Synchronous, Physical, 8251A; Parallel Communication: 8255 A, 16-Bit Bus Interface, Basic Interrupt Processing, Interrupt And Interrupt Routines, 8259A Programmable Interrupt Controller, Dma With Controller (8237), 8254 Programmable Interval Timer (8253/8254), Interfacing To A/D And D/A Converters, Stepper Motor Interfacing.\n",
  "course outcomes": "\n1. Develop An Understanding Of Basic Concepts Of Microprocessors.\n2. Understand The Instruction Set Of 8086.\n3. Able To Apply The Knowledge Of Assembly Language To Solve Various Problems.\n4. Grasp An Understanding Of Various Peripheral Device Interfaces With 8086.\n5. Able To Design And Implement Various Interfaces In Real Life Different Applications.\n\n\n---",
  "credits": "3",
  "books": "\n1. Liu And Gibson, Microcomputer Systems: 8086/8088 Family: Architecture, Programming And Design, Phi.\n2. D.V. Hall, Microprocessors And Interfacing, Tmh.\n8\n3. A. K. Ray & K.M. Bhurchandi, Advanced Microprocessors And Peripherals: Architecture, Programming And Interfacing, Tmh.\n4. Bray, The Intel Microprocessor 8086/8088-Pentium: Architecture, Programming And Interfacing , Phi\n5. James L. Antonakos, The Intel Microprocessor Family H/W And S/W Principles And Applications, Cengage Learning\n"
}
{
  "course code": "",
  "course title": "",
  "prerequisites": "",
  "course type": "",
  "course learning objectives": "",
  "course content": "\n1. Linux Startup And Shell Programming User Accounts, Accessing Linux- Starting And Shutting Process, Logging In And Logging Out, Command Line, Simple Command, Unix File System: Linux/Unix Files, Inodes And Structure And File System Related Commands, Shell As Command Processor, Shell Variables, Creating Command Substitution, Scripts, Functions, Conditionals, Loops, Customizing\n2. Regular Expressions And Filters Introducing Regular Expressions Patterns, Syntax, Character Classes, Quantifiers, Introduction To Egrep, Sed, Programming With Awk And Perl\n3. The C/C++ Environment The C Compiler, Vi Editor, Compiler Options, Managing Projects, Memory Management, Use Of Makefiles, Dependency Calculations, Memory Management- Dynamic And Static Memory, Building And Using Static And Dynamic Libraries, Using Ldd, Soname, Dynamic Loader, Debugging With Gdb, Introduction To Pythan Programming\n4. Processes In Linux Processes, Starting And Stopping Processes, Initialization Processes, Rc And Init Files, Job Control- At, Batch, Cron, Time, Network Files, Security, Privileges, Authentication, Password Administration, Archiving, Signals And Signal Handlers, Linux I/O System.\n",
  "course outcomes": "",
  "credits": "0",
  "books": "\n1. Sumitabha Das: Your Unix- The Ultimate Guide, Tmh, 2012\n2. Behrouz A. Forouzan, Richard F. Gilberg: Unix And Shell Programming, Brooks/Cole-Thomson Learning (Cengage Learning, India) , 2009\n4. Neil Matthew, Richard Stones: Beginning Linux Programming, Wrox-Shroff, 2007\n5. Welsh & Kaufmann: Running Linux, Oreiley & Associates, 2000\n6. Guido Van Rossum: An Introduction To Python, Network Theory Ltd, 2011\n7. The Python Tutorial Online Book (Http://Docs.Python.Org/3/Tutorial/Index.Html)\n\n"
}
{
  "course code": "Cspc26",
  "course title": "Computer Networks",
  "prerequisites": "",
  "course type": "Pc",
  "course learning objectives": "\n1. Understand Computer Network Basic, Different Models Used For Study Of Computer Networks, Ability To Identify Different Designs, Understanding Of The Issues Surrounding Wired And Wireless Networks.\n2. Design, Calculate, And Apply Subnet Masks To Fulfill Networking Requirements And Building The Skills Of Routing Mechanisms.\n3. Analyse The Features And Operations Of Various Application Layer Protocols Such As Http, Dns, Smtp And Ftp.\n4. Analyse The Requirements For A Given Organizational Structure And Select The Most Appropriate Networking Architecture And Technologies\n5. Familiarity With The Basic Protocols Of Computer Networks, And How They Can Be Used To Assist In Network Design And Implementation.\n",
  "course content": "",
  "course outcomes": "\n\n8\n1. Able To Understand The Unix/Linux Operating System, Installation Procedures, Basic Utilities Command, And Basics Of Shell Programming.\n2. Ability To Handle The Files Or Records Through Various Unix/Linux Tools By Using Regular Expression.\n3. Able To Learn C/C++ Environment, Makefile, Libraries, Linking, Debugging Methodologies And Apply The Advantages Of Pythan Programming.\n4. Able To Manipulate The Processes And Manage The Networks Securely In Linux.\n\n---",
  "credits": "5",
  "books": ""
}
{
  "course code": "Cspe20",
  "course title": "Advanced Java Programming",
  "prerequisites": "Csir11, Cspc23",
  "course type": "Pe",
  "course learning objectives": "",
  "course content": "\n1. Introduction Network Functions, Network Topology, Network Services, Switching Approaches, Transmission Media And Systems, Multiplexing And Signaling Techniques, Error Detection And Correction, Internet Checksum Algorithm.\n2. Layered Architectures Examples, Osi Reference Model, Overview Of Tcp/Ip Architecture, Socket System Calls, Snmp, Electronic Mail.\n3. Peer-To-Peer Protocols Protocols, Service Models And End-To-End Requirements, Arq, Sliding Window Protocols, Rtp, Hdlc, Ppp Protocols, Statistical Multiplexing.\n4. Mac And Lan Protocols Multiple Access Communication, Random Access-Aloha, Slotted-Aloha, Csma, Csma-Cd, Lan Standards  Ethernet, Fast Ethernet & Gigabit Ethernet, Bluetooth And Wimax Standards.\n5. Packet Switching Networks Packet Network Topology, Datagrams And Virtual Circuits  Structure Of Switch / Router, Connectionless And Virtual Circuit Packet Switching, Traffic Management And Qos  Fifo, Priority Queues, Fair Queuing, Mpls.\n6. Tcp/Ip Architecture, Internet Protocols  Ip Packet, Addressing, Subnet Addressing, Ip Routing, Cidr, Arp, Rarp, Icmp, Reassembly, Ipv6, Udp, Transmission Control Protocol  Tcp, Dhcp, Mobile Ipv6, Internet Routing Protocols, Multicast Routing.\n",
  "course outcomes": "\n1. Understand Computer Network Basic, Different Models Used For Study Of Computer Networks, Ability To Identify Different Designs, Understanding Of The Issues Surrounding Wired And Wireless Networks.\n2. Design, Calculate, And Apply Subnet Masks To Fulfil Networking Requirements And Building The Skills Of Routing Mechanisms.\n3. Analyse The Features And Operations Of Various Application Layer Protocols Such As Http, Dns, Smtp And Ftp.\n4. Analyse The Requirements For A Given Organizational Structure And Select The Most Appropriate Networking Architecture And Technologies\n5. Familiarity With The Basic Protocols Of Computer Networks, And How They Can Be Used To Assist In Network Design And Implementation.\n\n\nProgramme Electives  I And Ii\n\n---",
  "credits": "4",
  "books": "\n1. Leon Garcia And Indrawidjaja: Communication Networks  Fundamental Concepts And Key Architectures, Tmh, 2000.\n2. A.S. Tanenbaum: Computer Networks, Fourth Edition, Pearson Education, 2003.\n3. Forouzan: Data Communications And Networks, Fourth Edition, Mcgraw Hill, 2007.\n4. William Stallings: Data And Computer Communications 5/E, Phi.\n\n8"
}
{
  "course code": "Cspe22",
  "course title": "Programming Using Python",
  "prerequisites": "",
  "course type": "",
  "course learning objectives": "\n1. How To Interact With A Relational Database Using Java Programming Language.\n2. How To Write Generic Java Programs.\n3. Writing Server Side Programs Using Java Technology.\n",
  "course content": "\n1. Jdbc Architecture, A Relational Database Overview, Processing Sql Statements With Jdbc Establishing A Connection, Connecting With Datasource Objects, Handling Sqlexceptions, Retrieving And Modifying Values From Result Sets, Using Prepared Statements, Using Transactions, Using Rowset Objects\n2. Generics & Collection Framework Apis. Introduction To Design Patterns: The Factory Design Pattern, The Singleton Design Pattern..\n3. Why Use Servlets & Jsps: An Introduction To Web Servers & Clients, Html, Http Protocol, Http Get And Post Requests, Http Responses. Web App Architecture: High-Level Overview. A Model- View-Controller (Mvc) Overview And Example, Life Cycle Of A Servlet, Request & Response Objects, Init Parameters And Servletconfig, Jsp Init Parameters, Context Init Parameters, Attributes And Listeners, Session Management.\n4. Create A Simple Jsp Using Out And A Page Directive, Jsp Expressions, Variables, And Declarations, Implicit Objects, The Lifecycle And Initialization Of A Jsp, Other Directives. Scriptless Jsp: Standard Actions, Expression Language, The El Implicit Objects & El Functions, Using Jstl.\n",
  "course outcomes": "\n1. Able To Interact With A Database Using Java-Programming Language.\n2. Able To Write Generic Programs With The Usage Of Collection Framework Apis\n3. Able To Design A Web Application Using Various J2Ee Constructs Such As Servlets And Jsps.\n\n\n---",
  "credits": "0",
  "books": "\n1. Dietel & Deitel, Java How To Program, Pearson Education, 10 Ed., 2015.\n2. Bryan Basham, Kathy Sierra, Bert Bates, Head First Servlets & Jsps , Oreilly, 2 Ed., 2008.\n3. Eric Freeman , Elisabeth Freeman, Kathy Sierra And Bert Bates, Head First Design Patterns, Oreilly, 1 Ed., 2004.\n"
}
{
  "course code": "Cspe24",
  "course title": "Number Theory And Cryptography",
  "prerequisites": "Cspc12, Cspc23",
  "course type": "Pe",
  "course learning objectives": "\n1. Building Robust Applications Using Python Programming Languages Features.\n2. Understanding The Usage Of Python Libraries.\n3. Building Multithreaded, Platform-Independent And Gui Based Python Applications For Business Problems.\n",
  "course content": "\n1. The Concept Of Data Types; Variables, Assignments; Immutable Variables; Numerical Types; Arithmetic Operators And Expressions; Comments In The Program; Understanding Error Messages; Conditions, Boolean Logic, Logical Operators; Ranges; Control Statements: If-Else, Loops (For, While); Short-Circuit\n(Lazy) Evaluation; Strings And Text Files; Manipulating Files And Directories, Os And Sys Modules; Text Files: Reading/Writing Text And Numbers From/To A File; Creating And Reading A Formatted File (Csv Or Tab- Separated); String Manipulations: Subscript Operator, Indexing, Slicing A String.\n2. Lists, Tuples, And Dictionaries; Basic List Operators, Replacing, Inserting, Removing An Element; Searching And Sorting Lists; Dictionary Literals, Adding And Removing Keys, Accessing And Replacing Values; Traversing Dictionaries; Design With Functions: Hiding Redundancy, Complexity; Arguments And Return Values; Formal Vs Actual Arguments, Named Arguments.\n3. Simple Graphics And Image Processing: Turtle Module; Simple 2D Drawing - Colors, Shapes; Digital Images, Image File Formats, Image Processing: Simple Image Manipulations With 'Image' Module\n(Convert To Bw, Greyscale, Blur, Etc). Classes And Oop: Classes, Objects, Attributes And Methods; Defining Classes; Design With Classes, Data Modeling; Persistent Storage Of Objects; Inheritance, Polymorphism, Operator Overloading (_Eq_, _Str_, Etc); Abstract Classes; Exception Handling, Try Block\n4. Graphical User Interfaces; Event-Driven Programming Paradigm; Tkinter Module, Creating Simple Gui; Buttons, Labels, Entry Fields, Dialogs; Widget Attributes - Sizes, Fonts, Colors Layouts, Nested Frames.\n",
  "course outcomes": "\n1. Write Python Programs That Solve Simple Business Problems.\n2. Create Python Applications That Are Robust And Multithreaded.\n3. Write Simple Gui Interfaces For A Program To Interact With Users, And To Understand The Event-Based Gui Handling Principles In Python.\n\n\n---",
  "credits": "4",
  "books": "\n1. T.R. Padmanabhan, Programming With Python, Springer, 1 Ed., 2016.\n2. Kenneth Lambert, Fundamentals Of Python: First Programs, Cengage Learning,, 1 Ed., 2012.\n"
}
{
  "course code": "Cspe60",
  "course title": "",
  "prerequisites": "",
  "course type": "Pe",
  "course learning objectives": "\n1. To Understand Mathematical Foundations Of Cryptography Theory.\n2. To Analyze The Robustness Of Cryptosystems.\n3. To Design Robust Cryptosystem For Real Time Applications.\n4. To Develop Prototype Cryptosystems And Demonstrate Their Performance.\n",
  "course content": "\n1. Elementary Number Theory: Divisibility, Division Algorithm, Euclidean Algorithm; Congruences, Complete Residue Systems, Reduced Residue Systems; Fermat'S Little Theorem, Euler'S Generalization, Wilson'S Theorem; Chinese Remainder Theorem, Generalized Chinese Remainder\n\n8 Theorem-Euler Phi-Function, Multiplicative Property; Finite Fields, Primitive Roots; Quadratic Residues, Legendre Symbol, Jacobi Symbol; Gauss'S Lemma, Quadratic Reciprocity Law.\n2. Primality Testing And Factorization: Primality Tests; Pseudoprimes, Carmichael Numbers; Fermats Pseudoprimes, Euler Pseudoprimes; Factorization By Pollards Rho Method; Simple Continued Fraction, Simple Infinite Continued Fractions; Approximation To Irrational Numbers Using Continued Fractions; Continued Fraction Method For Factorization.\n3. Private Key Cryptosystems: Classical Methods: Caesar Cipher, Vigenere Cipher, One-Time Pad And Others; Block Ciphers, Fiestel Structure, Des, Aes And Its Security Properties; Linear Cryptanalysis, Differential Cryptanalysis; Hash Functions: Md5, Sha-1 And Its Properties\n4. Public Key Cryptosystems: Traditional Cryptosystem, Limitations; Public Key Cryptography; Diffie- Hellmann Key Exchange; Discrete Logarithm Problem; One-Way Functions, Trapdoor Functions; Rsa Cryptosystem; Digital Signature Schemes; Digital Signature Standards; Rsa Signature Schemes; Knapsack Problem; Elgamal Public Key Cryptosystem; Attacks On Rsa Cryptosystem: Common Modulus Attack; Homomorphism Attack, Timing Attack; Forging Of Digital Signatures; Elliptic Curve Cryptography: Cubic Curves, Singular Points, Discriminant; Introduction To Elliptic Curves, Geometry Of Elliptic Curves Over Reals; Point At Infinity; Addition Of Two Points; Elliptic Curves Over Finite Fields, Elgamal Public Key Cryptosystem For Elliptic Curves.\n",
  "course outcomes": "\n1. To Understand Mathematical Foundations Of Cryptography Theory.\n2. To Analyze The Robustness Of Cryptosystems.\n3. To Design Robust Cryptosystem For Real Time Applications.\n4. To Develop Prototype Cryptosystems And Demonstrate Their Performance.\n\n\n---",
  "credits": "4",
  "books": "\n1. A Course In Number Theory And Cryptography, Neal Koblitz, (Springer 2006)\n2. An Introduction To Mathematical Cryptography, Jill Pipher, Jeffrey Hoffstein, Joseph H. Silverman\n(Springer, 2008)\n3. An Introduction To Theory Of Numbers, Niven, Zuckerman And Montgomery, (Wiley 2006)\n4. Elliptic Curves: Number Theory And Cryptography, Lawrence C. Washington, (Chapman & Hall/Crc 2003)\n5. An Introduction To Cryptography, R.A. Mollin (Chapman & Hall, 2001)\n6. Rational Points On Elliptic Curves, Silverman And Tate (Springer 2005)\n7. Guide To Elliptic Curve Cryptography Hankerson, Menezes, Vanstone (Springer, 2004)\n8. Elementary Number Theory, Jones And Jones (Springer, 1998).\n"
}
{
  "course code": "",
  "course title": "Stochastic Processes And Queuing Theory",
  "prerequisites": "Mair13",
  "course type": "Pe",
  "course learning objectives": "\n1. It Provides An Essential Base For Mathematical Modeling Which Is Normally Used To Solve The Problems Of Pattern Recognition And Machine Learning.\n2. It Is Used In The Research Of Various Science And Engineering Problem.\n",
  "course content": "\n1. Random Variables, Functions Of Random Variables, Joint1Y Distributed Random Variables. Expectation, Expectation Of Functions Of More Than One Random Variable, Covariance And Correlation, Auto And Cross Correlation, Correlation Co-Efficient, Parameter Estimation  Maximum Likelihood Estimation And Maximum A Posteriori.\n2. Stochastic Processes, Classification Of Stochastic Processes, Stationary Random Processes- First Order, Second Order And Nth Order, Strict Sense Stationary Process, Ergodic Process, The Bernoulli\n\n\n8 Process, The Poisson Process, Renewal Process, Advanced Renewal Theory, Renewal Function, Alternating Renewal Processes .\n3. Markov Chains, Computation Of N-Step Transition Probabilities, Chapman-Kolmogorov Theorem, Classification Of States Of A Markov Chain, Distribution Of Times Between State Changes, Irreducible Finite Chains With Aperiodic States, Birth And Death Processes, Pure Birth Process, Pure Death Process, Non-Birth-Death Processes, Analysis Of Program Execution Time..\n4. Introduction To Queuing Theory, General Queuing, Components Of A Queuing System, Deterministic Queues, (M/M/1):(/Fifo)-Single Server With Infinite Capacity, Extension To (M/M/2): (/Fifo),\n(M/M/K) : (/Fifo)- Multiple Server With Infinite Capacity, Engset Loss Formula, M/G/1 Queuing System, M/G/1 With Non-Fifo Disciplines, M/G/, Queues With Time-Varying Arrival Rate.",
  "course outcomes": "\n1. Develop An Understanding To The Basic Concepts Of Random Processes, Expectations And Parameter Estimation.\n2. Able To Understand And Apply The Stochastic Processes To Science And Engineering Problems And Applications.\n3. Able To Calculate The N-Step Transition Probabilities For Any Markov Chain And Understand About The Birth And Death Of Processes.\n4. Able To Apply Markov Chain & Birth Death Process To Real Life Problems.\n5. Develop An Understanding Of Various Queuing Systems.\n\n\n---",
  "credits": "4",
  "books": "\n1. A. Populis And S.U. Pillai, Probability, Random Variables, And Stochastic Process, 4 Edition, Mcgraw-Hill.\n2. S. Palaniammal, Probability And Queueing Theory. Prentice Hall Of India.\n3. V. Sundarapandian, Probability, Statistics And Queueing Theory. Prentice Hall Of India.\n"
}
{
  "course code": "Cspe62",
  "course title": "Software Project Management",
  "prerequisites": "Cspc27",
  "course type": "Pe",
  "course learning objectives": "\nUnderstand The Different Activities In Software Project Development I.E, Planning, Design And Management.\n",
  "course content": "\n1. Conventional Software Management. Evolution Of Software Economics. Improving Software Economics: Reducing Product Size, Software Processes, Team Effectiveness, Automation Through Software Environments. Principles Of Modern Software Management.\n2. Software Management Process Framework,: Life Cycle Phases- Inception, Elaboration, Construction And Training Phase. Artifacts Of The Process- The Artifact Sets, Management Artifacts, Engineering Artifacts, Pragmatics Artifacts. Model Based Software Architectures. Workflows Of The Process. Checkpoints Of The Process.\n3. Software Management Disciplines Iterative Process Planning. Project Organisations And Responsibilities. Process Automation. Project Control And Process Instrumentation- Core Metrics, Management Indicators, Life Cycle Expections. Process Discriminants.\n",
  "course outcomes": "",
  "credits": "4",
  "books": ""
}
{
  "course code": "Cspe64",
  "course title": "Data Mining And Data Warehousing",
  "prerequisites": "Cspc25",
  "course type": "Pe",
  "course learning objectives": "",
  "course content": "",
  "course outcomes": "\n1. Understanding The Evolution And Improvement Of Software Economics According To The Basic Parameters And Transition To The Modern Software Management.\n2. Learning The Objectives, Activities And Evaluation Criteria Of The Various Phases Of The Life Cycle Of Software Management Process.\n3. Gaining Knowledge About The Various Artifacts, Workflows And Checkpoints Of The Software Management Process And Exploring The Design Concept Using Model Based Architecture From Technical And Management Perspective.\n4. Develop An Understanding Of Project Planning, Organization, Responsibilities, Automation And Control Of The Processes To Achieve The Desirable Results.\n\n---",
  "credits": "4",
  "books": "\n1. Software Project Management, Walker Royce, Addison Wesley, 1998.\n2. Project Management 2/E ,Maylor.\n3. Managing The Software Process, Humphrey.\n4. Managing Global Software Projects, Ramesh, Tmh,2001.\n\n8"
}
{
  "course code": "Cspc31",
  "course title": "Advanced Data Structures And Algorithms",
  "prerequisites": "Cspc11",
  "course type": "Pc",
  "course learning objectives": "\n1. Develop An Understanding On The Basic Concepts, Principles And Applications Of Data Mining And Warehousing, Also Able To Identify The Scope And Necessity Of System.\n2. Describe The Theoretical Constructs And Core Processes Of Data Mining And Warehousing, Also Demonstrate The Importance Of Paradigms From The Fields Of Artificial Intelligence And Machine Learning To Data Mining.\n3. To Understand The Strengths And Limitations Of Various Data Mining And Warehousing Models And Techniques In Solving The Real World Problems.\n4. Able To Design And Analyse, A Lightweight Prototype Or Simulation That Supports The Concept Of Data Mining And Warehousing.\n5. Comprehend Contemporary Issues Related To Research Domain, Industry And Government, Also Able To Inculcate Professional, Ethical Issues And Social Responsibilities.\n\n",
  "course content": "\n1. Introduction : Fundamentals Of Data Mining, Data Mining Functionalities, Classification Of Data Mining Systems, Major Issues In Data Mining, Data Warehouse And Olap Technology For Data Mining Data Warehouse, Multidimensional Data Model, Data Warehouse Architecture, Data Warehouse Implementation,Further Development Of Data Cube Technology, From Data Warehousing To Data Mining, Data Preprocessing : Needs Preprocessing The Data, Data Cleaning, Data Integration And Transformation, Data Reduction, Discretization And Concept Hierarchy Generation.\n2. Data Mining Primitives, Languages, And System Architectures : Data Mining Primitives, Data Mining Query Languages, Designing Graphical User Interfaces Based On A Data Mining Query Language Architectures Of Data Mining Systems, Concepts Description : Characterization And Comparison : Data Generalization And Summarization-Based Characterization, Analytical Characterization: Analysis Of Attribute Relevance, Mining Class Comparisons: Discriminating Between Different Classes, Mining Descriptive Statistical Measures In Large Databases.\n3. Mining Association Rules In Large Databases : Association Rule Mining, Mining Single-Dimensional Boolean Association Rules From Transactional Databases, Mining Multilevel Association Rules From Transaction Databases, Mining Multidimensional Association Rules From Relational Databases And Data Warehouses, From Association Mining To Correlation Analysis, Constraint-Based Association Mining. Classification And Prediction : Issues Regarding Classification And Prediction, Classification By Decision Tree Induction, Bayesian Classification, Classification By Backpropagation, Classification Based On Concepts From Association Rule Mining, Other Classification Methods, Prediction, Classifier Accuracy.\n4. Cluster Analysis Introduction : Types Of Data In Cluster Analysis, A Categorization Of Major Clustering Methods, Partitioning Methods, Density-Based Methods, Grid-Based Methods, Model-Based Clustering Methods, Outlier Analysis. Mining Complex Types Of Data : Multimensional Analysis And Descriptive Mining Of Complex, Data Objects, Mining Spatial Databases, Mining Multimedia\n\n8 Databases, Mining Time-Series And Sequence Data, Mining Text Databases, Mining The World Wide Web.\n\nText Book :\n1. Data Mining  Concepts And Techniques - Jiawei Han & Micheline Kamber Harcourt India.\n\nReferences :\n1. Data Mining Introductory And Advanced Topics Margaret H Dunham, Pearson Education\n2. Data Mining Techniques  Arun K Pujari, University Press.\n3. Data Warehousing In The Real World  Sam Anahory & Dennis Murray. Pearson Edn Asia.\n4. Data Warehousing Fundamentals  Paulraj Ponnaiah Wiley Student Edition.\n5. The Data Warehouse Life Cycle Tool Kit  Ralph Kimball Wiley Student Edition.\n",
  "course outcomes": "\n1. Develop An Understanding On The Basic Concepts, Principles And Applications Of Data Mining And Warehousing, Also Able To Identify The Scope And Necessity Of System.\n2. Describe The Theoretical Constructs And Core Processes Of Data Mining And Warehousing, Also Demonstrate The Importance Of Paradigms From The Fields Of Artificial Intelligence And Machine Learning To Data Mining.\n3. To Understand The Strengths And Limitations Of Various Data Mining And Warehousing Models And Techniques In Solving The Real World Problems.\n4. Able To Design And Analyse, A Lightweight Prototype Or Simulation That Supports The Concept Of Data Mining And Warehousing.\n5. Comprehend Contemporary Issues Related To Research Domain, Industry And Government, Also Able To Inculcate Professional, Ethical Issues And Social Responsibilities.\n\n\n---",
  "credits": "4",
  "books": ""
}
{
  "course code": "Cspc33",
  "course title": "Soft Computing",
  "prerequisites": "",
  "course type": "",
  "course learning objectives": "\n1. To Develop The Understanding Of Advanced Data Structures.\n2. To Develop The Understanding Of Algorithmic Design Paradigms.\n",
  "course content": "\n1. Advanced Data Structures Threaded Binary Trees, Binomial Heaps, Fibonacci Heaps, Data Structures For Disjoint Sets, Balanced Trees- Avl, Red-Black Trees\n2. String Matching String-Matching Algorithm, Rabin-Karp Algorithm, String Matching With Automata, Knuth-Morris-Pratt Algorithm.\n3. Np  Hard & Np  Complete Problems Concepts Of Np-Hard & Np Complete Problems, Clique Decision Problem, Node Cover Decision Problem, Travelling Salesperson Decision Problem.\n4. Advanced Algorithms Introduction To Approximation Algorithms, Absolute Approximation, -Approximation, Polynomial Time Approximations, Randomized Algorithms.\n",
  "course outcomes": "",
  "credits": "4",
  "books": "\n1. E Horowitz And S. Sahni, Fundamentals Of Data Structures, Universities Press.\n2. Cormen, Leiserson And Rivest, Introduction To Algorithms, 3/E, Phi.\n3. Horowitz, Ellis And Sahni, Fundamentals Of Computer Algorithms, Universities Press..\n\n8\n1. Oded Goldreich. P, Np, And Np-Completeness: The Basics Of Computational Complexity, Cambridge University Press, 2010.\n2. Anne Benoit, Yves Robert, Frdric Vivien. A Guide To Algorithm Design: Paradigms, Methods, And Complexity Analysis, Taylor & Francis, 2013.\n3. A.V. Aho, J.E. Hopcroft, And J.D. Ullman, Data Structures And Algorithms, Addison Wesley, Reading Massachusetts, Usa, 1983.\n4. Donald Knuth. The Art Of Computer Programming: Fundamental Algorithms, Third Edition. Addison- Wesley, 1997.\n5. Donald Knuth. The Art Of Computer Programming Volume 3: Sorting And Searching, Third Edition. Addison-Wesley, 1997. Isbn 0-201-89685-0.\n\nCourse Outcome:\n1. Compare, Contrast, And Apply The Key Algorithmic Design Paradigms: Brute Force, Divide And Conquer, Decrease And Conquer, Transform And Conquer, Greedy, Dynamic.\n2. Compare, Contrast, And Apply Key Data Structures: Trees, Lists, Stacks, Queues, Hash Tables, And Graph Representations.\n3. Compare, Contrast, And Apply Algorithmic Tradeoffs: Time Vs. Space, Deterministic Vs. Randomized, And Exact Vs. Approximate.\n4. Implement, Empirically Compare, And Apply Fundamental Algorithms And Data Structures To Real-World Problems.\n\n\n---"
}
{
  "course code": "Cspc35 Course Title               :    Software Development Using Uml And Agile Methodology Number Of Credits          :    4 Prerequisites              :    Cspc23 Course Type                :    Pc",
  "course title": "Cspc35 Course Title               :    Software Development Using Uml And Agile Methodology Number Of Credits          :    4 Prerequisites              :    Cspc23 Course Type                :    Pc",
  "prerequisites": "Cspc35 Course Title               :    Software Development Using Uml And Agile Methodology Number Of Credits          :    4 Prerequisites              :    Cspc23 Course Type                :    Pc",
  "course type": "Cspc35 Course Title               :    Software Development Using Uml And Agile Methodology Number Of Credits          :    4 Prerequisites              :    Cspc23 Course Type                :    Pc",
  "course learning objectives": "\n1. Motivation And Historical Background Of Soft Computing.\n2. Application Of Fuzzy Logic.\n3. Biologically Inspired Algorithm Such As Neural Networks, Genetic Algorithms, Ant Colony Optimization, And Bee Colony Optimization.\n4. Hybrid Systems Of Neural Network, Genetic Algorithms And Fuzzy Systems.\n\n\n",
  "course content": "\n1. Soft Computing And Artificial Intelligence: Introduction Of Soft Computing, Soft Computing Vs. Hard Computing, Various Types Of Soft Computing Techniques, Applications Of Soft Computing, Ai Search Algorithm, Predicate Calculus, Rules Of Interference, Semantic Networks, Frames, Objects, Hybrid Models.\n2. Artificial Neural Networks And Paradigms: Introduction To Neuron Model, Neural Network Architecture, Learning Rules, Perceptrons, Single Layer Perceptrons, Multilayer Perceptrons, Back Propagation Networks, Kohnen'Sself Organizing Networks, Hopfield Network, Applications Of Nn.\n3. Fuzzy Logic: Introduction, Fuzzy Sets And Fuzzy Reasoning, Basic Functions On Fuzzy Sets, Relations, Rule Based Models And Linguistic Variables, Fuzzy Controls, Fuzzy Decision Making, Applications Of Fuzzy Logic.\n4. Genetic Algorithms And Swarm Optimizations: Introduction, Genetic Algorithm, Fitness Computations, Cross Over, Mutation, Evolutionary Programming, Classifier Systems, Genetic Programming Parse Trees, Variants Of Ga, Applications, Ant Colony Optimization, Particle Swarm Optimization, Artificial Bee Colony Optimization.\n",
  "course outcomes": "\n1. Understand Various Biologically Inspired Algorithms.\n2. Apply Different Intelligent Algorithms In Classification, Prediction, Optimization, Pattern Recognition Applications.\n3. Design Hybrid System Incorporating Neural Network, Genetic Algorithms, Fuzzy Systems.\n---",
  "credits": "C",
  "books": "\n1. Simon S. Haykin, Neural Networks, Prentice Hall, 2Nd Edition.\n2. B. Yegnanrayana , Artificial Neural Networks , Phi.\n3. Jacek M. Zurada, Introduction To Artificial Neural Systems, Jaico Publishing House,1994\n4. Zimmermann, Fuzzy Set Theory And Its Application, 3 Edition.\n5. Jang J.S.R., Sun C.T. And Mizutani E, \"Neuro-Fuzzy And Soft Computing\", Prentice Hall, 1998.\n6. Timothy J. Ross, \"Fuzzy Logic With Engineering Applications\", Mcgraw Hill, 1997.\n8\n7. D.E. Goldberg, \"Genetic Algorithms: Search, Optimization And Machine Learning\", Addison Wesley, N.Y, 1989.\n"
}
{
  "course code": "Cspc37",
  "course title": "Automata Theory",
  "prerequisites": "Mair13",
  "course type": "Pc",
  "course learning objectives": "",
  "course content": "\n1. Uml & Object-Oriented Modeling [1] [3] An Overview Of Uml, Architecture, Uml Modeling Concepts  System Models & Views, Datatypes, Classes, Objects, Event & Messages, Object-Oriented Modeling; Modeling Relations- Association, Aggregation Composition, Generalization, Dependency And Structural Diagrams, Requirement Elicitation- Introduction, Concepts & Activities[3]. Object Oriented Analysis Design Using Diagrams Such As Use-Case Diagrams, Class Diagrams, Sequence Diagrams, Collaboration Diagrams, Activity Diagrams, Object Diagrams, Interaction Diagrams And Statechart Diagrams.\n2. Fundamentals Of Agile [4] The Genesis Of Agile, Introduction And Background, Agile Manifesto And Principles, Overview Of Scrum, Extreme Programming, Feature Driven Development, Lean Software Development, Agile Project Management, Design And Development Practices In Agile Projects, Test Driven Development, Continuous Integration, Refactoring, Pair Programming, Simple Design, User Stories, Agile Testing, Agile Tools\n3. Agile Scrum Framework [2] Introduction To Scrum, Project Phases, Agile Estimation, Planning Game, Product Backlog, Sprint Backlog, Iteration Planning, User Story Definition, Characteristics And Content Of User Stories, Acceptance Tests And Verifying Stories, Project Velocity, Burn Down Chart, Sprint Planning And Retrospective, Daily Scrum, Scrum Roles  Product Owner, Scrum Master, Scrum Team, Scrum Case Study, Tools For Agile Project Management\n4. Agile Software Design And Development [2] [4] Agile Design Practices, Role Of Design Principles Including Single Responsibility Principle, Open Closed Principle, Liskov Substitution Principle, Interface Segregation Principles, Dependency Inversion Principle In Agile Design, Need And Significance Of Refactoring, Refactoring Techniques, Continuous Integration, Automated Build Tools, Version Control\n",
  "course outcomes": "\n8 On Completion Of The Course The Student Will Be Able To:\n1. Understand The Concepts Of Unified Modeling Language (Uml) And Uml Diagrams During Object Oriented Analysis And Design.\n2. Software Development And Process Control Using Agile And Scrum Methodology.\n\n---",
  "credits": "4",
  "books": "\n1. Bernd Bruegge, Allen H. Dutoit, Object-Oriented Software Engineering Using Uml, Patterns And Java, Pearson, 3 Edition, 2013.\n2. Ken Schawber, Mike Beedle, Agile Software Development With Scrum, Pearson, 2001.\n3. Grady Booch, James Rumbaugh, Ivar Jacobson, Unified Modeling Language User Guide, Addison Wesley, 2 Edition, 2012.\n4. Robert C. Martin, Agile Software Development- Principles, Patterns And Practices, Prentice Hall, 2013.\n"
}
{
  "course code": "Cspe31",
  "course title": "Software Verification And Validation",
  "prerequisites": "Cspc27",
  "course type": "Pe",
  "course learning objectives": "\nThe Objective Of This Course Is To Give Students A Clear Understanding Of Concepts Formal Languages,\nGrammars And Formal Methods Of Computation.",
  "course content": "\n1. Introduction To Finite State Machine, Moore And Mealy Fsms, Equivalence, Regular Languages, Regular Expressions, The Memory Required To Recognize A Language, Distinguishing One String From Another, Unions, Intersections And Complements, Finite Automata, Nfa, Nfa With Null Transitions, Equivalence, Criterion For Regularity, Minimal Finite Automata, The Pumping Lemma, Decision Problems, Finite Automata, Non-Determinism And Kleens Theorem, Regular And Non-Regular Languages.\n2. Context  Free Grammars, Definition Of Cfg, Example Of Familiar Languages, Unions, Concatenations And Closures Of Cfls, Derivation Tree, Ambiguity, Unambiguous Cfg For Algebraic Expressions, Simplified Forms And Normal Forms, Push Down Automata, Definition, Deterministic Pda, Pda To Cfg And Vice Versa, Context Free And Non Context Free Languages, Pumping Lemma For Cfg, Intersection And Complements Of Cfl.\n3. Turing Machine Definition, Turing Machining As Language Acceptors, Combining Tm, Computing Partial Function With Tm. Recursively Enumerable And Recursive Languages, Regular Grammars, Context Sensitive Grammars, Chomsky Hierarchy. Concept Of Insolvability & Reducibility, Halting Problem, Post Correspondence Problem, Rice Theorem, P And Np. Polynomial-Time Reductions And Np-Completeness.",
  "course outcomes": "\n1. To Understand The Foundations Finite Automata (Deterministic Or Non-Deterministic), Fsm And Master Regular Languages.\n2. Be Exposed To Types Of Languages (Type-0, Type-1, Type-2, Type-3), Context-Free Languages (Type-2) And Using Pushdown Automata (Pda) As Its Acceptor.\n3. To Design The Turing Machines For Various Mathematical Function, String Function Etc\n4. To Demonstrate Concept Of Decidability, Unsolvability And Recursive.\n\nProgramme Electives  Iii And Iv\n---",
  "credits": "4",
  "books": "\n1. John C. Martin: Introduction To Languages And The Theory Of Computation, Mgh.\n2. Lewis & Papadimitriou: Elements Of The Theory Of Computation, Phi.\n3. Daniel I.A. Cohen: Introduction To Computer Theory: John Wiley.\n4. J.E. Hopcroft And J.D. Ullman: Introduction To Automata Theory Languages And Computation, Narosa.\n"
}
{
  "course code": "Cspe33",
  "course title": "Embedded System Development",
  "prerequisites": "",
  "course type": "",
  "course learning objectives": "\n\n\n8 The Objectives Of The Course Is To Prepare Students For Learning Different Techniques Of Verification And Validation Of Object Oriented And Web Based Software.\n\n",
  "course content": "\n1. Introduction To Testing & Software Verification [1] Review Of Functional And Structural Testing Techniques- Slice Based Testing And Mutation Based Testing. Verification Methods, Srs Document Verification, Sdd Document Verification, Source Code Reviews, User Document Verification, Software Project Audit\n2. Test Case Generation & Regression Testing [1] Introduction To Use Case Diagram And Use Cases, Test Case Generation From Use Cases, Validity Checking And Its Guidelines, Data Validation Strategies, Database Testing. Introduction To Regression Testing, Regression Test Cases Selection Methods And Their Management, Risk Analysis, Code Coverage Prioritization Techniques\n3. Object Oriented Testing [1] [2] Introduction To Object Orientation And Testing [1], Issues In Object Oriented Testing [2], Path Testing, State Based Testing, Class Testing, Integration Testing [2], Gui Testing [2].\n4. Testing Metrics, Models & Web Application Testing Introduction To Software Metrics, Categorization Of Metrics, Object Oriented Metrics Used In Testing, Elements To Measure During Testing, Software Quality Attributes Prediction Models. Introduction To Web Testing, Functional Testing, User Interface Testing, Usability Testing, Configuration And Compatibility Testing, Security Testing, Performance Testing, Database Testing, Post Deployment Testing, Web Metrics.\n",
  "course outcomes": "\nOn Completion Of The Course The Student Will Be Able To:\n1. Describe Techniques In The Areas Of Software Inspection, Software Testing And Software Validation.\n2. Apply Different Techniques For Verification Of The Software.\n3. Generate Test Cases For Validation Object Oriented And Web Based Software.\n\n\n---",
  "credits": "0",
  "books": "\n1. Yogesh Singh, Software Testing, Cambridge Publication, 2013.\n2. Paul C. Jorgensen, Software Testing- A Craftsmans Approach, Auerbach Publication, 3 Edition, 2012.\n"
}
{
  "course code": "",
  "course title": "",
  "prerequisites": "Cspc10, Cspc22, Cspc29",
  "course type": "Pe",
  "course learning objectives": "\n1. Present Overview Structure Of Embedded System With Pipelining.\n2. Understand The Programming Languages For Embedded System Design.\n3. Develop An Understanding Of Implementation Methodology Of Arduino And Rasberry Pi.\n",
  "course content": "\n1. Intel 8051 Micro Controller: Basic Differences Between Microprocessors And Microcontroller. Introduction To Intel 8051 Microcontroller, Architecture, Registers, Internal And External Memory. Instruction Set. On Chip Counters / Timers, Serial I/O, Interrupts And Their Use. Assembly Language Programming.\n2. Atmel And Pic Microcontrollers: Introduction To Atmel And Pic C6X Microcontrollers, Architecture, Registers, Internal And External Memory, Instruction Set, On Chip Counters / Timers, Serial I/O, Interrupts And Their Use. Pwm, Watch Dog Timer, Isp, Iap Features. Assembly Language Programming.\n\n8\n3. Arm7Tdmi (Advanced Risc Machines): Arm Architecture, Cortex-M3 Basics, Exceptions, Instruction Sets, Nvic, Interrupt Behaviour, Cortex-M3/M4 Programming, Exception Programming, Memory Protection Unit And Other Cortex-M3 Features, Stm32L15Xxx Arm Cortex M3/M4 Microcontroller Memory And Peripherals, Development & Debugging Tools.\n4. Open Source Embedded Development Board (Arduino): Overview Of Open Source Embedded Development Board (Arduino), Block Diagram, Pins Of Embedded Development Board, Features Of Open Source Tool Used For Programming A Development Board, Programming Of Embedded Development Board, Interface Serial Port With Embedded Development Board, Program Raspberry Pi: A Credit-Card Sized Computer, Python Programming For Raspberry Pi, Interacting And Configuring The Rpi Os, Porting Of Linux Kernel And Booting Rpi. Case Studies: Design Of Embedded Systems Using The Microcontroller 8051/ Amtel/ Arduino/ Raspberry Pi, For Applications In The Area Of Communications, Automotives, And Industry.\n",
  "course outcomes": "\n1. Learn The Concept Of Structure Of Embedded System.\n2. Identify The Needs Of Arduino/Rasberry Pi In Real Life Applications.\n---",
  "credits": "0",
  "books": "\n1. Raj Kumar, Embedded Systems: Architecture, Programming And Design, Tata Mcgraw Hill, Third Reprint, 2003.\n2. John Catsoulis, Oreilly, Designing Embedded Hardware, First Indian Reprint, 2003.\n3. David E. Simon, An Embedded Software Primer, Pearson Education Asia, Fifth Indian Reprint, 2002.\n4. Michael Barr, Oreilly, Programming Embedded Systems In C And C ++, 1999.\n5. J.W. Valvano, Embedded Microcomputor System: Real Time Interfacing, Brooks/Cole, 2000.\n6. Jack Ganssle, The Art Of Designing Embedded Systems, Newnes, 1999.\n7. V.K. Madisetti, Vlsi Digital Signal Processing, Ieee Press (Ny, Usa), 1995.\n8. Arduino Cookbook, By Michael Margolis, Oreilly , 2011.\n9. Raspberry Pi Assembly Language Raspbian Beginners Third Edition, Createspace Independent Publishing Platform, 19-Aug-2013.\n"
}
{
  "course code": "Cspe35",
  "course title": "Mobile Application Development",
  "prerequisites": "Csir12/Ceir12*, Csir11, Cspc23",
  "course type": "Pe",
  "course learning objectives": "\n1. Introduction And Characteristics Of Mobile Applications.\n2. Application Models Of Mobile Application Frameworks.\n3. Managing Application Data And User-Interface Design For Mobile Applications.\n4. Integrating With Cloud Services.\n5. Integrating Networking, The Os And Hardware Into Mobile-Applications.\n6. Addressing Enterprise Requirements In Mobile Applications  Performance, Scalability, Modifiability, Availability And Security.\n7. Testing Methodologies For Mobile Applications Publishing, Deployment, Maintenance And Management.\n",
  "course content": "\n1. Introduction To Mobile Devices: Introduction To Mobile Computing, Introduction To Android Development Environment, Mobile Devices Vs. Desktop Devices, Arm And Intel Architectures, Power Management, Screen Resolution, Touch Interfaces, Application Deployment, App Store, Google Play, Windows Store, Development Environments: Xcode, Eclipse, Vs2012, Phonegap, Etc.; Native Vs. Web Applications. Factors In Developing Mobile Applications: Mobile Software Engineering, Frameworks And Tools, Generic Ui Development, Android User; Graphics And Multimedia: Performance And Multithreading, Graphics And Ui Performance, Android Graphics, Mobile Agents And Peer-To-Peer Architecture, Android Multimedia.\n8\n2. Mobile Os Architectures: Comparing And Contrasting Architectures Of All Three  Android, Ios And Windows, Underlying Os, Kernel Structure And Native Level Programming. Approaches To Power Management, Security. Android/Ios/Win 8 Survival And Basic Apps: Building A Simple Hello World App In All Three Applications, App-Structure, Built-In Controls, File Access, Basic Graphics. Platforms And Additional Issues: Development Process, Architecture, Design, Technology Selection, Mobile App Development Hurdles, Testing.\n3. Android/Ios/Win8 Apps: Db Access, Network Access, Contacts/Photos/Etc. Underneath The Frameworks: Native Level Programming On Android, Low-Level Programming On (Jailbroken) Ios, Windows Low Level Apis. Intents And Services: Android Intents And Services, Characteristics Of Mobile Applications, Successful Mobile Development; Storing And Retrieving Data: Synchronization And Replication Of Mobile Data, Getting The Model Right, Android Storing And Retrieving Data, Working With A Content Provider; Putting It All Together: Packaging And Deploying, Performance Best Practices, Android Field Service App.\n4. Advanced Topics: Power Management: Wake Locks And Assertions, Low-Level Os Support, Writing Power-Smart Applications. Augmented Reality Via Gps And Other Sensors: Gps, Accelerometer, Camera. Mobile Device Security, In Depth: Mobile Malware, Device Protections, Ios Jailbreaking, Android Rooting And Windows Defenestration; Security And Hacking: Active Transactions, More On Security, Hacking Android.\n",
  "course outcomes": "",
  "credits": "4",
  "books": ""
}
{
  "course code": "Cspe37",
  "course title": "Complex Networks",
  "prerequisites": "Cspc26",
  "course type": "Pe1",
  "course learning objectives": "",
  "course content": "",
  "course outcomes": "\n1. Understand Technology And Business Trends Impacting Mobile Applications\n2. Be Competent With The Characterization And Architecture Of Mobile Applications.\n3. Understand Enterprise Scale Requirements Of Mobile Applications.\n4. Design And Develop Mobile Applications Using One Application Development Framework.\n\n\n---",
  "credits": "4",
  "books": "\n1. Bill Phillips, Chris Stewart, Brian Hardy, And Kristin Marsicano, Android Programming: The Big Nerd Ranch Guide, Big Nerd Ranch Llc, 2Nd Edition, 2015.\n2. Valentino Lee, Heather Schneider, And Robbie Schell, Mobile Applications: Architecture, Design And Development, Prentice Hall, 2004.\n3. Tomasz Nurkiewicz And Ben Christensen, Reactive Programming With Rxjava, Oreilly Media, 2016.\n4. Brian Fling, Mobile Design And Development, Oreilly Media, Inc., 2009.\n5. Maximiliano Firtman, Programming The Mobile Web, Oreilly Media, Inc., 2Nd Ed., 2013.\n6. Cristian Crumlish And Erin Malone, Designing Social Interfaces, 2Nd Ed., Oreilly Media, Inc., 2014.\n7. Suzanne Ginsburg, Designing The Iphone User Experience: A User-Centered Approach To Sketching And Prototyping Iphone Apps, Addison-Wesley Professional, 2010.\n"
}
{
  "course code": "Cspe71",
  "course title": "Advance Database Systems",
  "prerequisites": "Cspc25",
  "course type": "Pe",
  "course learning objectives": "\n1. Conceptual Introduction To The Modern Theory And Applications Of Complex Networks.\n2. To Develop The Mathematical Sophistication Needed To Understand And Apply Properties And Methodologies To Real Life Complex Networks\n",
  "course content": "\n1. Ad Hoc Wireless Networks, Challenges In Wireless Sensor Networks, Clustering Algorithms, Mst Base, Lowest-Id Based, And Dominating-Set Based Clustering, Ad Hoc Routing In Manet And Sensor Networks, Time Synchronization, Localization, Target Tracking, And Other Applications.\nSt\n2. Peer-To-Peer Overlay Networks, 1 And 2 Generation P2P Networks, Koorde And De Bruijn Graph, Bittorrent And Free Riding. Analysis Of Complex Networks, Vertex Degrees, Communities, Matching Index, Centrality, Network Motifs, Random Networks, Small World Networks, Scale-Free Networks,\n8\n3. Distance, Centrality And Prestige, Relationships, Special Subgraphs, Data Clustering, Graph Based Clustering, Network Motif Discovery, Structural Balance, Cohesive Subgroups, Affiliation Networks, Structural, Automorphic, And Regular Equivalence, Community Detection Algorithms, Social Networks, Opportunistic Mobile Social Networks, Architecture, Community Detection, And Middleware, Routing, Multicast In Opportunistic Networks, Information Diffusion, Influence Maximization, Characterizing Link Connectivity, Data Dissemination, Privacy Preserving, Encounter Based Opportunistic Social Discovery.",
  "course outcomes": "\n1. Able To Explain The Main Concepts Of Complex Network Analysis.\n2. Able To Identify Network Models And Explain Their Structures.\n3. Explain Emergent Features Of Complex Networks With Network Models.\n4. Analyse And Design Network Models.\n5. Familiarity With The New Research In This Evolving Area.\n\n\n---",
  "credits": "4",
  "books": "\n1. Stefano Basagni, Marco Conti, Silvia Giordano, And Ivan Stojmenovic, Mobile Ad Hoc Networking: Cutting Edge Directions, 2/E Wiley 2013.\n2. Maarten Van Steen, Graph Theory And Complex Networks: An Introduction, 2010.\n3. Kayhanerciyes, Complex Networks: An Algorithmic Perspective, Crc Press 2015.\n4. Jie Wu And Yunsheng Wang, Opportunistic Mobile Social Networks, Crc Press 2015.\n"
}
{
  "course code": "Cspe73",
  "course title": "Service Oriented Architecture (Soa)",
  "prerequisites": "Cspc27",
  "course type": "",
  "course learning objectives": "\n1. To Understand The Application And Fundamentals Of Advance Database Systems In Real- World.\n2. To Study The Basics Of Query Processing And Optimization Techniques In Advanced Database Systems.\n3. To Lean The Basic Issues Of Transaction Processing And Concurrency Control In Distributed And Multidatabase System.\n4. To Develop The Knowledge Of Various Design And Implementation Issues Of Advance Database For Given Business Requirement.\n",
  "course content": "\n1. Introduction: Overview Of Distributed Database, Data Delivery Alternatives, Promises Of Ddbss, Distributed Dbms Architecture, Design Issues, Fragmentation: Horizontal, Vertical, Hybrid Fragmentation, Allocation And Information Requirements, Allocation Model, Dd Design Approach: Top-Down And Bottom-Up Design Methodology, Schema Matching, Schema Heterogeneity, Linguistic Matching Approaches, Constraint-Based Matching Approaches, Learning-Based Matching, Combined Matching Approaches, Schema Integration, Schema Mapping.\n2. Distributed Database Query Processing: Overview Of Distributed Query Processing, Complexity Of Relational Algebra Operations, Layers Of Query Processing, Query Decomposition: Normalization, Analysis, Elimination Of Redundancy, Rewriting, Localization Of Distributed Data, Reduction For Fragmentation, Query Optimization: Static, Dynamic And Hybrid,\n3. Multidatabase Query Processing: Issues In Multidatabase Query Processing , Multidatabase Query Processing Architecture, Query Rewriting Using Views, Datalog Terminology, Rewriting In Gav, Rewriting In Lav, Query Optimization And Execution, Heterogeneous Cost Modeling, Heterogeneous Query Optimization, Adaptive Query Processing , Query Translation And Execution.\n4. Introduction To Transaction Management: Definition Of A Transaction, Termination Conditions Of Transactions, Characterization Of Transactions, Formalization Of The Transaction Concept, Properties Of Transactions, Acid, Types Of Transactions, Flat Transactions, Nested Transactions, Workflows.\n",
  "course outcomes": "\n1. To Understand Fundamental Concepts, Principles And Applications Of Adv. Database Systems.\n2. To Demonstrate The Knowledge Of Database System And Evaluate Database Design.\n3. To Apply State-Of-Art Techniques To Design Advanced Techniques In Database Systems.\n4. Comprehend Contemporary Trend And Issues In Advance Database System Design Related To Research Domain, Industry And Government.\n\n\n---",
  "credits": "4",
  "books": "\n1. M. Tamer Zsu, Patrick Valduriez, Principles Of Distributed Database Systems, 3 Edition, Springer, 2012.\n8\n2. Hector Garcia-Molina, Jeffrey Ullman,, Jennifer Widom, Database System Implementation, Prentice- Hall, 2000.\n3. A. Silberschatz, H. F. Korth, S. Sudarshan, Database System Concepts,. 5Th Edition. Mcgraw Hill.\n\n"
}
{
  "course code": "Cspe75",
  "course title": "Advanced Computer Architecture",
  "prerequisites": "",
  "course type": "Pe",
  "course learning objectives": "\n1. To Learn Service Oriented Analysis Techniques.\n2. To Learn Technology Underlying The Service Design.\n3. To Learn Advanced Concepts Such As Service Composition, Orchestration And Choreography.\n4. To Know About Various Web Service Specification Standards.\n",
  "course content": "\n1. Introduction: Fundamentals Of Service Oriented Architecture, Characteristics Of Soa, Comparison Of Soa With Client-Server And Distributed Internet Architectures, Anatomy Of Soa, Principles Of Service Orientation\n2. Service Oriented Architecture In Web Services: Fundamentals Of Web Services, Service Descriptions, Message Exchange Patterns, Coordination, Atomic Transactions, Business Activities: Orchestration And Choreography, Service Layer Abstraction, Application Service Layer, Business Service Layer, Orchestration Service Layer\n3. Design Soa: Service Oriented Analysis, Business-Centric Soa, Deriving Business Services Service Modelling, Service Oriented Design, Wsdl Basics, Soap Basics, Soa Composition Guidelines, Entity-Centric Business Service Design, Application Service Design, Task Centric Business Service Design, Bpel Overview: Process, Elements And Functions, Web Service Coordination Overview: Elements, Web Service Business Activity & Atomic Transaction Coordination Type, Business Process Design, Web Service Choreography, Web Service Policy Elements, Web Service Security, Xml Signature Element\n4. Soa Platforms: Soa Platform Basics, Soa Support In J2Ee, Java Api For Xml Based Web Services\n(Jax-Ws), Java Architecture For Xml Binding (Jaxb), Java Api For Xml Registries (Jaxr), Java Api For Xml Based Rpc (Jax-Rpc), Web Services Interoperability Technologies (Wsit), Soa Support In\n.Net, Common Language Runtime, Asp.Net Web Forms, Asp.Net Web Services, Web Services Enhancements (Wse)",
  "course outcomes": "\n1. To Understand Major Software Architectural Styles, Design Patterns, And Frameworks.\n2. To Identify And Assess The Quality Attributes Of A System At The Architectural Level.\n3. To Create Architectural Alternatives For Real-World Problems And Evaluate System'S Architecture.\n\n8\n4. To Comprehend The Contemporary Trends And Issues Related To Software Architectures In Research And Industry.\n\n\n---",
  "credits": "4",
  "books": "\n1. Thomas Erl, Service-Oriented Architecture: Concepts, Technology, And Design, Pearson Education, 2009.\n2. Thomas Erl, Soa Principles Of Service Design, The Prentice Hall, 2005.\n3. Newcomer, Lomow, Understanding Soa With Web Services, Pearson Education, 2005.\n4. Sandeep Chatterjee, James Webber, Developing Enterprise Web Services: An Architects Guide, Pearson Education, 2005.\n"
}
{
  "course code": "Cspe77",
  "course title": "",
  "prerequisites": "Cspc10, Cspc22",
  "course type": "Pe",
  "course learning objectives": "\nThe Objective Of This Course Is To Give Students A Clear Understanding Of The Modern Computer\nArchitecture. Students Will Learn The Design And Analysis Of High Performance (Multi)Processors And\nSupporting Subsystems From The Quantitative Aspect.\n",
  "course content": "\n1. Introduction To Parallel Processing Parallelism In Uni-Processor System, Pipelining, Basic Assumptions, Design Techniques, Designing Pipelined Data Path, Propagating An Instruction Queue Through The Pipeline, Pipeline Hazards And Their Detection, Forwarding, Instruction Level Parallelism, Super-Scalar Architecture, General Pipeline And Reservation Tables, Principles Of Linear Pipelining, Instruction And Arithmetic Pipeline, Principlesof Designing Pipelined Processor, Micro-Programming, General Approach, Micro-Code Engine, Control Store, Branching And Looping, Horizontal And Vertical Micro-Code Scheme With Example, Alternative Approach To Micro-Coding.\n2. Issues In The Architecture Of Distributed Systems\n(A) Introduction, Examples, Distributed Systems Versus Parallel Systems, Partial Orders, Models Of\nDistributed Systems, Architectural Models, Fundamental Models, Interleaving Model, Happened\nBefore Model, Potential Causality Model, Appropriate Model, Models Based On States, Deposet.\n(B) Program Correctness, Correctness Criteria, Safety And Liveness Properties, Correctness Proofs,\nPredicate Logic, Assertional Reasoning, Well-Founded Sets, Predicate Transformers.\n(C) Concept Of Logical Time, Logical Clock And Its Implementation, Limitations Of Lamports Logical\nClock, Vector Clock And Its Implementation, Matrix Clock, And Other Optimal Clocks, Using\nInduction To Prove Properties Of Clocks, Verifying Clock Algorithms, Events, Process States,\nClock Skew And Clock Drift, Synchronizing Physical Clocks, Cristians Method, The Berkeley\nAlgorithm, The Network Time Protocol, Distributed Debugging.\n(D) Synchronization Problems, Mutual Exclusion, Shared Memory Algorithms, Peterson Andlamports\nBakery Algorithm, Token Passing Algorithms, Suzuki-Kasami Algorithm, Raymonds Algorithm,\nMessage Passing Algorithms, Lamports Algorithm, Ricart-Agrawala Algorithm, Maekawa\nAlgorithm, Leader Election, Garci-Molina Bully Algorithm, Chang-Roberts Unidirectional Ring\nAlgorithm, Hirschberg-Sinclair Bidirectional Algorithm, Global States And Consistent Cuts, Chandi-\nLamport And Lai-Yang Snapshot Algorithm, Global State Collection, Dijkstra-Scholten And Other\nTermination Algorithms, Chandi-Misra-Hass And Other Deadlock Detection Algorithms.\n(E) Fault Tolerance, Agreement Problems, Asynchronous Distributed Consensus, Impossibility(Flp)\nResult And Its Proof, Consensus In Synchronous Systems, Byzantine Generals Problem (Bgp),\nConsensus With Oral And Signed Messages, Failure Detectors.\n\n(F) Naming (Tanenbaum-Steen, Ch. 4), Transactions And Concurrency Control (Cdk, Ch. 12),\nDistributed Transaction (Cdk, Ch. 13), Replication (Cdk, Ch. 14)\n",
  "course outcomes": "\n1. Understand The Modern Concepts Of Computer Architecture.\n8\n2. Investigate Modern Design Structures Of Pipelined And Multiprocessors Systems.\n3. Design New Multiprocessors Systems.\n\n\n---",
  "credits": "0",
  "books": "\n1. Hwang And F.A.Briggs: Computer Architecture And Parallel Processing, Mcgraw Hill.\n2. Distributed Systems: Concepts And Design; G Colouris, J Dollimore, T Kindberg 3/E Pearson Ed. 2002. (Cdk)\n3. Distributed Systems: Principles And Paradigm; Andrew S Tanenbaum, Maarten Van Steen 3/E Pearson Ed. 2002.\n4. Elements Of Distributed Computing, Vk Garg, Wiley-Interscience Publishers, 2002.\n"
}
{
  "course code": "",
  "course title": "Image Processing",
  "prerequisites": "Mair12",
  "course type": "Pe",
  "course learning objectives": "\n",
  "course content": "\n1. Introduction Image Processing Fourier Transform And Z-Transform, Causality And Stability, Toeplit And Circulate Matrics, Orthogonal And Unitary Matrices And Kroenker Product, Markov Processes, Ki Transform, Mean Square Estimates And Orthogonal Principles Image Sampling & Quantization: Band Limited Image, Sampling Versus Replication, Reconstruction Of Image From Samples Sampling Theorem, Sampling Theorem For Random Fields, Optimal Sampling, Non-Rectangular Grid Sampling, Sampling Aperture, Display Aperture/ Interpolation Functions, Lagrange Interpolation, Moire Effect Image Quantization: Uniform Optimal Quantizer, Properties Of Mean Square Quantizer, Compandor Design, Visual Quantization\n2. Image Transforms Two Dimensional Orthogonal And Unitary Transforms And Their Properties, One Dimensional And Two Dimensional Dft, Cosine, Sine, Hadamard, Slant, Haar And Ki Transforms And Their Properties, Approximation To Ki Transforms. Image Representation By Stochastic Models: One Dimensional Causal Models, Ar, Arma Models, Spectral Factorization, Non Causal Representation, Image Decomposition.\n3. Image Enhancement And Restoration Point Operation, Histogram Modeling, Spatial Operations, Transform Operations, Multispectral Image Enhancement. Image Filtering: Image Observation Models, Inverse And Wiener Filter, Fir Wiener Filters, Filtering Using Image Transform, Causal Models And Recursive Filtering, Maximum Entropy Restoration, Extrapolation Of Band Limited Signal.\n4. Image Analysis And Image Compression Spatial Feature Extraction, Edge Detection, Boundary Extraction, Boundary Representations, Region Representations, Moment Representations, Structures, Texture, Image Segmentation, Image Classification Image Reconstruction From Projections: Data Compression: Pixel Coding, Predictive Techniques, Transform Coding Theory, Transform Coding Of Image, Coding Of Two-Tone Image.\n",
  "course outcomes": "\n1. Acquire The Fundamental Concepts Of A Digital Image Processing System\n2. Apply Knowledge Of Various Mathematical Tools Used For 1D And 2D Signal Analysis And Processing\n3. Analyze 2D Signals In The Spatial And Frequency Domain.\n4. Design And Implement Algorithms For Digital Image Processing Operations.\n\n8\n5. Ability To Apply Image Processing Techniques To Solve Various Real Time Problems.\n\n\nCsir30 / Csir32  Internship / Project Work\n\n\n---",
  "credits": "4",
  "books": "\n1. Anil Jain, Fundamentals Of Digital Image Processing, Pearson, 1988.\n2. Richard E Woods And Rafael C Gonzales, Digital Image Processing, Pearson, 3 Edition, 2009.\n3. William. K. Pratt, Digital Image Processing, John Wiley & Sons, 4 Edition, 2007.\n"
}
{
  "course code": "Cspc41",
  "course title": "Machine Learning",
  "prerequisites": "Cspc33, Mair13, Mair12",
  "course type": "Pc",
  "course learning objectives": "\n1. Be Able To Understand And Apply Supervised And Unsupervised Learning Algorithms.\n2. Understand The Fundamental Concepts In Machine Learning And Popular Machine Learning Algorithms.\n3. Understand The Concept Of Deep Learning\n4. Be Able To Solve Problems Related To The Application Of Machine Learning Algorithms With Programming In Python/ Matlab.\n",
  "course content": "\n1. Introduction Basic Definitions, Types Of Learning, Hypothesis Space And Inductive Bias, Evaluation, Cross-Validation, Instance Based Learning, Feature Reduction, Collaborative Filtering Based Recommendation, Gradient Decent Learning.\n2. Kernel Methods And Support Vector Machines The Two-Class Problem, Dual Representation, Soft Margin Classification; Origins Of Kernel Methods, Kernel Mapping, The Kernel Trick; Constructing Kernels, Support Vector Machines: Formulation And Computation; Radial Basis Function Networks; Positive Semi-Definite Kernels, Linear Kernel, Polynomial Kernel.\n3. Clustering And Learning Basic Clustering Techniques, Standard K-Means (Lloyd) Algorithm, Generalized Clustering, Overpartitioning, Merging, Modifications To The K-Means Algorithm, K-Means Wrappers, Rough K- Means, Fuzzy K-Means, K-Harmonic Means Algorithm, Hybrid Clustering Algorithms; Estimation Using Incomplete Data, Two Classes, Multiple Classes, Least Squares For Classification, Fishers Linear Discriminant, Relation To Least Squares, Fishers Discriminant For Multiple Classes\n4. Deep Learning Neural Network: Perceptron, Multilayer Network, Backpropagation, Introduction To Deep Neural Network: Convolutional Neural Networks, Its Architectures, Convolution Layers, Pooling Strategies And Softmax Layer,\n",
  "course outcomes": "",
  "credits": "4",
  "books": "\n\nCourse Outcome: %1. Recognize Major Programming Languages. 2. Explain The Stages Of Programming Language Interpretation And Compilation. 3. Understand Fundamental Concepts In Machine Learning And Popular Machine Learning Algorithms. 4. Explain Basics Of Computational Learning Theory. 5. Hands-On Problem Solving With Programming In Python And Matlab 8\n---"
}
{
  "course code": "Cspc43",
  "course title": "Distributed Computing",
  "prerequisites": "",
  "course type": "Pc",
  "course learning objectives": "\n1. To Understand Fundamental Concepts Of Distributed Computing.\n2. To Acquire Knowledge To Design And Develop Protocols For Distributed Systems And Networks.\n",
  "course content": "\n1. Fundamental Issues In Distributed Systems, Models Of Distributed Computations, Handling Time Through Clocks, Physical Time And Hardware Clock Synchronization, Logical Time And Software Clocks, Message Ordering Protocols, Interprocess Communication, Shared Memory Vs Message Passing Models, Distributed And Localized Algorithms, Evaluation Of Correctness And Performance.\n2. Protocols For Routing And Designing Virtual Constructs, Mst, Mis, And Cds, Distributed Mutual Exclusion, Leader Election,\n3. Distributed Deadlock Detection, Termination Detection, Global State Computation And Snapshot Recording.\n4. Global Predicate Detection, Fault-Tolerance Issues, Basic Techniques For Handling Crash Failure In Distributed Systems, Checkpointing And Rollback Recovery, Z-Path And Z-Cycles, Other Types Of Failures In Distributed Computing Systems, Consensus And Agreement Protocols, Flp Impossibility, Byzantine Generals Problem, Failure Detectors, Wait Freedom, Self-Stabilization, Peer-To-Peer Computing, Overlay Structures, Distributed Scheduling And Load Balancing, Naming, Security.",
  "course outcomes": "",
  "credits": "3",
  "books": "\n1. A D Kshemkalyani And Mukeshsinghal, Distributed Computing: Principles, Algorithms, And Systems, Cambridge University Press 2008.\n2. G Colouris, J Dollimore, And T Kindberg, Distributed Systems: Concepts And Design, 3/E Pearson Ed. 2002.\n3. A S Tanenbaum And M Van Steen, Distributed Systems: Principles And Paradigms, 3/E Pearson Ed. 2002.\n4. V K Garg, Principles Of Distributed Systems, Kluwer Academic Publishers, 1996.\n5. Sukumar Ghosh, Distributed Systems: An Algorithmic Approach, 2/E Chapman& Hall.\n6. V K Garg, Principles Of Distributed Computing, Ieee Press.\n7. Nancy Lynch, Distributed Algorithms, Morgan Kaufmann Press. Gerard Tel, Introduction To Distributed Algorithms, Cambridge University Press.\nCourse Outcome\n1. Able To Apply Knowledge Of Operating Systems And Networks To Distributed Systems\n2. Design Distributed Algorithms For Complex Computing Problems\n3. Analyze The Performance Of Algorithms And Evaluate The Scalability Of Solutions\n4. Adapt Existing Centralized Algorithms To Distributed Set Up\n5. Simulate The Algorithms In Distributed Environment\n\n---"
}
{
  "course code": "Cspc45",
  "course title": "Information Security",
  "prerequisites": "Mair13, Cspc26",
  "course type": "Pc",
  "course learning objectives": "\n1. To Introduce The Concept Of Information Security.\n2. To Make Students Familiar With Different Aspects Of Access Control, System Security And Its Applications.\n3. To Design Security Solutions For Different Operation Systems And Databases\n4. To Discuss And Analyze Various Legal Issues And Cyber Laws.\n\n8",
  "course content": "\n1. Introduction Meaning Of Security, Privacy, Attacks, Vulnerabilities And Protection, Cia Triad, Threat, Control, Layers Of Information Security, Computer Criminals, Methods Of Defense, Cryptography, Steganography, Ciphers, Encryption, Decryption, Key Exchange, Uses Of Encryption, Digital Signature.\n2. Access Control And Legal Issues The Principle Of Least Privilege, Authentication, Authorization, Access Control System Operation, Access Control System Components, Access Control Topology, Access Control Mechanisms, Mandatory Access Control, Discretionary Access Control, Role Based Access Control, Attribute-Based Access Control, Rule-Based Access Control, Identity-Based Access Control, Legal Issues, Ethical Issues, Privacy, Cyber Crime, Need For Cyber Law, Cyber Laws, Intellectual Property Issues In Cyber Space.\n3. System And Operating Security Overview, Security Policy, File Protection Mechanisms, User Authentication, Security Models, Trusted Operating System Design, Host Based Intrusion Detection System, Network Based Intrusion Detection System, Host Based Intrusion Prevention System, Network Based Intrusion Prevention System.\n4. Network And Database Security Network Security Concepts, Network Threats, Security Controls, Firewalls, Protecting Programs And Data, Secure Program, Sniffing, Spoofing, Non Malicious Program Errors, Malware, Viruses And Other Malicious Code, Control Against Program, Honeypot, Database Security Requirements, Privacy And Integrity, Sensitive Data, Multilevel Database. Assignment (Implementation Of Any Security Algorithm From Above Related Topics, As An Assignment)\n",
  "course outcomes": "",
  "credits": "4",
  "books": "\n1. Charles P. Pfleeger, Share Lawrence Pfleeger, Security In Computing, Pearson Education, 2/E.\n2. William Stallings, Cryptography And Network Security, Phi, 4/E\n3. Neal Koblitz, A Course In Number Theory And Cryptography, Springer 2006.\n"
}
{
  "course code": "Cspe41",
  "course title": "Cloud And Grid Computing",
  "prerequisites": "Cspc26",
  "course type": "Pe",
  "course learning objectives": "\n8 The Objective Of The Course Is To Give Students A Comprehensive View Of Storage And Networking Infrastructures For Highly Virtualized Cloud Ready Deployments. The Course Discusses The Concepts And Features Related To Virtualized Datacenter And Cloud, Information Storage, Security And Design Of Applications.\n",
  "course content": "",
  "course outcomes": "\nOn Successful Completion Of This, Course Students Will:\n1. Able To Understand The Information Security Concepts.\n2. Able To Analyses Different Aspects Of Access Control, System Security And Its Applications.\n3. Able To Design And Develop Security Solutions For Different Operation Systems And Databases\n4. Able To Familiar With Various Legal Issues And Cyber Laws. Programme Elective  V\n\n\n---",
  "credits": "4",
  "books": "\n1. An Introduction To Theory Of Numbers, Niven, Zuckerman And Montgomery, (Wiley 2006)\n2. Elliptic Curves: Number Theory And Cryptography, Lawrence C. Washington, (Chapman & Hall/Crc 2003)\n3. Charlie Kaufman, Perlman & S Peeciner, Network Security, Pearson Education, 2/E.\n"
}
{
  "course code": "Cspe43",
  "course title": "Natural Language Processing",
  "prerequisites": "Cspe210",
  "course type": "Pe",
  "course learning objectives": "",
  "course content": "\n1. Overview Of Computing Paradigm, Recent Trends In Computing. Distributed Computing, Cluster Computing, Grid Computing, Utility Computing.\n2. Cloud Computing, Introduction To Cloud Computing, History Of Cloud Computing, Cloud Service Providers, Pros And Cons Of Cloud Computing, Benefits Of Cloud Computing, Cloud Computing Vs. Cluster Computing Vs. Grid Computing, Cloud Computing Architecture, Service Models (Xaas), Infrastructure As A Service(Iaas), Platform As A Service(Paas), Software As A Service(Saas).\n3. Deployment Models, Public Cloud, Private Cloud, Hybrid Cloud, Community Cloud, Dynamic Provisioning And Resource Management,Cloud Security,\n4. Case Study On Open Source & Commercial Clouds: Eucalyptus, Microsoft Azure, Amazon Ec2.\n",
  "course outcomes": "\n1. To Understand And Apply The Knowledge Of Systems Protocols And Mechanisms To Support Grid And Cloud Computing\n2. To Analyze And Implement The Concepts Of Cloud Computing\n3. To Deploy Applications On Cloud Middleware\n4. To Understand And Resolve Security Issues In Various Applications\n\n\n---",
  "credits": "4",
  "books": "\n1. Cloud Computing (Wind) By Kumar Saurabh, 2Nd Edison, Wiley India.\n2. Cloud Computing: Principles And Paradigms, Editors: Rajkumar Buyya, James Broberg, Andrzej M. Goscinski, Wiley, 2011.\n3. Cloud Computing: Principles, Systems And Applications, Editors: Nikos Antonopoulos, Lee Gillam, Springer, 2012.\n"
}
{
  "course code": "Cspe45",
  "course title": "Computer Vision",
  "prerequisites": "Mair13, Cspc11",
  "course type": "Pe",
  "course learning objectives": "",
  "course content": "\n1. Introduction To Natural Language Processing (Nlp): Definition, History, Applications Of Nlp, Goals Of Nlp.\n2. Words And Phonetics: Regular Expressions And Automata, Morphology And Phonetics Fundamentals, Morphological Diversity Of Indian Languages, Morphology Paradigms, And Finite State Machine Based Morphology, Computational Phonology And Text-To-Speech, Probabilistic Models Of Pronunciation And Spelling, N-Grams, Hmms And Speech Recognition, Wordnet And Linking.\n3. Parsing: Part-Of Speech Tagging, Theories Of Parsing, Syntactic And Statistical Parsing, Parsing Algorithms, Hybrid Of Rule Based And Probabilistic Parsing, Scope Ambiguity And Attachment Ambiguity Resolution, Tree Banks.\n5. Discourse And Dialogue: Discourse And Dialogue Analysis, Anaphora Resolution, Named Entity Resolution, Event Anaphora, Information Extraction And Retrieval.\n6. Applications: Sentiment Analysis, Text Entailment, Machine Translation, Automated Speech Recognition Systems, Question-Answering Based Systems, Shallow Parsers.\n\n8",
  "course outcomes": "\n1. Develop Background Of Translation, Information Retrieval And Statistical Discourse Processing.\n2. Introduction To Various Recent Statistical Methods In Natural Language Processing.\n3. Develop Familiarity To Linguistics And Their Application To Part-Of-Speech Tagging.\n---",
  "credits": "4",
  "books": "\n1. Jurafsky, D. & J. Martin, \"Speech And Language Processing: An Introduction To Natural Language Processing Computational Linguistics, And Speech Recognition\" Prentice Hall, 2000.\n2. Grosz, B.J., Sparck Jones, K. & Webber, B.L. (Eds) \"Readings In Natural Language Processing\", Los Altos, Ca. Morgan Kaufmann, 1986.\n3. Allen, J., \"Natural Language Understanding\", Redwood City, Ca: 1994. Benjamin/Cummings.\n4. Bharti, Akshar,Chaitanya Vineet, Sangal Rajeev, \"Natural Language Processing\", Prentice Hall.\n"
}
{
  "course code": "Cspe47",
  "course title": "Graphics & Visualization",
  "prerequisites": "Mair12",
  "course type": "Pe",
  "course learning objectives": "\n1. Be Familiar With Both The Theoretical And Practical Aspects Of Computing With Images;\n2. Have Described The Foundation Of Image Formation, Measurement, And Analysis;\n3. Have Implemented Common Methods For Robust Image Matching And Alignment;\n4. Understand The Geometric Relationships Between 2D Images And The 3D World.\n5. Have Gained Exposure To Object And Scene Recognition And Categorization From Images;\n6. Able To Develop The Practical Skills Necessary To Build Computer Vision Applications.\n",
  "course content": "\n1. Digital Image Formation And Low-Level Processing Overview And State-Of-The-Art, Fundamentals Of Image Formation, Transformation: Orthogonal, Euclidean, Affine, Projective, Etc; Fourier Transform, Convolution And Filtering, Image Enhancement, Restoration, Histogram Processing.\n2. Feature Extraction Edges - Canny, Log, Dog; Line Detectors (Hough Transform), Corners - Harris And Hessian Affine, Orientation Histogram, Sift, Surf, Hog, Gloh, Scale-Space Analysis- Image Pyramids And Gaussian Derivative Filters, Gabor Filters And Dwt.\n3. Shape Representation, Segmentation And Object Recognition Shape Representation And Segmentation, Deformable Curves And Surfaces, Snakes And Active Contours, Level Set Representations, Fourier And Wavelet Descriptors, Medial Representations ,Multiresolution Analysis, Hough Transforms And Other Simple Object Recognition Methods, Shape Correspondence And Shape Matching, Shape Priors For Recognition.\n4. Motion Estimation Regularization Theory, Optical Computation, Stereo Vision, Motion Estimation, Structure From Motion.\n",
  "course outcomes": "",
  "credits": "4",
  "books": "\n1. Richard Szeliski, Computer Vision: Algorithms And Applications, Springer-Verlag London Limited 2011.\n2. Computer Vision: A Modern Approach, D. A. Forsyth, J. Ponce, Pearson Education, 2003.\n3. Richard Hartley And Andrew Zisserman, Multiple View Geometry In Computer Vision, Second Edition, Cambridge University Press, March 2004.\n4. K. Fukunaga; Introduction To Statistical Pattern Recognition, Second Edition, Academic Press, Morgan Kaufmann, 1990.\n5. R.C. Gonzalez And R.E. Woods, Digital Image Processing, Addison- Wesley, 1992.\n\nJournals\n8\n1. Ieee-T-Pami (Ieee Transactions On Pattern Analysis And Machine Intelligence).\n2. Ijcv (International Journal Of Computer Vision) - Springer.\n\nCourse Outcome:\n1. Able To Demonstrate Knowledge And Understanding Of Human And Computer Vision Systems.\n2. Understand Current Approaches To Image Formation And Image Modeling.\n3. Analyze And Design A Range Of Algorithms For Image Processing And Computer Vision\n4. Develop And Evaluate Solutions To Problems In Computer Vision\n\n\n---"
}
{
  "course code": "Cspc40",
  "course title": "Big Data Analytics",
  "prerequisites": "Cspc214",
  "course type": "",
  "course learning objectives": "\n1. Comprehensive Introduction For Computer Graphics Leading To The Ability To Understand Contemporary Terminology, Progress, Issues, And Trends\n2. Involves Processing And Transforming Large, Incomprehensible Datasets Into A Format More Easily Understood By Humans\n3. Introduce Theoretical Methods For Two-Dimensional And Three-Dimensional Graphics With Applications To Visualization Techniques\n",
  "course content": "\n1. Introduction, Scan Conversion, 2D & 3D - Transformation And Viewing: Overview Of Computer Graphics, Representing Pictures, Preparing Pictures For Presentation, Presenting Previously Prepared Pictures, Crt Technologies - Raster Scan Display, Computer Graphics Software. Scan Conversion: Points & Lines, Line Drawing Algorithms; Dda Algorithm, Bresenhams Line Algorithm, Circle Generation Algorithm; Ellipse Generating Algorithm; Scan Line Polygon, Fill Algorithm, Boundary Fill Algorithm, Flood Fill Algorithm. 2D & 3D - Transformation And Viewing: Translation, Rotation, Scaling; Matrix Representations & Homogeneous Coordinates, Transformations Between Coordinate Systems; Reflection Shear; Transformation Of Points, Lines, Parallel Lines, Intersecting Lines; Viewing Pipeline, Window To Viewport Co-Ordinate Transformation, Clipping Operations, Point Clipping, Line Clipping, Clipping Circles, Polygons & Ellipse. 3D Transformation: Translation, Rotation, Scaling & Other Transformations, Rotation About An Arbitrary Axis In Space, Reflection Through An Arbitrary Plane, General Parallel Projection Transformation\n2. Clipping, Curves Fractals, Geometric Modeling, Hidden Surfaces And Color & Shading Models: Viewport Clipping, 3D Viewing, Perspectives & Depth Cueing. Curves And Fractals: Curve Representation, Surfaces, Designs, Bezier Curves, B-Spline Curves, End Conditions For Periodic B-Spline Curves, Rational B-Spline Curves. Geometric Modeling: Elementary Geometric Algorithms For Polygons, Boundary Representations, Constructive Solid Geometry, Spatial Data Structures. Hidden Surfaces And Color & Shading Models: Depth Comparison, Z-Buffer Algorithm, Back Face Detection, Bsp Tree Method, The Printers Algorithm, Scan-Line Algorithm; Hidden Line Elimination, Wire Frame Methods, Fractal  Geometry. Color & Shading Models: Introduction, Modeling Light Intensities And Sources, Diffuse Reflection, Lamberts Cosine Law, Specular Reflection, Halftoning, Color Models - Rgb Color, Cmy Color, Realistic Image Synthesis Techniques, Textures And Image-Based Rendering\n3. Visual Saliency, Perceptual Attractiveness, Visualization Of Experimental And Simulated Data: Perception-Oriented And Non-Photorealistic Rendering, Human Perception Of Saliency On Object Surfaces, Relief Mapping Of Textures. Visualization Of Experimental And Simulated Data: Surface Construction From Scattered Data, 3-D Data Arrays And 2-D Cross Sections, Elevation Maps, Topological Maps, Contour Maps And Intensity Maps; Fractals For Visualization Of Complex And Large Data Sets, Algebraic Stochastic And Geometric Fractals, Modeling Of Natural Forms And Textures Using Fractals, Visualization Of Multi Variate Relations, Flow Visualization And Hyper Streamlines, Visualization Of Meteorological, Cosmological, Seismic, Biological Data For Scientific Decision Making, Data And Geometry, Height Field And Contours, Visualizing Surfaces And Scalar Fields, Isosurfaces And Marching Cubes, Direct Volume Rendering, Vector-Field Visualization, Tensor-Visualization\n4. Animation, Visual Realism, Image/Video Based Rendering, Animation And Capture:\n8 Modelling Issues In Dynamic Visualization, Behavioural Animation, Walk Through Coordinate Transformation And View Transformation, Virtual Reality Interfaces, Interactive And Immersive Systems For Prototyping And Visualization, Visualization In Concurrent Engineering, Interactive Multimedia Technology And Standards For Video-Graphics-Audio Integration And Tele-Video Conferencing. Visual Realism: Natural Effects For Object Rendering, Iterative Ray Tracing, Radiosity, Plenoptic Function, Perlin Noise, Lighting & Shadow, Materials Effect, Brdf, Volumes And Photons, Fire And Water, Fog, Smoke Modeling Etc. Image/Video Based Rendering: Video Mosaic Synthesis, Video Resizing And Stabilization, Novel View Synthesis; Photosynth, Retargeting, 3D Cut And Paste. Animation And Capture: Motion Control, Orientation Parameterization, Quaternions, Animating Articulated Structures, Inverse Kinematics, Hard And Soft Constraints, Implicit Surfaces; Stylized Rendering And Illusion, Facial Animation, Appearance Capture.\n",
  "course outcomes": "\n1. Use The Underlying Architecture, Algorithms, Mathematical Concepts, Supporting Computer Graphics\n2. Enhance Their Perspective Of Modern Computer System With Modeling, Analysis And Interpretation Of 2D And 3D\n3. Fundamental Graphic Design Theory And Principles As They Relate To Current Trends In Visual Communication\n4. Organize Information To Make Compelling And Experimental Visual Expressions For Presentation\n5. Explain And Understand Fundamental Concepts Within Information Visualization And Scientific Visualization\n\n\n---",
  "credits": "4",
  "books": "\n1. Edward Angel And Dave Shreiner, Interactive Computer Graphics: A Top-Down Approach With Shader-Based Opengl, Pearson, 6 Edition, 2011.\n2. F.S. Hill Jr., Computer Graphics Using Opengl, Pearson, 3 Edition, 2006.\n3. John F. Hughes, Andries Van Dam, Morgan Mcguire, David F. Sklar, James D. Foley, Steven K. Feiner, And Kurt Akeley, Computer Graphics: Principles And Practice, Pearson Education, 1 Edition, 2013.\n"
}
{
  "course code": "Cspe40",
  "course title": "High Performance Computing",
  "prerequisites": "",
  "course type": "Pc",
  "course learning objectives": "\n1. To Understand The Concept And Challenge Of Big Data And Why Traditional Technology Is Inadequate To Analyze The Big Data.\n2. To Collect, Manage, Store, Query, And Analyze Various Types Of Big Data.\n3. Gain Hands-On Experience On Large-Scale Analytics Tools To Solve Big Data Problems.\n4. To Study The Impact Of Big Data Analysis For Societal And Business Decisions.\n",
  "course content": "\n1. Introduction: Overviews Of Big Data, State Of The Practice In Analytics, The Data Scientist, Big Data Analytics In Industry Verticals, Data Analytics Lifecycle Challenges Of Conventional Systems, Statistical Concepts: Sampling Distributions, Re-Sampling, Statistical Inference, Prediction Error, Regression Modelling , Multivariate Analysis , Bayesian Modelling .\n2. Mining Data Streams: Stream Data Model And Architecture, Stream Computing, Sampling Data In A Stream, Filtering Streams, Counting Distinct Elements In A Stream, Estimating Moments, Counting Oneness In A Window, Decaying Window, Real Time Analytics, Platform (Rtap) Applications, Case Studies, Real Time Sentiment Analysis, Stock Market Prediction.\n3. Frequent Itemset And Clustering : Mining Frequent Itemsets, Market Based Model: Apriori Algorithm, Handling Large Data Sets In Main Memory, Limited Pass Algorithm, Counting Frequent Itemsets In A Stream, Clustering Based Techniques: Hierarchical, K-Means Etc., Clustering High Dimensional Data, Clique And Proclus, Frequent Pattern Based Clustering Methods, Clustering In Non-Euclidean Space, Clustering For Streams And Parallelism.\n\n8\n4. Frameworks And Visualization: Overview Of Mapreduce, Hadoop, Hive, Mapr, Sharding, Nosql Databases, S3, Hadoop, Distributed File System (Hdfs), Visualizations: Visual Data Analysis Techniques , Interaction Technique And Applications.\n",
  "course outcomes": "\n1. To Become Proficient In Recognizing Challenges Faced By Applications Dealing With Very Large Data As Well As In Proposing Scalable Solutions.\n2. To Design Efficient Algorithms For Mining The Data Databases.\n3. To Model A Framework For Visualization Of Big Data Analytics For Business User.\n4. To Understand The Significance Of Big Data Analysis In Business Intelligence, Scientific Discovery, And Day-To-Day Life.\n\nProgramme Elective  Vi\n\n---",
  "credits": "4",
  "books": "\n1. Michael Berthold, David J. Hand, Intelligent Data Analysis, Springer, 2007.\n2. A. Rajaraman, J.D. Ullman, Mining Of Massive Datasets, Cambridge University Press, 2012.\n3. Bill Franks, Taming The Big Data Tidal Wave: Finding Opportunities In Huge Data Streams With Advanced Analytics, John Wiley & Sons, 2012.\n4. Glenn J. Myatt, Making Sense Of Data, John Wiley & Sons, 2007\n5. Pete Warden, Big Data Glossary, Oreilly, 2011.\n6. J. Han, M. Kamber , Data Mining Concepts And Techniques, 2 Edition, Elsevier, Reprinted 2008.\n"
}
{
  "course code": "Cspe42",
  "course title": "Human Computer Interaction",
  "prerequisites": "Cspe315",
  "course type": "Pe",
  "course learning objectives": "\nThe Objective Of Course, Is To Provide A Comprehensive Introduction To Parallel Algorithms And Parallel\nProgramming, With Strong Emphasis On The Design Of Parallel Algorithms And Their Rigorous Analysis.\nExposure To Parallel Programming Is Provided Through Programming Assignments Using Mpi. Throughout\nThe Course, The Design Of Algorithms Is Interlaced With The Programming Techniques Useful In Coding Them.\n",
  "course content": "\n1. Performance Measures: Speedup, Efficiency And Scalability. Model Of Parallel Computation And Basic Communication Primitives. Parallel Prefix And Applications, Parallel Sorting, Embeddings, Parallel Matrix Algorithms.\n2. Communication Networks For Parallel Computers And Parallel Models Of Computation, Parallel Fast Fourier Transforms.\n3. Parallel Programming With Mpi: Writing And Executing Mpi Programs, Collective Communication, Grouping Data For Communication, Communicators And Topologies.\n4. Parallel Random Number Generation, Parallel Octrees, Parallel N-Body Methods, Parallel Bayesian Network Construction.\n",
  "course outcomes": "\n1. Understand In A General Sense The Architecture Of High Performance Computers.\n2. Understand How The Architecture Of High Performance Computers Affects The Speed Of Programs Run On Hpcs.\n3. Understand How Memory Access Affects The Speed Of Hpc Programs.\n8\n4. Understand Amdahls Law For Parallel And Serial Computing.\n5. Understand The Importance Of Communication Overhead In High Performance Computing.\n6. Understand Some Of The General Types Of Parallel Computers.\n7. Understand How Different Types Of Problems Are Best Suited For Different Types Of Parallel Computers.\n8. Understand Some Of The Practical Aspects Of Message Passing On Mimd Machines.\n\n\n---",
  "credits": "0",
  "books": "\n1. Introduction To Parallel Computing: Design And Analysis Of Algorithms By A. Grama, A. Gupta, G. Karypis And V. Kumar.\n2. Parallel Programming With Mpi By Peter S. Pacheco.\n3. Introduction To High Performance Scientific Computing Victor Eijkhout, Edmond Chow, Robert Van De Geijn.\n"
}
{
  "course code": "Cspe44",
  "course title": "",
  "prerequisites": "",
  "course type": "Pe",
  "course learning objectives": "\n1. Describe And Apply Core Theories, Models And Methodologies From The Field Of Hci\n2. Implement Simple Graphical User Interfaces\n3. Discuss Current Research In The Field Of Hci\n",
  "course content": "\n1. Introduction, Task-Centred System Design, User-Centred Design And Prototyping: Human-Computer Interaction. Task-Centred System Design: Task-Centered Process, Development Of Task Examples, Evaluation Of Designs Through A Task-Centered Walk-Through. User-Centred Design And Prototyping: Assumptions, Participatory Design, Methods For Involving The User, Prototyping, Low Fidelity Prototypes, Medium Fidelity\n2. Methods For Evaluation Of Interfaces With Users And Psychology Of Everyday Things: Goals Of Evaluation, Approaches, Ethics, Introspection, Extracting The Conceptual Model, Direct Observation, Constructive Interaction, Interviews And Questionnaires, Continuous Evaluation Via User Feedback And Field Studies, Choosing An Evaluation Method. Psychology Of Everyday Things: Psychopathology Of Everyday Things, Examples, Concepts For Designing Everyday Things. Beyond Screen Design: Characteristics Of Good Representations, Information Visualization, Tuftes Guidelines, Visual Variables, Metaphors, Direct Manipulation\n3. Graphical Screen Design, Design Principles And Usability Heuristics: Graphical Design Concepts, Components Of Visible Language, Graphical Design By Grids. Design Principles And Usability Heuristics: Design Principles, Principles To Support Usability, Golden Rules And Heuristics, Hci Patterns\n4. Hci Design Standards, Past And Future Of Hci: Process-Oriented Standards, Product-Oriented Standards, Strengths And Limitations Of Hci Standards. Past And Future Of Hci: The Past, Present And Future, Perceptual Interfaces, Context-Awareness And Perception\n",
  "course outcomes": "\n1. Understand The Basics Of Human And Computational Abilities And Limitations\n2. Understand Basic Theories, Tools And Techniques In Hci\n3. Understand The Fundamental Aspects Of Designing And Evaluating Interfaces\n4. Practice A Variety Of Simple Methods For Evaluating The Quality Of A User Interface\n5. Apply Appropriate Hci Techniques To Design Systems That Are Usable By People\n\n\n---",
  "credits": "4",
  "books": "\n1. Dix A., Finlay J., Abowd G. D. And Beale R., Human Computer Interaction, Pearson Education, 3 Edition, 2005.\n2. Preece J., Rogers Y., Sharp H., Baniyon D., Holland S. And Carey T. Human Computer Interaction, Addison Wesley, 1 Edition, 1994.\n"
}
{
  "course code": "",
  "course title": "Compiler Design",
  "prerequisites": "Cspc37",
  "course type": "Pe",
  "course learning objectives": "\nThe Objective Of This Course Is To Give Students A Clear Understanding Of The Major Concept Areas Of\nLanguage Translation And To Enrich The Knowledge In Various Phases Of Compiler And Its Use, Parsing\nTechniques, Code Optimization Techniques, Machine Code Generation, And Use Of Symbol Table.",
  "course content": "\n1. Introduction And Types Of Translators, The Structure Of A Compiler, Design Of Lexical Analyzer,Specification & Implementation Of Lexical Analyzer. Parsers, Shift-Reduce Parsing, Operator- Precedence Parsing, Top-Down Parsing, Recursive Descent Parsing, Predictive Parsers.\n2. Lr Parsers, The Canonical Collection Of L R (O) Items, Construction Of Slr Parsing Tables, Constructing Canonical L.R. Parsing Tables, Constructing Lalr Parsing Tables, Implementation Of L R Parsing Tables Syntax-Directed Translation Schemes, Implementation Of Syntax Directed Translators, Intermediate Code, Postfix Notation, Parse Trees And Syntax Trees, Three Address Code, Quadruples, And Triples, Translation Of Assignment Statements, Boolean Expressions, Control Statements.\n3. The Contents Of A Symbol Table, Data Structures For Symbol Tables, Representing Scope Information. Implementation Of A Simple Stack Allocation Scheme, Implementation Of Block Structured Languages, Storage Allocation In Block Structured Language. Error-Lexical Phase Errors, Syntactic Phase Errors, Semantic Errors.\n4. The Principle Sources Of Optimization, Loop Optimization, The Dag Representation Of Basic Blocks, Value Number And Algebraic Laws, Global Data-Flow Analysis. Object Programs, Problems In Code Generation, A Machine Model, A Simple Code Generator, Register Allocation And Assignment, Code Generation From Dags, Peephole Optimization.\n",
  "course outcomes": "",
  "credits": "4",
  "books": "\n1. Aho A.V. And Ullman J.D. Principles Of Compiler Design, Addison Wesley.\n2. Donovan, J, System Programming, Tmh.\n3. D.M. Dhamdhere: Compiler Construction-Principles And Practice Mcmillan India.\n4. David Gries: Compiler Construction For Digital Computer.\n"
}
{
  "course code": "Cspe46",
  "course title": "Graph Theory And Combinatorics",
  "prerequisites": "Mair13",
  "course type": "Pe",
  "course learning objectives": "\n1. To Introduce Topics And Techniques Of Discrete Methods And Combinatorial Analysis.\n2. To Introduce A Large Variety Of Applications And, Through Some Of Them, The Algorithmic Approach To The Solution Of Problems.\n",
  "course content": "\n1. Graph Fundamentals: Walks, Paths, Directed Graphs, Knots, Cycles, Neighborhood, Clique, Reachability, Connectivity, Spanning Tree, Knot Detection Algorithms. Graph Coloring: Problem And Model, Greedy And Random Coloring Algorithms, Edge Coloring, Coloring Trees, Coloring Planar And Arbitrary Graph. 8\n2. Graph Traversal: Tarrys Traversal Algorithm, Search Algorithms, Bfs Algorithms And Applications, Classical And Awerbuchs Dfs Algorithm, Dfs With Neighbor Knowledge, Spanning Tree Construction Using Flooding And Dfs, Ghs, Awerbuch, Korach-Kutten-Moran Mst Algorithms And Applications, Synchronizers. Matching: Unweighted And Weighted Matching Algorithms, Matching From Edge Coloring. Vertex Cover: Unweighted And Weighted Vertex Cover Algorithms, Pricing Algorithm, Bipartite Matching-Based Algorithms.\n3. Routing: Shortest Path Algorithms, Dijkstra, Bellman-Ford, Floyd-Warshall, Chandi-Misra Algorithms, Johnsons Algorithm, Link State, Distance Vector, And Interval Routing Algorithms, Maximum Flow, Ford- Fulkerson Method, Maximum Bipartite Matching, Push-Relabel Algorithm, Relabel-To-Front Algorithm. Maximal Independent Set (Mis): Rank-Based Mis Algorithms, Lubys Mis Algorithm, Mis Construction From Vertex Coloring. Domination Algorithms: Greedy Mds Algorithms, Guha-Khuller Algorithm, Connected Dominating Sets, Mis-Based And Pruning-Based Algorithms, Weakly Connected Dominating Sets.\n4. Network Algorithms: Network Analysis, Vertex Degrees, Degree Distribution, Degree Correlation, Distance Statistics, Clustering Coefficient, Local And Global View, Centrality, Topology Control.\n\n",
  "course outcomes": "\n1. Learn The Fundamentals Of Language Translator And Compiler Design.\n2. Ability To Design Algorithms For Parsers (Top-Down And Bottom-Up).\n3. Classify And Discuss Intermediate Code Generation And Optimization Techniques To Improve The Performance Of A Program\n4. Gain Knowledge Of Techniques Of Symbol Table Organization, Fundamentals Of Runtime Environment And Code Generation.\n\n---",
  "credits": "4",
  "books": ""
}
{
  "course code": "Csoe41",
  "course title": "Operating Systems",
  "prerequisites": "",
  "course type": "Oe",
  "course learning objectives": "\n1. To Understand The Services And Design Of An Operating System.\n2. To Understand The Structure And Organization Of File System\n3. To Understand The Process States And Various Concepts Such As Scheduling And Synchronization Related With It.\n4. To Understand Different Memory Management Approaches.\n5. Students Should Be Able To Use System Calls For Managing Processes, Memory And File System.\n6. Students Should Understand The Data Structures And Algorithms For Implementation Of Os.\n8",
  "course content": "\n1. Computer System Architecture And Organization, Introduction And Evolution Of Os, Introduction To Distributed Os, Real Time Systems And Multimedia Systems. Os Structures: Os Services, System Calls And Programs, Os Design And Implementation. Processes: Process Concept, Scheduling Policies, Algorithms, Multilevel Queuing, Operations On Process, Inter-Process Communication. Threads: Multithreading Models And Threading Issues. Cpu Scheduling: Criteria And Algorithms, Multiprocessor And Thread Scheduling.\n2. Process Synchronization: Critical Sections, Classical Two Process And N-Process Solutions, Hardware Primitives For Synchronization, Semaphores, Monitors, Classical Problems In Synchronization\n(Producer-Consumer, Readers-Writer, Dining Philosophers, Etc.). Deadlocks: Modeling, Resource Allocation, Characterization, Prevention And Avoidance, Detection And Recovery.\n3. Memory Management: Swapping, Contiguous Memory Allocation, Paging, Multilevel Paging, Segmentation, Demand Paging, Page Replacement Algorithms, Allocation Of Frames, Thrashing, Working Set Model. Input/Output: I/O System And Services, Device Controllers And Device Drivers, Disks, Scheduling Algorithms And Management.\n4. File System Interface: Access Methods, Access Control, Directory Structures, File Organization, File Sharing And Protection. System Performance, Protection And Security, Access Matrix, Security Breaches, Types Of Attacks, Attack Prevention Methods, Security Policy And Access Control, Os Design Considerations For Security, Access, Policy And Access Control, Os Design Considerations For Security, Access Control Lists And Os Support, Internet And General Network Security.\n\n",
  "course outcomes": "",
  "credits": "3",
  "books": "\n1. Douglas B. West, Introduction To Graph Theory, Phi.\n2. David Avis, Alain Hertz, Odile Marcotte (Eds.), Graph Theory And Combinatorial Optimization, Springer.\n3. Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest, Clifford Stein, Introduction To Algorithms, Phi.\n4. Sukumar Ghosh, Distributed Systems: An Algorithmic Approach, 2/Echapman & Hall/Crc.\n5. Kayhanerciyes, Distributed Graph Algorithms For Computer Networks, Springer. Yvonne-Anne Pignolet, Thomas Locher, Roger Wattenhofer, Principles Of Distributed\n6. Computing, Available Online.\n7. Herbert S. Wilf, Algorithms And Complexity, Available Online.\n8. Michel Raynal, Distributed Algorithms For Message-Passing Systems, Springer.\n9. Nancy Lynch, Distributed Algorithms, Morgan Kaufmann.\n10. Gerard Tel, Introduction To Distributed Algorithms, Cambridge Univ. Press\n\nCourse Outcome:\n1. Able To Apply Knowledge Of Discrete Mathematics To Model Computer Networks.\n2. Design Distributed Graph Algorithms For Complex Networks.\n3. Analyze The Performance Of Various Graph Algorithms And Evaluate The Scalability Of Solutions For Large And Heterogeneous Networks.\n4. Adapt Conventional Graph Algorithms To Ad Hoc Networks And Use Knowledge Of Mathematics To Sketch Proof\n5. Simulate The Algorithms In Wireless Environment.\n\nOpen Elective  I\n\n---"
}
{
  "course code": "Csoe40",
  "course title": "Database Systems",
  "prerequisites": "",
  "course type": "Oe",
  "course learning objectives": "\n1. To Understand Fundamentals Of Data Models And To Conceptualize A Database System For User Requirement.\n2. To Study The Fundamental Of Database Query Language, Like Sql And Relational Algebra.\n3. To Learn The Concept Of Normalization In Database Design.\n4. To Learn Fundamental Concepts Of Transaction Processing, Concurrency Control Techniques And Database Recovery Procedure.\n5. Understand The Professional, Ethical And Security Issues And Responsibilities In Database Design.\n8",
  "course content": "",
  "course outcomes": "\n1. At The End Of The Course Student Will Be Able To\n2. Understand Functions, Structures And History Of Operating Systems\n3. Able To Know The Design Issues Associated With Operating Systems\n4. Master Various Process Management Concepts Such As Scheduling, Synchronization, Multithreading And Deadlocks\n5. Understand The Various Concepts Associated With Memory Management Such As Virtual Memory, Demand Paging, Page Replacements Algorithms\n6. Be Familiar With Various Protection And Security Mechanisms\n\nOpen Electives  Ii And Iii\n\n---",
  "credits": "3",
  "books": "\n1. A. Silberschatz, Peter B. Galvin And G. Gagne, \"Operating System Concepts,\" (6 Or Newer Edition), Wiley.\n2. H. Brinch, \"Operating System Principles,\" Prentice Hall Of India.\n3. Dhamdhere, \"Systems Programming & Operating Systems,\" Tatamcgraw Hill.\n4. A. N. Habermann, \"Introduction To Operating System Design,\" Galgotia Publication, New Delhi.\n5. A.S. Tanenbaum, \"Modern Operating Systems,\" Prentice Hall Of India.\n"
}
{
  "course code": "Csoe42",
  "course title": "Soft Computing",
  "prerequisites": "",
  "course type": "Oe",
  "course learning objectives": "",
  "course content": "\n1. Introduction: Overview Of File Systems And Database Systems , Software Architecture Of A Typical Dbms, Data Models, Relational Data Model, Network Data Model, Hierarchical Data Model, Schemas And Instances, Database Administration And Control.\n2. Relational Model And Query Language: Overview Of Relational Database, Key Integrity Constraint, Relational Algebra, Relational Calculus: Domain Relational Calculus, Tuple Relational Calculus, Sql Fundamentals, Basic Operators, Missing Information, Null Values, Additional Operations, Advanced Sql Features, Embedded Sql, Dynamic Sql, Database Views.\n3. Database Design: Overview Of Normalization, Database Anomalies, Functional Dependencies, Candidate And Super Key, Non-Loss Decomposition, Dependency Preservation, Normal Forms: First, Second, Third Normal, Boyce Codd Normal Form, Multi-Valued Functional Dependencies And Fourth Normal Form, Join Dependencies And Fifth Normal Form, Denormalization.\n4. Transaction Processing: Overview Of Database Transactions, Transaction States, Transaction Recovery, Acid Properties, Transaction Recovery: Two Phase Commit, Commit Points, Serializability, Concurrency Control: Need For Concurrency, Locking Protocols: Binary Lock, Two Phase Lock, Deadlock, Starvation, Transaction Timestamp.\n",
  "course outcomes": "\n1. To Understand Fundamental Concepts, Principles And Applications Of Database System.\n2. To Demonstrate Database Related Programming Languages And Perform The Basics Of Commercial Relational Systems.\n3. To Apply The Concepts Of Normalization On Database Design.\n4. To Design And Implement A Small Database Project, Considering The Issues Like Concurrency Control, Recovery And Security.\n5. Comprehend Contemporary Issues Related To Industry And Government Related To Database Domain.\n\n\n---",
  "credits": "3",
  "books": "\n1. A Silberschatz, H.F. Korth & S. Sudarshan: Data Base System Concepts, Tmh, 1997.\n2. A.K. Majumdar And Bhattacharyya: Database Management Systems, Thm, 1996.\n3. C.J. Date: An Introduction To Database Systems 7Th Ed. Addison Wesley, Indian Edition, 2000.\n4. Elmasri & Navathe : Fundamentals Of Database Systems/Oracle 9I Programming 5Th Ed. Pearson, 2009\n"
}
{
  "course code": "",
  "course title": "",
  "prerequisites": "",
  "course type": "",
  "course learning objectives": "\n1. Motivation And Historical Background Of Soft Computing.\n2. Application Of Fuzzy Logic.\n3. Biologically Inspired Algorithm Such As Neural Networks, Genetic Algorithms, Ant Colony Optimization, And Bee Colony Optimization.\n4. Hybrid Systems Of Neural Network, Genetic Algorithms And Fuzzy Systems.\n\n",
  "course content": "\n1. Soft Computing And Artificial Intelligence: Introduction Of Soft Computing, Soft Computing Vs. Hard Computing, Various Types Of Soft Computing Techniques, Applications Of Soft Computing, Ai Search Algorithm, Predicate Calculus, Rules Of Interference, Semantic Networks, Frames, Objects, Hybrid Models. 8\n2. Artificial Neural Networks And Paradigms: Introduction To Neuron Model, Neural Network Architecture, Learning Rules, Perceptrons, Single Layer Perceptrons, Multilayer Perceptrons, Back Propagation Networks, Kohnen'Sself Organizing Networks, Hopfield Network, Applications Of Nn.\n3. Fuzzy Logic: Introduction, Fuzzy Sets And Fuzzy Reasoning, Basic Functions On Fuzzy Sets, Relations, Rule Based Models And Linguistic Variables, Fuzzy Controls, Fuzzy Decision Making, Applications Of Fuzzy Logic.\n4. Genetic Algorithms And Swarm Optimizations: Introduction, Genetic Algorithm, Fitness Computations, Cross Over, Mutation, Evolutionary Programming, Classifier Systems, Genetic Programming Parse Trees, Variants Of Ga, Applications, Ant Colony Optimization, Particle Swarm Optimization, Artificial Bee Colony Optimization.\n",
  "course outcomes": "\n1. Understand Various Biologically Inspired Algorithms.\n2. Apply Different Intelligent Algorithms In Classification, Prediction, Optimization, Pattern Recognition Applications.\n3. Design Hybrid System Incorporating Neural Network, Genetic Algorithms, Fuzzy Systems. 8\n",
  "credits": "0",
  "books": "\n1. Simon S. Haykin, Neural Networks, Prentice Hall, 2Nd Edition.\n2. B. Yegnanrayana , Artificial Neural Networks , Phi.\n3. Jacek M. Zurada, Introduction To Artificial Neural Systems, Jaico Publishing House,1994\n4. Zimmermann, Fuzzy Set Theory And Its Application, 3 Edition.\n5. Jang J.S.R., Sun C.T. And Mizutani E, \"Neuro-Fuzzy And Soft Computing\", Prentice Hall, 1998.\n6. Timothy J. Ross, \"Fuzzy Logic With Engineering Applications\", Mcgraw Hill, 1997.\n7. D.E. Goldberg, \"Genetic Algorithms: Search, Optimization And Machine Learning\", Addison Wesley, N.Y, 1989.\n"
}
