{
  "course code": "Ecir11",
  "course title": "Introduction To Electronics And Communication Engg.",
  "prerequisites": "",
  "course type": "Epr",
  "course learning objectives": "\nTo Learn Basic Concepts Of Various Active And Passive Components, Signals, Op-Amp And Their\nApplications, Digital Electronics And Their Applications And Fundamental Aspects Of Communication\nEngineering.\n",
  "course content": "\nUnit I\nOverview Of Electronic Components & Signals: Passive Active Components:\nResistances, Capacitors, Inductors, Diodes, Transistors, Fet, Mos And Cmos And Their\nApplications.\nSignals: Dc/Ac, Voltage/Current, Periodic/Non-Periodic Signals, Average, Rms, Peak Values,\nDifferent Types Of Signal Waveforms, Ideal/Non-Ideal Voltage/Current Sources,\nIndependent/Dependent Voltage Current Sources.\nUnit Ii\nOverview Of Analog Circuits: Operational Amplifiers-Ideal Op-Amp, Practical Op-\nAmp., Open Loop And Closed Loop Configurations, Application Of Op-Amp As Amplifier, Adder,\nDifferentiator And Integrator.\nUnit Iii\nOverview Of Digital Electronics: Introduction To Boolean Algebra, Electronic\nImplementation Of Boolean Operations, Gates-Functional Block Approach, Storage Elements-Flip\nFlops-A Functional Block Approach, Counters: Ripple, Up/Down And Decade, Introduction To\nDigital Ic Gates (Of Ttl Type).\n: 2\nUnit Iv\nOverview Of Communication Engineering: Overview Of Analog, Digital And Wireless\nCommunication, Need Of Modulation, Block Diagram Of A Communication System Brief Introduction\nOf Am, Fm, Pm, Pulse Modulation, Pam, Pwm, Ppm, Ask, Psk, And Fsk And Latest Trends In\nCommunication.\nNote: Mathematical Derivations Are Not Included In This Syllabus (Only Qualitative Discussion And\nDescription)\n\n",
  "course outcomes": "",
  "credits": "2",
  "reference books": "\n1. Electronic Devices And Circuits By S. Salivahanan, N. Suresh Kumar, A Vallavraj, Tata Mcgraw Hill 3Rd Ed\n2. Network Analysis By Van Valkenburg, Phi 3Rd Ed\n3. Malvino & Leach , Digital Electronics , Tata Mcgraw Hill. 3Rd Ed\n4. Electronic Communication Systems By G. Kennedy. 4Th Ed\n"
}
{
  "course code": "Ecpc10",
  "course title": "Introduction To Semiconductors",
  "prerequisites": "Ecir11",
  "course type": "Pc",
  "course learning objectives": "\nUnderstand Various Semiconductors, Their Characteristics And Carrier Transport Mechanism.\n",
  "course content": "\nUnit I\nReview Of Atomic Structure And Statistical Mechanics: - Ideas On Atomic Structure, Quantum\nMechanics, The Schrodinger Wave Equation, Statistical Mechanics, Bonding Of Atoms, Crystalline\nState, Energy Bands In Solids.\nElemental And Compound Semiconductors, Intrinsic And Extrinsic Semiconductors, Energy Band\nModel, Equilibrium Concentrations Of Electrons And Holes Inside The Energy Bands, Fermi Level And\nEnergy Distribution Of Carriers Inside The Bands, Heavily Doped Semiconductors.\nUnit Ii\nCarrier Transport In Semiconductors:  Drift And Diffusion Currents. The Hall Effect, Einstein\nRelations, Excess Carriers In Semiconductors, Generation And Recombination, Excess Carriers And\nQuasi-Fermi Levels, Basic Equations For Semiconductor Device Operation, Solution Of Carrier\nTransport Equation.\nUnit Iii\nP-N Junctions: - The Abrupt Junction (Electric Field, Potential, Capacitance), V-I Characteristic Of\nAn Ideal Diode, A Real Diode.\nIntroduction To Diode Family: - Zenner Diode, Tunnel Diode, Schottky Barrier Diode, P-I-N Diode,\nSolar Cell, Photo Diode, Light Emitting Diode, Laser, Hetero-Junctions.\nUnit Iv\nBipolar Junction Transistor: Structure, Principle Of Operation, Ideal Transistor, I-V Characteristics,\nIntroduction To Bjt As An Amplifier.\n\nJfet: Basic Structure, Operating Principle, I-V Characteristics.\nMosfet: Basic Structure, Enhancement & Depletion Type Mosfet, Condition Of Inversion, I-\nV Characteristics, C-V Characteristics.\n.",
  "course outcomes": "\nAt The End Of The Course, The Students Will Be Able To 1. Understand The Basic Circuit Elements 2. Understand Different Types Of Signal Waveforms. 3. Understand Logic Gates And Apply Them In Various Electronic Circuits. 4. Understand The Basic Concepts Of Op-Amps , And Their Applications. 5. Acquire Knowledge About Various Digital Modulation Techniques And Their Applications. 6. Acquire Knowledge About Various Analog Modulation Techniques And Their Applications.\n\n",
  "credits": "3",
  "reference books": "\n: %1. Tyagi M.S., Introduction To Semiconductor Materials And Devices, John\n: Wiley & Sons, %1993.                %2. Streetman B.G., Banerjee, S.K, Solid State Electronic Devices, Pearson\n: Education, 6Th Edition %2006.                %3. Sze S.M., Semiconductor Devices Physics And Technology John Wiley &\n: Sons, 2Nd Edition %2002.\n"
}
{
  "course code": "Ecpc11",
  "course title": "Circuit Theory",
  "prerequisites": "Mair11",
  "course type": "Pc",
  "course learning objectives": "\nThe Aim Of This Course Is To Make Student Competent In Analyzing Electrical Circuits, Apply\nKirchhoffs Current And Voltage Laws To Circuits In Order To Determine Voltage, Current And Power\nIn Branches Of Any Circuits Excited By Dc Voltages And Current Sources.",
  "course content": "\nUnit I\nBasic Circuits Analysis\nOhms Law  Kirchoffs Laws  Dc And Ac Circuits  Resistors In Series And Parallel Circuits\nMesh Current And Node Voltage Method Of Analysis For D.C And A.C. Circuits  Phasor Diagram\nPower, Power Factor And Energy. Initial Conditions.\n\n\nUnit Ii\nNetwork Reduction And Network Theorems For Dc And Ac\nCircuits\nNetwork Reduction: Voltage And Current Division, Source Transformation  Star Delta Conversion.\nTheorems: Thevenins And Nortons, Superposition, Maximum Power Transfer, Substitution, And\nReciprocity Theorems.\n\n\nUnit Iii\nResonance And Coupled Circuits\nSeries And Parallel Resonance  Their Frequency Response  Quality Factor And Bandwidth  Self\nAnd Mutual Inductance  Coefficient Of Coupling  Tuned Circuits  Single Tuned Circuits.\n: 7\nUnit Iv\nTransient Response For Dc Circuits\nTransient Response Of Rl, Rc And Rlc Circuits Using Laplace Transform For Dc Input And A.C.\nWith Sinusoidal Input.\n\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To 1) Understand Atomic Structure And Statistical Mechanics 2) Understand Various Semiconductors And Their Characteristics. 3) Apprehend Carrier Transport In Semiconductor. 4) Analyze Pn Junction Diode And Its Characteristics For Various Applications. 5) Understand Various Types Of Diode And Its Characteristics. 6) Analyze Characteristics Of Bjt, Jfet And Mosfet.\n\n",
  "credits": "4",
  "reference books": "\n1. William H. Hayt Jr, Jack E. Kemmerly And Steven M. Durbin, Engineering Circuits\nAnalysis, Tata Mcgraw Hill Publishers, 6 Th Edition, New Delhi, %2003. %2. Joseph A. Edminister, Mahmood Nahri, Electric Circuits, Schaums Series, Tata Mcgraw-\nHill, New Delhi, %2001. 4Th Ed\n\n"
}
{
  "course code": "Ecpc12",
  "course title": "Signals And Systems",
  "prerequisites": "Mair11",
  "course type": "Pc",
  "course learning objectives": "\nTo Understand Lti Systems, Analysis Of Periodic Signals, Analysis Of Aperiodic Signals, Laplace\nTransform.\n\n",
  "course content": "\nUnit I\nLti Systems: Continuous Time And Discrete Time Signals, Even And Odd Signals. Elementary\nContinuous Time And Discrete Time Signals. Classification Of Signals, Causality; Stability, Time\nInvariance, Linearity. Continuous Time And Discrete Time Lti Systems, Convolution Integral And\nConvolution Sum, Properties Of Lti Systems. Differential And Difference Equations. Singularity\nFunctions.\nUnit Ii\nAnalysis Of Periodic Signals: Fourier Series Representation Of Ctps, Convergence Of\nFs. Properties Of Ctfs. Fourier Series Representation Of Dtps. Properties Of Dtfs. Fourier\nSeries And Lti Systems. Filtering, Rc Low Pass And High Pass Filters. Recursive And Non Recursive\nDiscrete Time Filters.\nSampling Theorem, Sampling Of Continuous Time Signal With Impulse Train. Aliasing, Discrete-Time\nProcessing Of Continuous Time Signals.\nUnit Iii\nAnalysis Of Aperiodic Signals: Continuous Time Fourier Transform (Ctft),\nConvergence Of Ft. Properties Of Ctft. Discrete Time Fourier Transform (Dtft). Properties Of\nDtft. Systems Characterized By Linear Constant Co-Efficient Differential Equation And Difference\nEquations. Magnitude And Phase Spectrum, Group Delay.\n\nUnit Iv\nLaplace Transform: The Laplace Transform; Region Of Convergence For Laplace Transform,\nInverse Laplace Transform. Geometric Evaluation Of Fourier Transform From Pole Zero Plot, First\nOrder, Second Order And All Pass Systems. Properties Of Laplace Transform, Analysis And\nCharacterization Of Lti Systems Using The Laplace Transform. Causality, Stability, Differential\nEquations, Butterworth Filters. Unilateral Laplace Transform, Its Properties And Uses.\n",
  "course outcomes": "\nOn Completion Of This Course You Should Be Able To: %1. Apply Kcl And Kvl In Electrical Circuits To Calculate Currents, Voltages And Powers In\n: Typical Linear Electric Circuits %2. Apply Circuit Theorems 3.   Analyze Ac And Dc Circuits 4.   Reduce More Complicated Circuits Into The Thevenins And Nortons Equivalent Circuits. 5.   Describe Circuit Elements In Phasor Domain And Perform Steady-State Analysis Using\n: Phasors. %6. Analyze Resonance Circuits\n",
  "credits": "4",
  "reference books": "\n1. Oppenheim Willsky And Nawab, Signals And Systems, Phi. 4Th Ed\n2. Simon Haykin , Signals And Systems, John Wiley 4Th Ed\n3. Taub And Schilling, Principles Of Communication Systems, Tmh. 4Th Ed\n"
}
{
  "course code": "Ecpc30",
  "course title": "Electronic Devices And Circuits",
  "prerequisites": "Ecir11, Ecpc10",
  "course type": "Pc",
  "course learning objectives": "\nTo Enable The Students To Understand The Working Principle Of Diodes And Transistors For Circuit\nApplications.\n",
  "course content": "\nUnit I\nReview Of P-N Junctions: Abrupt And Linearly Graded Junctions. V-I Characteristic, C-V\nCharacteristic, Zener And Avalanche Breakdown. Diode Circuit Model.\nP-N Junction Applications: Rectifiers, Clipping And Clamping Circuits, Varactor, Varistor, Voltage\nRegulator, Demodulator, Solar Cells.\nUnit Ii\nBjt: Ideal And Real Transistor, I-V Characteristics, Small Signal Equivalent Circuits, High\nFrequency And Switching Transistors. Power Transistors. Bjt As An Amplifier  Biasing, Small\nSignal Analysis. Frequency Response. Bjt Equivalent Circuit Models- Dc Model, H-Parameter\nModel, Re-Model And Hybrid- Model.\nUnit Iii\nTheory Of Field Effect Transistors: Static Characteristics Of Jfets And Mosfets; Analysis Of Mos\nStructure, I-V And C-V Characteristics, Depletion Width, Threshold Voltage, Body Bias. Short\nChannel Effects: Ss, Dibl, Surface Mobility, Clm. Small Signal Model.\nSingle Stage Amplifiers, Load Line, Biasing, Frequency Response.\nUnit Iv\nJfet And Mosfet Single Stage Amplifiers: Biasing, Small Signal Analysis, Frequency Response.\nFeedback Amplifiers And Oscillators.\n",
  "course outcomes": "\n1. Utilize The Concepts Of Discrete Time And Continuous Time Signals And Their Transformations.\n2. Analyze The Fourier Series Of Periodic And Fourier Transform Of Non-Periodic Discrete Time And Continuous Time Signals.\n3. Understand And Apply The Concepts Of Bandwidth .\n4. Apply The Laplace Transform For Various Applications.\n5. Understand And Apply The Concepts Of Fourier Series.\n6. Understand And Apply The Concepts Of Fourier Transform.\n: 10\n\n",
  "credits": "4",
  "reference books": "\n%1. J. Millman And C. Halkias, Integrated Electronics, Mcgraw Hill, 2Nd Edition, 2009. 2.   Behzad Razavi, Design Of Analog Cmos Integrated Circuits, Mcgraw Hill, 2002. 3.   Tyagi M.S., Introduction To Semiconductor Materials And Devices, John Wiley & Sons,\n: %1993. 4.   Streetman B.G., Banerjee, S.K, Solid State Electronic Devices, Pearson Education, 6Th\n: Edition %2006. 5.   A. Sedra And C. Smith, Microelectronic Circuits: Theory And Applications, Oxford\n: University Press, 6Th Edition, %2013.\n"
}
{
  "course code": "Ecpc31",
  "course title": "Fields & Waves",
  "prerequisites": "Mair 11, Mair12",
  "course type": "Pc",
  "course learning objectives": "\n\nTo Understand The Electric And Magnetic Fields, Time Varying Fields And Maxwells Equations, The\nUniform Plane Wave, Transmission Lines And Waveguides.\n",
  "course content": "\nUnit I\nReview Of Electric And Magnetic Fields: Coulombs Law, Electric Field Intensity,\nField Due To A Continuous Volume Charge Distribution, Field Of A Line Charge, Field Of A Sheet Of\nCharge, Electric Flux Density, Gausss Law And Applications, Electric Potential, The Dipole, Current\nDensity, Continuity Of Current, Metallic Conductors, Conductor Properties And Boundary Conditions,\nThe Method Of Images, The Nature Of Dielectric Materials, Boundary Conditions For Perfect Dielectric\nMaterials, Capacitance Of Two Wire Line, Poissons And Laplaces Equations, Uniqueness Theorem.\nBiot-Savart Law, Amperes Law, Magnetic Vector Potentials, Force On A Moving Charge, Differential\nCurrent Element, Force And Torque On A Closed Circuit, The Boundary Conditions, The Magnetic Circuit,\nPotential Energy And Forces On Magnetic Materials.\n\n\nUnit Ii\nTime Varying Fields And Maxwells Equations: Faradays Law, Maxwells\nEquations In Point Form And Integral Form Maxwells Equations For Sinusoidal Variations, Retarded\nPotentials.\nUnit Iii\nThe Uniform Plane Wave: Wave Motion In Free Space And Perfect Dielectrics, Plane Waves\nIn Lossy Dielectrics, Poynting Vector And Power Considerations, Propagation In Good Conductors,\nSkin Effect, Reflection Of Uniform Plane Waves, Swr.\nUnit Iv\nTransmission Lines And Waveguides: The Transmission Line Equations, Graphical\nMethods, Smith Chart, Stub Matching, Time Domain And Frequency Domain Analysis. Te, Tm And\nTem Waves, Te And Tm Modes In Rectangular And Circular Wave Guides, Cut-Off And Guide\nWavelength, Wave Impedance And Characteristic Impedance, Dominant Modes, Power Flow In Wave\nGuides, Excitation Of Wave Guides, Dielectric Waveguides.\n\n",
  "course outcomes": "\n\nAt The End Of The Course Student Will Be Able To 1) Understand Working Principle Of P-N Junction Diode, Bjt, Jfet, Mosfet. 2) Understand The Short Channel Effects In Mos Devices. 3) Understand The Circuit Applications Of Bjt, Jfet, Mosfet. 4) Learn Small Signal Analysis Of Bjt And Mosfet. 5) Design Single Stage Amplifiers. 6) Design And Analyze Feedback And Oscillator Circuits.\n\n",
  "credits": "4",
  "reference books": "\n1. E. C. Jordan And K. G. Balmain, Electromagnetic Waves And Radiating Systems, Phi, 3Rd Ed..\n2. David & Chang, Field And Wave Electromagnetics, Addison Wesley, 3Rd Ed..\n3. W. H. Hayt, Engineering Electromagnetics, Jr. Tata Mc-Graw Hill Edition, Fifth Edition.\n\n"
}
{
  "course code": "Ecpc32",
  "course title": "Random Variables & Stochastic Processes",
  "prerequisites": "Mair11, Mair12",
  "course type": "Pc",
  "course learning objectives": "\nTo Understand Random Variables, Standard Distribution Functions Several Random Variables,\nRandom Processes.\n",
  "course content": "\nUnit I\nRandom Variables: Sample Space And Events, Probability, Conditional Probability,\nDefinition Of Random Variables, Cumulative Distribution Function, Probability Density Function,\nDiscrete Random Variables, Continuous Random Variables, Mathematical Expectation, Moments Of\nRandom Variables. Chebyshev Inequality.\nUnit Ii\nStandard Distribution Functions: Uniform, Triangular, Gaussian, Bernoulli,\nBinomial, Negative Binomial, Geometric, Poissoins, Exponential, Weibul, Gamma, Erlang,\nRayleigh, Rice, Lognormal, Chi Square And Other Useful Disribution Functions. Functions Of Random\nVariables.\nUnit Iii\nSeveral Random Variables: Joint Distribution Functions, Marginal And Conditional\nDistributions, Expectations, Joint Statistics, Conditional Statistics, Independence, Sum Of Random\nVariables, Central Limit Theorem, Functions Of Random Variables & Random Vectors, Joint Density\nFunction, Mean, Variance, Correlation, Covariance, Moments, Joint Moments, Characteristic\nFunctions, Convergence Of A Sequence Of Random Variables,\nUnit Iv\nRandom Processes: Definition And Description Of Random Processes, Classification Of\nRandom Processes, Statistical Characterization, Mean, Correlation And Covariance Functions,\n\nStationary Random Processes, Ergodicity, Power Spectral Density, Weiner-Khintchine Theorem,\nResponse Of Memory- Less And Linear Systems To Random Inputs, Discrete Time Stochastic Processes,\nCyclostationary Processes, Gaussian, Poisson, Markov Processes.\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Review The Basics Of Electromagnetic Theory Related To Static Electric And Magnetic Field Along With Basic Theorems, Boundary Conditions And Their Effects.\n2. Comprehend The Effects Of Sinusoidal Time Variation In Both Electric And Magnetic Fields Using Maxwell Equations And Retarded Potentials.\n3. Understand The Propagation Of Electromagnetic Waves Through Different Media Using The Concept Of Uniform Plane Waves, Their Reflection And Associated Measurements.\n4. Apply The Above Knowledge To Understand Working Of Transmission Lines And Waveguides Using Graphical Methods Like Smith Chart. Learn Various Types, Modes, Excitation, Power Flow And Characteristics Of Waveguides.\n5. Apply The Above Knowledge To Understand Working Of Waveguides Using Graphical Methods Like Smith Chart.\n6. To Learn Various Types, Modes, Excitation, Power Flow And Characteristics Of Waveguides.\n\n",
  "credits": "4",
  "reference books": "\n1. Papoulis, A. Probability, Random Variables And Stochastic Processes, Mgh, 3Rd Ed.\n2. Gray, R.M. Davission,L.D,Introduction To Statistical Signal Processing- Web Edition-1999.\n3. Sundarapandian, V. Probability, Statistics And Queueing Theory, Phi Learning Private\nLimited, 3Rd Ed.\n"
}
{
  "course code": "Ecpc33",
  "course title": "Measurement And Instrumentation",
  "prerequisites": "Ecpc11",
  "course type": "Pc",
  "course learning objectives": "\nTo Understand The Various Measurement Techniques, Basic Working Of Instruments Used For\nMeasurement And Errors In Measurements And Their Rectification.\n",
  "course content": "\nUnit I\n\nMeasurements And Errors: Principles Of Measurement, Accuracy, Precision, Types Of Errors,\nLimiting Errors, Bridge Measurements (Ac And Dc Bridges), Analysis Of Linear Systems, Time\nDomain Response, Pressure Gauge-Measurement Of Flow.\n\nUnit Ii\n\nElectromechanical & Digital Indicating Instruments: Pmmc Mechanism, Dc Ammeters And\nVoltmeters, Series And Shunt Type Ohmmeter, Alternating Current Indicating Instruments\n(Moving Iron Instruments, Electrodynamometer Instrument), D/A And A/D Converters Digital\nVoltmeters, Vector Voltmeter, Guarding Techniques, Automation In Voltmeter.\n\nUnit Iii\n\nSignal Generation And Analysis: Sine Wave Generator, Sweep Frequency Generator, Pulse And\nSquare Wave Generator, Function Generator Analyzer, Wave Analyzer, Distortion Analyzer,\nHarmonic Distortion Analyzer, Spectrum Analyzer, And Logic Analyzer.\n\nUnit Iv\n\nMeasurement Systems For Non-Electrical Quantities: Basics Of Telemetry; Different Types Of\nTransducers And Displays; Data Acquisition System Basics. Oscilloscopes And Recorders.",
  "course outcomes": "\n1. Understand The Basics Of Probability, Events, Sample Space And How To Use Them To Real Life Problems.\n2. Characterize Probability Models And Function Of Random Variables Based On Single & Multiples Random Variables.\n3. Evaluate And Apply Moments & Characteristic Functions And Understand The Concept Of Inequalities And Probabilistic Limits.\n4. Understanding Of Autocorrelation And Its Relation With Power Density Spectrum And Its Properties\n5. Understand The Concept Of Random Processes And Determine Covariance And Spectral Density Of Stationary Random Processes.\n6. Demonstrate The Specific Applications To Poisson And Gaussian Processes And Representation Of Low Pass And Band Pass Noise Models.\n",
  "credits": "3",
  "reference books": ""
}
{
  "course code": "Ecpc34",
  "course title": "Digital Design",
  "prerequisites": "Ecir11",
  "course type": "Pc",
  "course learning objectives": "\nTo Familiarize Students With The Importance Of Digital Logic Design And Develop The Understanding\nTowards The Need Of Digital Logics In Computers And Real World Applications.",
  "course content": "\nUnit I\nNumber Systems And Codes, Laws Of Boolean Algebra, Theorems Of Boolean Algebra, Switching\nFunctions, Realization Of Functions Using Logic Gates. Electronic Logic Gates, Positive And Negative\nLogic, Logic Families, Algebraic Methods, Canonical Forms Of Boolean Functions, Minimization Of\nFunctions Using Karnaugh Maps , Minimization Of Functions Using Quine-Mcclusky Method.\nUnit Ii\nCombinational Logic: Combinational Circuits, Analysis Procedure, Design Procedure, Binary Adder-\nSubtractor, Decimal Adder, Ripple Carry Adder And Carry Look Ahead Adder, Binary Multiplier,\nMagnitude Comparator, Decoders, Encoders, Multiplexers.\nUnit Iii\nSequential Circuit Elements: Latches Rs Latch And Jk Latch, Flip-Flops-Rs, Jk, T And D Flip Flops,\nMaster-Slave Flip Flops, Edge-Triggered Flip-Flops. Fsm  Moore Machine And Mealy Machine,\nFlip-Flops, Next State Equations, Next State Maps, State Table And State Transition Diagram, Design\nOf Sequential Circuits  State Transition Diagram, State Table, Next State Maps, Output Maps,\nExpressions For Flip-Flop Inputs And Expressions For Circuit Outputs.\nUnit Iv\nMoore And Mealy State Graphs For Sequence Detection, Methods For Reduction Of State Tables,\nMethods For State Assignment. Registers And Counters: Shift Registers, Ripple Counter, Synchronous\nCounter, Other Counters. Memory And Programmable Logic: Ram, Rom, Pla, Pal.\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To: %1. Understand The Fundamentals Of Electronic Instrumentation. 2. Measure Various Electrical Parameters With Accuracy, Precision, Resolution. 3. Use Ac And Dc Bridges For Relevant Parameter Measurement. 4. Select Appropriate Passive Or Active Transducers For Measurement Of Physical Phenomenon. 5. Use Signal Generator, Frequency Counter, Cro And Digital Ic Tester For Appropriate Measurement. 6. Ability To Measure Frequency, Phase With Oscilloscope\n",
  "credits": "4",
  "reference books": "\n%1. M. Morris Mano And M. D. Ciletti, Digital Design, 4Th Edition, Pearson Education. 2. Hill & Peterson, Switching Circuit & Logic Design, Wiley. 3. Mohammad A. Karim And Xinghao Chen, Digital Design-Basic Concepts And Principles, Crc Press Taylor & Francis Group, 2010. 4. C. H. Roth, Fundamental S Of Logic Design, Jaico Publishers, 1998. 5. V. P. Nelson, H.T. Nagle, E.D. Caroll And J.D. Irwin, Digital Logic Circuit Analysis And Design, Prentice Hall International, 1995.\n\n"
}
{
  "course code": "Ecpc35",
  "course title": "Communication Engineering",
  "prerequisites": "Ecir11, Ecpc12 And Ecpc32",
  "course type": "Pc",
  "course learning objectives": "\nTo Understand Modulation, Demodulation And Major Building Blocks Of Communication\nSystem. Also, Develop A Clear Insight Into The Input And Output Ac Signals At Various Stages\nOf A Transmitter And A Receiver Of Am & Fm Systems.\n",
  "course content": "\n\nUnit I\n\nAmplitude Modulation: Need For Modulation, Linear Modulation Schemes,\nFrequency Translation, Fdm, Modulation And Demodulation Of Dsbsc, Ssb And Vsb\nSignals.\nAngle Modulation: Basic Concepts, Phase Modulation, Frequency Modulation,\nSingle Tone Frequency Modulation, Spectrum Analysis Of Sinusoidal Fm Wave, Narrow\nBand Fm, Wide Band Fm, Transmission Bandwidth Of Fm Wave - Generation Of Fm\nWaves, Detection Of Fm , Balanced Frequency Discriminator, Zero Crossing Detector, Phase\nLocked Loop, Comparison Of Fm And Am.\n\nUnit Ii\n\nNoise: Resistive Noise Source (Thermal), Arbitrary Noise Sources, Effective Noise\nTemperature, Average Noise Figures, Average Noise Figure Of Cascaded Networks, Narrow\nBand Noise, Quadrature Representation Of Narrow Band Noise & Its Properties. Noise In\nAnalog Communication Systems: Noise In Dsbsc And Ssb Systems, Noise In Am\nSystem, Noise In Angle Modulation System, Threshold Effect In Angle Modulation\nSystem, Pre-Emphasis And De-Emphasis.\n\nUnit Iii\nReceivers: Types Of Radio Receiver, Tuned Radio Frequency Receiver, Super\nHeterodyne Receiver, Rf Section And Characteristics - Frequency Tuning And Tracking,\nIntermediate Frequency, Agc, Fm Receiver, Comparison With Am Receiver, Amplitude\nLimiting.\n\nUnit Iv\nPulse Modulation: Sampling Theorem, Sampling Process, Quantization Process, Quantization Noise, Types Of Pulse Modulation, Pam, Pwm, Ppm: Generation And Demodulation Of Pulse Modulated Signals, Time Division Multiplexing. Pcm,  Law And A- Law Compressors. Line Codes, Noise In Pcm, Dpcm, Dm, Delta Sigma Modulator, Adm.\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To %1. Understand The Number Systems And Laws Of Boolean Algebra. 2. Learn The Minimization Of Functions Using Karnaugh Maps And Quine-Mcclusky Method. 3. Understand The Basics Of Digital Design. 4. Design The Hardware Of Various Arithmetic Logics. 5. Design The Hardware Using Sequential Circuit Elements 6. Design Various Digital Machines/Circuitsto Address The Need Of Real World.\n\n",
  "credits": "4",
  "reference books": "\n1. Simon Haykins , Communication Systems , Wiley & Sons , 4Th Edition.\n2. Taub & Schilling, Principles Of Communication Systems, Tmh.\n3. B.P. Lathi , Modern Digital And Analog Communications, Oxford.\n4. George Kennedy And Bernard Davis ,Electronics & Communication Systems.\n"
}
{
  "course code": "Ecpc40",
  "course title": "Analog Electronics",
  "prerequisites": "Ecpc30",
  "course type": "Pc",
  "course learning objectives": "\nTo Enable The Students To Design Multistage Amplifiers, Oscillators And Op-Amp Based Linear And Non-Linear Circuits.\n\n",
  "course content": "\n\nUnit I\nAnalysis And Design Of Single Stage Rc- Coupled Amplifier, Classification Of Amplifiers,\nDirect Coupled Amplifiers, Multistage Amplifiers, Frequency Response Of Amplifiers.\n\nUnit Ii\nCurrent Mirrors, Differential Amplifiers (Balanced And Unbalanced Output), Frequency\nResponse. Introduction To Op-Amp.\n\nUnit Iii\nOp-Amp With Negatives Feedback And Frequency Response (Open Loop And Closed Loop)\nCompensating Network, Circuit Stability, Slew Rate. Operational Transconductance\nAmplifier.\n\nUnit Iv\nApplications: Dc, Ac Amplifiers, Peaking Amplifier, Summing, Sealing, Averaging And\nInstrumentation Amplifier, Differential Input Output Amplifier, V-I And I-V Converter,\nIntegration And Differential Circuit, Wave Shaping Circuit, Active Filters, Oscillators.\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Understand Effect Of Noise On Analog Communication Systems.\n2. Analyze Energy And Power Spectral Density Of The Signal.\n3. Evaluate Analog Modulated Waveform In Time /Frequency Domain.\n4. Analyze Different Characteristics Of Receiver.\n5. Generate Pulse Modulated Signals\n6. Draw The Block Diagram Of Am And Fm Receiver.\n\n",
  "credits": "4",
  "reference books": "\n1. A. Sedra And C. Smith, Microelectronic Circuits: Theory And Applications, Oxford University Press, 6Th Edition, 2013.\n2. J. Millman And C. Halkias, Integrated Electronics, Mcgraw Hill, 2Nd Edition, 2009.\n3. Behzadrazavi, Design Of Analog Cmos Integrated Circuits, Mcgraw Hill, 2002.\n4. R. A. Gayakwaed, Op-Amps And Linear Integrated Circuits, Prentice Hall India Learning Private Limited, 4Th Edition 2002.\n5. K. R. Botkar, Integrated Circuits, Khanna Publishers, 2004.\n"
}
{
  "course code": "Ecpc42",
  "course title": "Microprocessor And Microcontroller",
  "prerequisites": "Ecpc34",
  "course type": "Pc",
  "course learning objectives": "\nTo Learn Importance Of Microprocessors And Microcontrollers, Understand Architecture And\nProgramming Of 8086 Processors, Interfacing Techniques Like Memory And I/O Interfacing\nWith Microprocessor And Microcontroller.\n",
  "course content": "\n\nUnit I\nIntroduction To Microprocessor And Microcontroller: Evolution\nOf Microprocessors, Technological Trends In Microprocessor Development, The Intel Family\nTree, Applications Of Microprocessors.\n\nIntroduction To 16-Bit Microprocessor Architecture:\n: 8086 Block Diagram; Description Of Data Registers, Address Registers; Pointer And Index\nRegisters, Psw, Queue, Biu And Eu, 8086 Pin Diagram Descriptions. Microprocessor Bus\nTypes And Buffering Techniques, 8086 Minimum Mode And Maximum Mode Cpu Module.\n8086 Cpu Read/Write Timing Diagrams In Minimum Mode And Maximum Mode.\n\nUnit Ii\n8086 Instruction Set: Instruction Formats, Addressing Modes, Data Transfer\nInstructions, String Instructions, Logical Instructions, Arithmetic Instructions, Transfer Of\nControl Instructions; Process Control Instructions; Assembler Directives, Writing Assembly\nLanguage Programs For Logical Processing, Arithmetic Processing, Timing Delays; Loops,\nData Conversions, Writing Procedures; Data Tables, Modular Programming, Macros.\n\n\nUnit Iii\nInterfacing And Programmable Devices: Basic Interfacing Concepts And\nAddress Decoding Techniques., Interfacing Output Displays, Memory, D/A & A/D\nConverters, Programmable Interval Timer, Programmable Peripheral Interface %8255.\n: 27\nInterrupts And Dma: Interrupt Driven I/O. 8086 Interrupt Mechanism; Interrupt\nTypes And Interrupt Vector Table, Programmable Interrupt Controller 8259, Programmable\nDma Controller %8237.\nUnit Iv\nIntroduction To Micro Controllers (8051): Micro Controllers & Embedded\nProcessors, Overview Of 8051 Family, Instruction Set, Introduction To 8051 Assembly\nLanguage Programming, Program Counter, Data Types & Directives, Flag, Registers, Stack,\nHardware Description, I/O Port Programming, Timer And Counter Programming, Serial\nCommunication, Interrupt Programming, Interfacing, 16 & 32 Bit Micro Controllers, Pic\nAnd Arm Controllers\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Design Single And Multistage Amplifiers.\n2. Understand The Kay Issues In The Designing Of Differential Amplifiers.\n3. Understand The Design Of Current Mirrors\n4. Understand The Terminal Characteristics Of Op-Amps And Design /Analyze\n: Fundamental Circuits Based On Op-Amps.\n5. Understand The Use Of Op-Amps In Different Types Of Applications.\n6. Design Integration, Differential Circuit And Wave Shaping Circuits.\n\n",
  "credits": "3",
  "reference books": "\n1. D.V.Hall , Microprocessors And Interfacing , Mcgraw Hill 2Nd Ed.\n2. M A Mazidi, J G Mazidi, R D Mc Kinlay The 8051 Micro Controllers & Embedded Systems, 2Nd Indian Reprint, Pearson Education, (2002).\n3. J Uffenbeck , The 8086/8088 Family, (Phi).\n4. Liu,Gibson , Microcomputer Systems  The 8086/8088 Family, (2Nd Ed-Phi).\n5. Kenneth J, Ayala, 8051 Microcontroller: Architecture, Programming And Application, 2Nd Edition, Delmar Learning.\n6. John Morton The Pic Microcontroller: Your Personal Introductory Course, Newnes (An Imprint Of Butterworth-Heinemann Ltd); 3Rd Revised Edition (2005).\n"
}
{
  "course code": "Ecpc43",
  "course title": "Control System Engineering",
  "prerequisites": "Mair-11, Mair-12",
  "course type": "Pc Course Learning Objectives",
  "course learning objectives": "\nTo Understand The Control System And Components, Time Response Analysis, Stability, The\nRoot Locus Technique, Frequency Response Analysis, Stability In Frequency Domain, State\nVariable Analysis.\n",
  "course content": "\n\nUnit I\nIntroduction: The Control System, Historical Development Of Automatic Control\nSystem, Mathematical Models Of Physical Systems, Differential Equation Of Physical\nSystems, Transfer Function, Block Diagram Algebra, Signal Flow-Graphs, Feedback\nCharacteristics Of Control Systems, Feedback And Non-Feedback Systems, Reduction Of\nParameter Variations By Use Of Feedback, Control Over System Dynamics By Use Of Feedback,\nControl Of The Effect Of Disturbance Signal By Use Of Feedback.\n\nUnit Ii\nControl System And Components: Linear Approximation Of Non-Linear\nSystems, Electrical Systems, Stepper Motor.\nTime Response Analysis: Standard Test Signals, Time Response Of First Order And\nSecond Order Systems, Steady-State Errors And Error Constants, Design Specification Of\nSecond-Order-Systems.\nStability: The Concept Of Stability Necessary Conditions For Stability, Hurwitz Stability\nCriterion, Routh Stability Criterion, Relative Stability Analysis.\nThe Root Locus Technique:The Root Locus Concept, Construction Of Root Loci, Root\nContours.\n\nUnit Iii\nFrequency Response Analysis: Correlation Between Time And Frequency\nResponse, Polar Plots, Bode Plots, Experimental Determination Of Transfer Function.\n: 29\nStability In Frequency Domain: Nyquist Stability Criterion, Relative Stability\nUsing Nyquist Criterion, Closed-Loop Frequency Response.\n\nUnit Iv\nIntroduction To Design: Considerations Of Classical Design, Realization Of Basic\nCompensators, Cascade Compensation In Time Domain, Cascade Compensation In Frequency\nDomain, Feedback Compensation.\nState Variable Analysis: Concept Of State,State Variable And State Model, State\nModels For Linear Continuous Time Systems, Diagonalization Solution Of State Equations,\nConcept Of Controllability And Observability, Pole Placement By State Feedback.\n",
  "course outcomes": "\nAt The End Of The Course, The Student Will Be Able To:\n1. Develop The Basic Understanding Of 16-Bit Microprocessor Architecture.\n2. Program A Microprocessor System Using Assembly Language.\n3. Understand And Capable Of Interfacing The Microprocessor To The I/O Devices.\n4. Develop Simple Applications On Microprocessor And Microcontroller -Based Systems.\n5: Interpret Specifications For Any Microprocessor Or Peripheral Chip.\n6: Use Compilers And Assemblers From Open Source, Third Party, And Microprocessor/ Microcontroller Providers\n\n",
  "credits": "4",
  "reference books": "\n1. I.J.Nagrath And M.Gopal, Control Systems Engineering.\n2. B.C.Kuo, Automatic Control Systems.\n"
}
{
  "course code": "Ecpe40",
  "course title": "Object Oriented Programming",
  "prerequisites": "Csir11",
  "course type": "Pe",
  "course learning objectives": "\nTo Learn Object-Oriented Programming And Utilize It In Practical Applications By\nDemonstrating Adeptness Of Object Oriented Programming In Developing Solution To\nProblems Demonstrating Usage Of Data Abstraction, Encapsulation, Features Of Exception\nHandling, Dynamic Binding And Utilization Of Polymorphism, And Applets.\n",
  "course content": "\n\nUnit I\nIntroduction: Object-Oriented Paradigm, Features Of Object Oriented\nProgramming In C++, Fundamentals Of Data Types, Operators And Expressions, Control\nFlow, Arrays, Strings, Pointers And Functions.\n\nUnit Ii\nProgramming In C++: Classes And Objects, Constructors And Destructors, Operator\nOverloading, Inheritance, Virtual Functions And Polymorphism, And Exception Handling.\n\nUnit Iii\nJava Introduction: An Overview Of Java, Data Types, Variables And Arrays,\nOperators, Control Statements, Classes, Objects, Methods    Inheritance. Java\nProgramming: Packages, Abstract Classes, Interfaces And Inner Classes, Exception\nHandling.\n\nUnit Iv\nMultithreading: Introduction To Threads, Multithreading, String Handling,\nStreams And I/O, And Applets.\n",
  "course outcomes": "\n: 30\n: Object Oriented Programming\n\n",
  "credits": "",
  "reference books": "\n1. Lafore R., Object Oriented Programming In C++, Waite Group.\n2. E. Balagurusamy, Object Oriented Programming With C++, Tata Mcgraw Hill.\n3. Deitel And Deitel, C++ How To Program, Sixth Edition, Prentice Hall, 2007.\n\n: 31\n4. Herbert Schildt, Java The Complete Reference, Eighth Edition, Mcgraw Hill\nProfessional, %2011. %5. Herbert Schildt, The Complete Reference To C++ Language, Mcgraw Hill-Osborne.\n"
}
{
  "course code": "Ecpe41",
  "course title": "Network Analysis And Synthesis",
  "prerequisites": "Ecpc11, Mair-%11. Mair-12",
  "course type": "Pe",
  "course learning objectives": "\n: To Make The Students Proficient In Analyzing And Synthesizing An Electrical Network\nFrom A Given Impedance/Admittance Function.\n",
  "course content": "\n\nUnit I\nNetwork Theorems: Superposition Theorem, Thevenins Theorem, Nortons Theorem,\nNortons Theorem, Maximum Power Transfer Theorem, Reciprocity Theorem, Millmans\nTheorem, Compensation Theorem, Tellegens Theorem. Network Solution Methods: Nodal\nAnd Mesh Analysis.\n\nUnit Ii\nTransient Circuit Analysis: Steady State Sinusoidal Analysis Using Phasors; Time Domain\nAnalysis Of Simple Linear Circuits; Solution Of Network Equations Using Laplace Transform;\nFrequency Domain Analysis Of Rlc Circuits.\n\nUnit Iii\nLinear 2Port Network Parameters: Driving Point And Transfer Functions, State Equations\nFor Networks, Characterization Of Lti 2-Port Networks: Z, Y, Abcd, Abcd, G And H\nParameters, Reciprocity And Symmetry. Graph Theory: Tree, Co Tree, Link, Basic Loop And\nBasic Cut Set, Incidence Matrix, Cut Set Matrix, Tie Set Matrix, Duality, Loop And Nodal\nMethods Of Analysis.\n\nUnit Iv\nNetwork Synthesis: Properties Of Hurwitz Polynomial And Positive Real Function, One\nTerminal Pair Network Driving Point Synthesis With Lc Elements, Rc Elements, Rl\nElements, Foster And Cauer Form.\n: 33",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Understand The Concepts Of The Object Oriented Programming.\n2. Comprehend The Adeptness Of Object Oriented Programming In Developing Solution To Problems Demonstrating Usage Of Data Abstraction, Encapsulation And Inheritance.\n3. Implement Patterns Involving Dynamic Binding And Utilization Of Polymorphism.\n4. Understand Syntax And Features Of Exception Handling.\n5. Implement Solution To Various I/O Manipulation Operations\n6. Create Two-Dimensional Graphic Components Using Applets .\n: 32\n: Network Analysis And Synthesis\n\n",
  "credits": "",
  "reference books": "\n\n"
}
{
  "course code": "Ecpe42",
  "course title": "Computer",
  "prerequisites": "",
  "course type": "Pe",
  "course learning objectives": "\nThe Objective Of This Course Is To Provide Students With The Basic Concepts And Principles In\nComputer Architecture So That Students Have In-Depth Understanding Of Computer System\nDesigns.\n\nUnit I\nIntroduction To Computer Hardware And Software: Functional\nUnits, Historical Perspective, Performance Of Computer, Register Transfer And Micro-\nOperations, Information Representation, Instruction Format, Instruction Types, Addressing\nModes, Instruction Set Architectures- Cisc And Risc, Super-Scaler Architecture, Fixed\nPoint And Floating Point Operations.\n\nUnit Ii\nBasic Processing Unit: Fundamental Concepts, Alu, Control Unit, Multiple Bus\nOrganization, Hardwired Control, Micro Programmed Control, Pipelining, Data Hazards,\nInstruction Hazards, Influence On Instruction Sets, Data Path And Control Considerations,\nPerformance Considerations.\n\nUnit Iii\nMemory Organization: Basic Concepts, Semiconductor Ram Memories, Read-\nOnly Memories, Speed, Size And Cost, Cache Memories, Performance Considerations,\nCache Coherency In Multiprocessor, Virtual Memories, Memory Management\nRequirements, Secondary Storage Devices.\n\nUnit Iv\nI/O Organization: Accessing I/O Devices, Programmed I/O, Interrupt-Driven I/O,\nDirect Memory Access, Buses, Interface Circuits: Serial Port, Parallel Port, Pci Bus, Scsi\nBus, Usb, The External Interface-Firewire And Infiniband.",
  "course content": "",
  "course outcomes": "\n: At The End Of The Course Student Will Be Able To: %1. Apply The Knowledge Of Basic Circuit Law And Simplify The Network Using Reduction\n: Techniques. %2. Understand The Basics Single & Two-Port Networks And Their Different Parameters. 3.   Classify Various Functions Like Transfer Functions, Driving Point Functions And Synthesis Of\n: Different Network Functions. %4. Familiarize With Different Network Topologies, Graph Metrics And Analysis Of Network\n: Using Graph Theory. %5. Apply Various Theorems For Circuit Solving. 6.   Analyze Transient Circuit.\n: 34\n: Computer Architecture\n\n",
  "credits": "3",
  "reference books": "\n1. C.Hamacher Z. Vranesic And S. Zaky, Computer Organization, Mcgraw-Hill, 5Th Ed., 2002.\n2. W. Stallings, Computer Organization And Architecture - Designing For Performance, Pearson, 7Th Ed.,2006.\n3. M.M. Mano, Computer System Architecture, Phi.\n4. J.P.Hayes, Computer Architecture And Organization, Mcgraw-Hill.\n"
}
{
  "course code": "Ecpe43",
  "course title": "Digital Design Using Verilog",
  "prerequisites": "Ecpc34",
  "course type": "Pe Course Learning Objectives",
  "course learning objectives": "\nThis Course Aims To Provide Students With The Understanding Of The Different Technologies\nRelated To Hdls, Construct, Compile And Execute Verilog Hdl Programs Using Provided\nSoftware Tools. Design Digital Components And Circuits That Are Testable, Reusable, And\nSynthesizable.Students Are Provided With Access To The Cad Tools To Use Hardware\nDescription Language To Model, Analyze And Design Various Digital Circuits/Systems.\n",
  "course content": "\n\nUnit I\nIntroduction To Logic Design With Verilog Hdl: Evolution Of Cad,\nEmergence Of Hdls, Typical Hdl-Based Design Flow, Why Verilog Hdl?, Trends In Hdls.\nEvolution Of Cad, Emergence Of Hdls, Typical Hdl-Based Design Flow, Why Verilog\nHdl?,\nLanguage Constructs And Conventions: Lexical Conventions, Data Types,\nSystem Tasks, Compiler Directives. Module Definition, Port Declaration, Connecting Ports,\nHierarchical Name Referencing.\n\nUnit Ii\nGate Level Modeling: And Gate Primitive, Module Structure, Tri-State Gates,\nArray Of Instances Of Primitives, Design Of Flip-Flops With Gate Primitives, Delays,\nStrengths And Construction Resolution, Net Types, Design Of Basic Circuits.\nDataflow Modeling: Continuous Assignment Structure, Delays And Continuous\nAssignments, Operators, Operands, Operator Types.\n\nUnit Iii\nBehavioral Modeling: Structured Procedures, Initial And Always, Blocking And\nNonblocking Statements, Delay Control, Generate Statement, Event Control, Conditional\nStatements, Multiway Branching, Loops, Sequential And Parallel Blocks, Differences Between\nTasks And Functions, Declaration, Invocation, Automatic Tasks And Functions.\n\n: 37\nVerilog For Finite State Machines: System Design Using Asm Chart, Design\nAnd Synthesis Of Datapath Controllers. Clocked Sequential Finite State Machines,\nAsynchronous Sequential Finite State Machines, Sequential Design Using Lsi & Msi\nCircuits.\n\nUnit Iv\nAdvanced Verilog Topics: Switch Level Modeling, User-Defined Primitives,\nProgramming Language Interface, Advanced Verification Techniques.\n",
  "course outcomes": "\n1. Comprehend The Basic Knowledge Of Functional Components Of Computer System.\n2. Provide An Overview Of Computer System Software And Understand Basic Aspects Of Performance Evaluation.\n3. Analyze Concept Of Various Addressing Modes Including Design Instruction Set Architecture.\n4. Identify The Function Of Building Blocks Within Cpu Of A Computer System.\n5. Explain Memory System Design Including Cache And Virtual-Memory Systems.\n6. Familiarize With The Basic Knowledge Of I/O Devices And Interface Circuits.\n: 36\n: Digital Design Using Verilog\n\n",
  "credits": "",
  "reference books": "\n1. Verilog Hdl - Samir Palnitkar, 2Nd Edition, Pearson Education, 2009.\n2. T.R. Padmanabhan, B Bala Tripura Sundari, Design Through Verilog Hdl, Wiley 2009.\n3. Fundamentals Of Digital Logic With Verilog Design - Stephen Brown, Zvonkoc Vranesic, Tmh, 2Nd Edition.\n4. Advanced Digital Design With Verilog Hdl - Michel D. Ciletti, Phi,2009.\n5. Digital Design, 2/E, Frank Vahid, Wiley, 2011\n"
}
{
  "course code": "Ecpc50",
  "course title": "Information Theory And Coding",
  "prerequisites": "Ecpc12, Ecpc35",
  "course type": "Pc",
  "course learning objectives": "\nTo Understand Elements Of Information Theory And Source Coding, Linear Block\nCodes, Cyclic Codes, Convolutional Codes\n",
  "course content": "\n\nUnit I\nElements Of Information Theory And Source Coding:\nIntroduction, Information As A Measure Of Uncertainty, Entropy & Its Properties,\nEntropy Of Continuous Sources, Discrete Memoryless Channels, Mutual Information\n& Its Properties, Bsc, Bec. Channel Capacity, Shanons Theorem On Coding For\nMemoryless Noisy Channels, Shanons Three Fundamental Theorems.\nSeparable Binary Codes, Shanonfano Encoding, Noiseless Coding, Theorem Of\nDecodability, Average Length Of Encoded Message, Shanons Binary Encoding,\nFundamental Theorem Of Discrete Noiseless Coding, Huffmans Minimum\nRedundancy Codes, Capacity Of Colored Noise Source, Water Filling Algorithms.\n\nUnit Ii\nLinear Block Codes: Groups & Fields, Galois Fields & Its Construction,\nMinimal Polynomial, Vector Spaces, Dual Spaces, Linear Block Codes, Syndrome\n& Error Detections, Minimum Distance, Error Detecting And Correcting Capabilities\nOf A Block Code, Standard Array & Syndrome Decoding, Hamming Code.\n\nUnit Iii\nCyclic Codes: Description Of Cyclic Codes, Polynomial Representation,\nMinimum Degree Code Polynomial, Generator Polynomial, Generator Matrix,\nSystematic Form, Parity Check Matrices, Cyclic Codes Encoders, Syndrome\nComputation And Error Detection, Cyclic Hamming Codes, Decoding Of Cyclic Codes.\n\nUnit Iv\nConvolutional Codes: Encoding Of Convolution Codes, Structural\nProperties Of Convolution Codes, State Diagram, Code Tree, Trellis Diagram, Free\nDistance, Coding Gain, Viterbi Decoding, Distance Properties Of Binary\nConvolutional Codes, Burst Error Correcting Convolutional Codes.\n: 40",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Understand Various Programmable Logic Devices And Eda Tools.\n2. Analyze Various Modeling Styles In Verilog Hdl And To Design Digital Systems.\n3. Write Register Transfer Level (Rtl) Models Of Digital Circuits.\n4. Understand Advanced Topic, Testing Strategies And Construct Test-Benches In Verilog.\n5. Design Combinational Logic Circuits Using Vhdl.\n6. Design Sequential Logic Circuits Using Vhdl.\n: 38\nB.Tech 5Th Semester\n: 39\nInformation Theory And Coding",
  "credits": "",
  "reference books": "\n2. Das, Mullick And Chatterjee, Digital Communication, Wiley Eastern Ltd, 3Rd Ed..\n3. Shu Lin And J. Costello, Error Control Coding, Prentice Hall, 3Rd Ed..\n"
}
{
  "course code": "Ecpc51",
  "course title": "Antenna And Wave Propagation",
  "prerequisites": "Ecpc31",
  "course type": "Pc",
  "course learning objectives": "\nBy The End Of This Course The Student Should Be Able To Describe The Evolution And Basics Of Antenna\nAnd Wave Propagation Technology. Student Should Be Able To Identify Antenna Parameters Of Linear\nWire Antennas, Aperture Type Antennas, Antenna Arrays, Narrowband, Broadband And Frequency\nIndependent Antennas\n",
  "course content": "\nUnit I\n\nBasic Principles And Definitions: Retarded Vector And Scalar Potentials. Radiation\nAnd Induction Fields, Radiation From Elementary Dipole (Hertzian Dipole, Short Dipole, Linear\nCurrent Distribution), Half Wave Dipole, Antenna Parameters : Radiation Resistance, Radiation\nPattern, Beam Width, Gain, Directivity, Effective Height, Effective Aperture, Polarization,\nBandwidth And Antenna Temperature.\n\nUnit Ii\nRadiating Wire Structures And Antenna Arrays: Folded Dipole, Monopole,\nBiconical Antenna, Loop Antenna, Helical Antenna. Principle Of Pattern Multiplication,\nBroadside Arrays, Endfire Arrays, Array Pattern Synthesis, Uniform Array, Binomial Array,\nChebyshev Array, Antennas For Receiving And Transmitting Tv Signals E.G. Yagi-Uda And\nTurnstile Antennas. Printed Antennas.\n\nUnit Iii\nAperture Type Antennas: Radiation From Rectangular Aperture, E-Plane Horns, H-Plane\nHorns, Pyramidal Horn, Lens Antenna, Reflector Antennas And Slot Antennas.\nBroadband And Frequency Independent Antennas: Broadband Antennas. The\nFrequency Independent Concept: Rumseys Principle, Frequency Independent Planar Log Spiral\nAntenna, Frequency Independent Conical Spiral Antenna And Log Periodic Antenna.\n: 42\nUnit Iv\nPropagation Of Radio Waves : Different Modes Of Propagation, Ground Waves, Space\nWaves, Surface Waves And Tropospheric Waves, Ionosphere, Wave Propagation In The Ionosphere,\nCritical Frequency, Maximum Usable Frequency (Muf), Skip Distance, Virtual Height, Radio\nNoise Of Terrestrial And Extra Terrestrial Origin. Multipath Fading Of Radio Waves.\n",
  "course outcomes": "\n: 41\n: Antenna And Wave Propagation\n\n",
  "credits": "4",
  "reference books": "\n"
}
{
  "course code": "Ecpc52",
  "course title": "Digital Signal Processing",
  "prerequisites": "Ecpc12",
  "course type": "Pc",
  "course learning objectives": "\nTo Understand Discrete Transforms, Implementation Of Discrete Time Systems,\nDesign Of Fir Filters, Design Of Iir Filters.\n",
  "course content": "\n\nUnit I\nDiscrete Transforms: Z- Transform And Its Properties, Poles And Zeros,\nInversion Of Z-Transform, One Sided Z-Transform And Solution Of Differential\nEquations. Analysis Of Lti Systems In Z-Domain, Causality, Stability, Relationship\nBetween Z-Transform And Fourier Transform. Frequency Selective Filters; All Pass\nFilters, Minimum-Phase, Maximum-Phase And Mixed-Phase Systems.\nFrequency Domain Sampling And Dft; Properties Of Dft, Linear Filtering Using\nDft, Frequency Analysis Of Signals Using Dft, Radix 2 & Radix-4 Fft Algorithms,\nGoertzel Algorithm, Applications Of Fft Algorithm, Computation Of Dft Of Real\nSequences.\n\nUnit Ii\nImplementation Of Discrete Time Systems: Direct Form,\nCascade Form, Frequency Sampling And Lattice Structures For Fir Systems. Direct\nForms, Transposed Form, Cascade Form Parallel Form. Lattice And Lattice Ladder\nStructures For Iir Systems. State Space Structures.\n\nUnit Iii\nDesign Of Fir Filters: Characteristics Of Practical Frequency Selective\nFilters. Filters Design Specifications Peak Pass Band Ripple, Minimum Stop Band\nAttenuation. Four Types Of Fir Filters Design Of Fir Filters Using Windows. Kaiser\nWindow Method Comparison Of Design Methods For Fir Filters Gibbs Phenomenon,\nDesign Of Fir Filters By Frequency Sampling Method, Design Of Optimum Equiripple\nFir Filters, Alternation Theorem.\n\nUnit Iv\nDesign Of Iir Filters: Design Of Iir Filters From Analog Filters, Design By\nApproximation Of Derivatives, Impulse Invariance Method Bilinear Transformation\nMethod Characteristics Of Butterworth, Chebyshev, And Elliptical Analog Filters And\nDesign Of Iir Filters, Frequency Transformation.\n\n: 44",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To %1. Develop An Understanding Of The Design Features Of Various Antenna Types And Their Families 2. Understand The Fundamentals And Modes Of Wave Propagation 3. Differentiate And Deploy Broadband And Narrowband Antennas With Characteristic Radiation Patterns. 4. Use Mathematical Analysis And Tools To Simulate Antenna Signals For Transmission And Reception. 5. Quantify The Fields Radiated By Various Types Of Antenna. 6. Plot The Characteristics Of Wire And Aperture Antennas.\n: 43\n: Digital Signal Processing\n\n",
  "credits": "4",
  "reference books": "\n"
}
{
  "course code": "Ecpc53",
  "course title": "Digital Communication",
  "prerequisites": "Ecpc32",
  "course type": "Pc",
  "course learning objectives": "",
  "course content": "",
  "course outcomes": "\n: 45\n: Digital Communication\n\n",
  "credits": "4",
  "reference books": "\n1. Simon Haykins , Communication Systems , Wiley & Sons , 4Th Edition.\n2. Taub & Schilling, Principles Of Communication Systems, Tmh.\n3. B.P. Lathi , Modern Digital And Analog Communications, Oxford.\n4. Proakis, Digital Communication .\n\n"
}
{
  "course code": "Ecpe50",
  "course title": "Data Structure",
  "prerequisites": "Csir11, Ecpe40",
  "course type": "Pe",
  "course learning objectives": "\nTo Learn The Efficient Storage Mechanisms Of Data For An Easy Access And Implementation Of Various\nBasic And Advanced Data Structures. Also, Understand The Various Techniques For Representation Of\nThe Data In The Real World With The Concepts Of Protection And Management Of Data.\n",
  "course content": "\nUnit I\nIntroduction: Understanding Pointers, Usage Of Pointers, Arithmetic On Pointers, Memory\nAllocation, Memory Management Functions And Operators, Debugging Pointers Dangling Pointers,\nMemory Leaks, Etc. The Concept Of Data Type, Definition And Brief Description Of Various Data\nStructures, Data Structures Versus Data Types, Operations On Data Structures, Algorithm Complexity,\nBig O Notation.\n\nUnit Ii\nLinked List, Stacks And Queues: Linear And Multi-Dimensional Arrays And Their\nRepresentation, Operations On Arrays, Sparse Matrices And Their Storage. Linear Linked List,\nOperations On Linear Linked List, Doubly Linked List, Operations On Doubly Linked List, Application Of\nLinked Lists. Sequential And Linked Representations, Operations On Stacks, Application Of Stacks Such\nAs Parenthesis Checker, Evaluation Of Postfix Expressions, Conversion From Infix To Postfix\nRepresentation, Implementing Recursive Functions. Sequential Representation Of Queue, Linear\nQueue, Circular Queue, Operations On Linear And Circular Queue, Linked Representation Of A Queue\nAnd Operations On It, Deque, Priority Queue, Applications Of Queues.\n\nUnit Iii\nTree And Heap: Basic Terminology, Sequential And Linked Representations Of Trees, Traversing\nA Binary Tree Using Recursive And Non-Recursive Procedures, Inserting A Node, Deleting A Node, Brief\n: 48\nIntroduction To Threaded Binary Trees, Avl Trees And B-Trees. Representing A Heap In Memory,\nOperations On Heaps, Application Of Heap In Implementing Priority Queue And Heap Sort Algorithm.\nUnit Iv\nGraphs, Sorting And Searching: Basic Terminology Of Graphs, Representation Of\nGraphs (Adjacency Matrix, Adjacency List), Traversal Of A Graph (Breadth-First Search And Depth-First\nSearch), And Applications Of Graphs. Comparing Direct Address Tables With Hash Tables, Hash\nFunctions, Concept Of Collision And Its Resolution Using Open Addressing And Separate Chaining,\nDouble Hashing, Rehashing. Searching An Element Using Linear Search And Binary Search Techniques,\nSorting Arrays Using Bubble Sort, Selection Sort, Insertion Sort, Quick Sort, Merge Sort, Heap Sort,\nShell Sort And Radix Sort, Complexities Of Searching & Sorting Algorithms.\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To %1. Understand The Principle Of Various Pulse Modulation Techniques. 2. Analyze The Baseband Binary Data Transmission System. 3. Analyze The Ber Performance Of Digital Modulation Techniques. 4. Analyze Matched Filter, Lms Algorithm And Eye Pattern 5. Generate Pn Squences 6. Understand Principles Of Ofdm\n: 47\n: Data Structure\n\n",
  "credits": "3",
  "reference books": "\n1. Sartaj Sahni, Data Structures, Algorithms And Applications In C++, Tata Mcgraw Hill.\n2. Tenenbaum, Augenstein, & Langsam, Data Structures Using C And C++, Prentice Hall Of India.\n3. R. S. Salaria, Data Structures & Algorithms Using C++, Khanna Book Publishing Co. (P) Ltd.\n4. Seymour Lipschutz, Data Structures, Schaum'S Outline Series, Tata Mcgraw Hill\n5. Kruse, Data Structures & Program Design, Prentice Hall Of India."
}
{
  "course code": "Ecpe51",
  "course title": "Computer Networks",
  "prerequisites": "",
  "course type": "Pe",
  "course learning objectives": "\nThe Objective Of This Course Is To Provide An Understanding Of Theoretical Aspects Of Computer\nNetworks, Including The Protocols Involved In The Exchange Of Information Between\nCommunicating Devices.\n\nUnit I\nComputer Network Topologies, Network Hardware, Network Software, Osi Model And Tcp/Ip\nProtocol Stack, Atm, Data Communication Fundamentals, Wired Physical Layer, Wireless Physical\nLayer, Physical Layer Based On Telephone Line.\n\nUnit Ii\nData Link Layer Design Issues, Error Detection & Correction, Elementary Data Link Protocols,\nSliding Window Protocols, Example Data Link Protocols, Aloha Protocols, Wired Mac Layer,\nIeee 802.2: Logical Link Control, Wireless Mac Layer.\n\nUnit Iii\nNetwork Layer Services, Datagram And Virtual Circuit Services, Routing Algorithms, Congestion\nControl Algorithms, Internetworking, Transport Layer Services, Elements Of Transport Protocols, The\nInternet Transport Protocols: Udp & Tcp.\n\nUnit Iv\nDomain Name System, World Wide Web And Http, Electronic Mail System, File Transfer\nProtocol, Network Security, Cryptography.\n",
  "course content": "",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Understand The Efficient Storage Mechanisms Of Data For An Easy Access.\n2. Design And Implementation Of Various Basic And Advanced Data Structures.\n3. Comprehend Various Techniques For Representation Of The Data In The Real World.\n4. Develop Application Using Data Structures.\n5. Understand The Concept Of Protection And Management Of Data.\n6. Implement Various Techniques For Efficient Storage And Access Of Data.\n: 49\n: Computer Networks\n\n",
  "credits": "3",
  "reference books": "\n1. Tanenbaum A.S, Computer Networks, Pearson, 4Th Ed., 2003.\n2. Forouzan B.A, Data Communications And Networking, Tata Mcgraw Hill, 4Th Ed. 2006.\n3. Stallings W, Data And Computer Communications, Phi, 9Th Ed., 2011.\n4. Kurose & Ross K. W., Computer Networking: A Top-Down Approach Featuring The Internet, Pearson, 5Th Edition, 2010.\n: 50"
}
{
  "course code": "Ecpe52",
  "course title": "Neuro-Fuzzy Systems",
  "prerequisites": "Ecpc12",
  "course type": "Pe",
  "course learning objectives": "\nTo Learn About Neural Network Structures And Learning Strategies; Understand The Concept Of Fuzzy\nSystems And Design Them For Practical Applications.",
  "course content": "\n: 52",
  "course outcomes": "\nAt The End Of The Course, The Student Will Be Able To:\n1. Understand The Computer Network Hardware And Software.\n2. Compare The Osi And Tcp/Ip Protocol Stacks.\n3. Examine The Protocols Operating At Different Layers Of Network Architecture.\n4. Categorize The Services Offered By All Layers Of Networks Protocol Stack.\n5. Assess The Cryptographic Techniques.\n6. Identify The Sources Of Network Security Threats.\n: 51\n: Neuro-Fuzzy Systems\n\n",
  "credits": "3",
  "reference books": "\n"
}
{
  "course code": "Ecpe53",
  "course title": "Analog And Mixed Signal Design",
  "prerequisites": "Ecpc34, Ecpc40",
  "course type": "Pe",
  "course learning objectives": "\nTo Familiarize Students With The Importance Mixed Signal Circuit Designing And Develop The\nUnderstanding Of Adc And Dac Architectures.\n\n",
  "course content": "\nUnit I\nAnalog And Discrete-Time Signal Processing, Analog Integrated Continuous Time And Discrete-Time\n(Switched-Capacitor) Filters.\n\nUnit Ii\nBasics Of Analog To Digital Converters (Adc). Basics Of Digital To Analog Converters (Dac).\nSuccessive Approximation Adcs. Dual Slope Adcs.\n\nUnit Iii\nHigh-Speed Adcs (E.G. Flash Adc, Pipeline Adc And Related Architectures). High-Resolution\nAdcs (E.G. Delta-Sigma Converters). Dacs.\n\nUnit Iv\nMixed-Signal Layout. Interconnects. Phase Locked Loops. Delay Locked Loops.\n\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To: %1. Understand The Basic Principles Of Neural Networks 2. Apply The Supervised And Unsupervised Methods For Training Of Neural Networks 3. Use Neural Networks For Practical Applications 4. Understand The Elements Of Fuzzy Systems 5. Design Fuzzy Systems Based On Mamdani And Sugeno-Takagi Models 6. Use The Concept Of Adaptive Neuro Fuzzy Systems (Anfis) For Practical Applications\n: 53\n: Analog And Mixed Signal Design\n\n",
  "credits": "3",
  "reference books": "\n\n: 54"
}
{
  "course code": "Ecpe54",
  "course title": "Embedded System Design",
  "prerequisites": "Ecpc42, Eclr42",
  "course type": "Pe",
  "course learning objectives": "\nTo Familiarize The Students With The Basic Design Concepts For Designing An Embedded Systems And\nDesign The Embedded System Solution To The Problem.\n\n",
  "course content": "\nUnit I\nAn Introduction To Embedded Systems: An Embedded System, Processor In The\nSystem, Other Hardware Units, And Software Embedded Into A System, Exemplary Embedded\nSystems, Embedded System  On- Chip (Soc) And In Vlsi Circuit.\nProcessor And Memory Organization: Structural Units In A Processor, Processor Selection For An\nEmbedded System, Memory Devices, Memory Selection For An Embedded Systems, Allocation Of\nMemory To Program Cache And Memory Management Links, Segments And Blocks And Memory\nMap Of A System, Dma, Interfacing Processors, Memories And Input Output Devices.\n\nUnit Ii\nDevices And Buses For Device Networks: I/O Devices, Timer And Counting\nDevices, Serial Communication Using The I2C (Inter Ic) Can (Controller Area Network),\nProfibus Foundation Field Bus And Advanced I/O Buses Between The Network Multiple Devices.\nHost Systems Or Computer Parallel Communication Between The Networked I/O Multiple Devices\nUsing The Isa, Pci, Pci-X And Advanced Buses.\n\nUnit Iii\nDevice Drivers And Interrupts Servicing Mechanics: Device Drivers,\nParallel Port And Serial Prot Device Drives In A System, Device Drovers For Internal Programmable\nTiming Devices, Interrupt Servicing Mechanism.\n: 56\nUnit Iv\nHardware-Software Co-Design In An Embedded System: Embedded\nSystem Project Management Embedded System Design And Co-Design Issues In System\nDevelopment Process.\nDesign Cycle In The Development Phase For An Embedded System: Use Of Target Systems, Use Of\nSoftware Tools For Development Of An Embedded System, Use Of Scopes And Logic Analysis For\nSystem, Hardware Tests, Issues In Embedded System Design.\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To: %1. Understand Analog And Discrete-Time Signal Processing For Circuit Design. 2.   Understand The Basics Of Adc. 3.   Understand The Different Dac Designing Techniques. 4.   Understand The Main Design Issues Involved In Dac And Adc Design. 5.   Design High-Speed And High Resolution Adcs/Dacs. 6.   Understand Mixed-Signal Layout Styles.\n: 55\n: Embedded System Design\n\n",
  "credits": "3",
  "reference books": "\n"
}
{
  "course code": "Ecoe-50",
  "course title": "Electronics Engineering",
  "prerequisites": "",
  "course type": "Oe",
  "course learning objectives": "\nTo Familiarize The Students With Boolean Algebra, Combinational And Sequential Circuits, Counters,\nVarious Types Of Semiconductors And Their Applications And Analyse 555 Timer, Pll, Various Ic\nApplications. The Students Should Be Able To Define Amplifier And Oscillators And Various Types Of\nTransistors.\n\n",
  "course content": "\nUnit I\n\nDigital Electronics: Introduction To Boolean Algebra, Electronic Implementation Of\nBoolean Operations, Gates-Functional Block Approach, Combinational And Sequential Circuits,\nStorage Elements-Flip Flops-A Functional Block Approach, Counters: Ripple, Up/Down And\nDecade, Shift Registers.\n\nUnit Ii\n\nSemiconductor Devices And Applications: Elemental And Compound\nSemiconductors, Energy Band Model, Intrinsic And Extrinsic Semiconductors, Pn Junctions Diode,\nV-I Characteristic Of An Ideal Diode, Zener And Avalanche Breakdown, Half Wave, Full Wave And\nBridge Rectifier, Varactor, Bjt, Jfet, Mosfet, Op-Amp.\n\nUnit Iii\n\nAmplifiers And Oscillators: Power Amplifiers, Jfet And Mosfet Parameters, Jfet\nAnd Mosfet Amplifiers: Feedback In Amplifiers:Basic Feedback Topologies .Oscillators :\nBarkhausen Criterion, Sinusoidal Oscillators, The Phase-Shift Oscillator, Resonant Circuit\nOscillators, A General Form Of Oscillator Circuit, The Wein -Bridge Oscillator, Crystal Oscillators\n\nUnit Iv\n\nLinear Ic Applications: Universal Active Filter, Switched Capacitor Filter, 555 Timer, Pll.\n\n\n: 58",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To %1. Define A Real Life Problem In Terms Of Technical Specification Of Relevant Embedded\n: System. %2. Understand The Processor And Memory Organization. 3. Learn Different Types Of I/O Devices, Timer And Counting Devices. 4. Understand The Interrupts Servicing Mechanics. 5. Design The Embedded System As Per The Specification. 6. Understand The Importance Of Hardware-Software Co-Design In An Embedded System.\n: 57\n: Electronics Engineering\n\n",
  "credits": "3",
  "reference books": "\n1. B.G.Streetman, Semiconductor Devices, Phi, 6Th Edition, 2013.\n2. R. Tocci & N. Widmer, Digital Systems, Pearson, 12Th Edition, 2016.\n3. R.A. Gayakwaed, Op-Amps And Linear Integrated Circuits, Phi, 4Th Edition, 2004.\n4. Sedra & Smith, Microelectronic Circuits, Oxford University Press, 4Th Edition, 2003.\n\n"
}
{
  "course code": "Ecoe51",
  "course title": "Signal Analysis",
  "prerequisites": "Mair11",
  "course type": "Oe",
  "course learning objectives": "\nTo Understand Continuous Time And Discrete Time Signals, Fourier Series\nRepresentation Of Ctps, Continuous Time Fourier Transform, Z- Transform And Its\nProperties.\n",
  "course content": "\n\nUnit I\n\nIntroduction To Signal: Continuous Time And Discrete Time Signals,\nEven And Odd Signals. Elementary Continuous Time And Discrete Time Signals.\nClassification Of Signals, Causality; Stability, Time Invariance, Linearity. Continuous\nTime And Discrete Time Lti Systems, Convolution Integral And Convolution Sum,\nProperties Of Lti Systems. Differential And Difference Equations.\n\nUnit Ii\n\nFourier Series And Lti Systems: Fourier Series Representation Of\nCtps, Convergence Of Fs. Properties Of Ctfs. Fourier Series Representation Of\nDtps. Properties Of Dtfs. Fourier Series And Lti Systems. Filtering, Rc Low\nPass And High Pass Filters. Recursive And Non Recursive Discrete Time Filters.\nSampling Theorem, Sampling Of Continuous Time Signal With Impulse Train. Aliasing,\nDiscrete-Time Processing Of Continuous Time Signals.\n\nUnit Iii\n\nFourier Transform: Continuous Time Fourier Transform (Ctft),\nConvergence Of Ft. Properties Of Ctft. Discrete Time Fourier Transform (Dtft).\nProperties Of Dtft. Systems Characterized By Linear Constant Co-Efficient\nDifferential Equation And Difference Equations. Magnitude And Phase Spectrum,\nGroup Delay.\n: 60\nUnit Iv\n\nZ-Transform: Z- Transform And Its Properties, Poles And Zeros, Inversion Of\nZ-Transform, One Sided Z-Transform And Solution Of Differential Equations. Analysis\nOf Lti Systems In Z-Domain, Causality, Stability, Relationship Between Z-Transform\nAnd Fourier Transform. Frequency Selective Filters; All Pass Filters, Minimum-Phase,\nMaximum-Phase And Mixed-Phase Systems.\n",
  "course outcomes": "\n\nAt The End Of The Course, Student Will Be Able To;\n1. Acquire The Knowledge Of Basics Of Digital Electronics.\n2. Distinguish Various Types Of Semiconductors And Their Applications.\n3. Understand Various Types Of Transistors.\n4. Elaborate Various Linear Ic Applications.\n5. Understand Various Types Of Amplifiers And Feedback In Amplifiers.\n6. Design And Analyze Various Types Of Oscillators.\n: 59\nSignal Analysis",
  "credits": "3",
  "reference books": "\n1. Oppenheim Willsky And Nawab, Signals And Systems, Phi. 3Rd Ed.\n2. Simon Haykin , Signals And Systems, John Wiley, 3Rd Ed."
}
{
  "course code": "Ecpc70",
  "course title": "Microwave Theory And Devices",
  "prerequisites": "Ecpc31, Ecpc51",
  "course type": "Pc",
  "course learning objectives": "\nTo Acquaint Graduating Students With Fundamentals, Analytical Methods, Design Principles And\nApplications Of Active And Passive Microwave Components And Devices\n",
  "course content": "\nUnit I\nMicrowave Tubes- Operating Principle Of Multicavity And Reflex Klystron, Magnetron, And\nTraveling Wave Tube\nWaveguides- Te, Tm, Tem Modes Solutions Of Maxwells Equations, Rectangular And Circular\nWaveguides, Microstrip And Strip Lines.\n\nUnit Ii\nScattering Matrix Representation Of Microwave Networks, Directional Couplers, E-Plane, H-Plane\nAnd Magic Tee, Coupling Of Waveguides- Probes, Loops And Apertures\n\nUnit Iii\nResonators- Basic Principle, Loaded, Unloaded, And External Q, Open And Shorted Tem Lines,\nMicrostrip And Dielectric Resonators.\nFerrites- Permeability Tensor, Plane Wave Propagation In Ferrites, Faraday Rotation, Circulators,\nIsolators And Phase Shifters\n\nUnit Iv\nMicrowave Devices- Gunn Diode, Impatt, Pin, Schottky Barrier, Microwave Bjt,\nMesfet, Hemt, Applications\n\n",
  "course outcomes": "\n1 Utilize The Concepts Of Discrete Time And Continuous Time Signals And Their\nTransformations.\n2 Analyze The Fourier Series Of Periodic And Fourier Transform Of Non-Periodic\nDiscrete Time And Continuous Time Signals.\n3 Understand And Apply The Concepts Of Bandwidth And Filters And Bode Plots.\n4 Apply The Laplace Transform For Various Applications.\n5 Represent Continuous Time And Discrete Time Systems In The Frequency Domain\nUsing Fourier Analysis Tools Like Ctfs, Ctft, Dtfs And Dtft.\n6 Understand And Apply The Concept Of Z Transform.\n: 61\nB.Tech 7Th Semester\n: 62\n: Microwave Theory And Devices\n\n",
  "credits": "4",
  "reference books": "\n1. Liao S.Y. Microwave Devices And Circuits, Prentice Hall Of India\n2. Collin R E Foundations Of Microwave Engineering, 2Nd Ed, John Wiley & Sons, 2000\n3. Pozar D M Microwave Engineering, 3Rd Ed John Wiley And Sons, 2004\n: 63"
}
{
  "course code": "Ecpc71",
  "course title": "Microelectronics And Vlsi Design",
  "prerequisites": "Ecpc34, Ecpc40",
  "course type": "Pc",
  "course learning objectives": "\nEnable The Students To Understand Fabrication Process Sequence Of Silicon Semiconductor Devices\nAnd Ics.\n",
  "course content": "\nUnit I\nCrystal Growth: Mgs, Egs, Czochralspi Crystal Puller, Silicon Shaping, Wafer Preparation.\nEpitaxy, Oxidation, Lithography And Reactive Plasma Etching\n\nUnit Ii\nDi-Electric And Poly-Silicon Film Deposition, Diffusion, Ion Implantation And Metallization And\nMetallization Problems\n\nUnit Iii\nAssembly & Packaging, Isolation Techniques, Bipolar Ic Fabrication Process Sequence. N-Mos\nIc Fabrication Process Sequence.\n\nUnit Iv\nMos Design Process : Stick Diagram & Design Rules. Physical Design Of Ics Layout Rules &\nCircuit Abstractor, Cell Generation, Layout Environments, Layout Methodologies,\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Understand The Working Of Basic Microwave Components\n2. Understand The Theory Of Microwave Amplifiers And Oscillators\n3. Design Waveguides And Resonators\n4. Understand The Basic Working Principle Of Ferrites In Microwave Devices\n5. Proficient In Analysis And Characterization Of Microwave Networks\n6. Understand The Use Of Microwave Devices In Real Time Scenarios\n: 64\n: Mircoelectronics And Vlsi Design\n\n",
  "credits": "4",
  "reference books": "\n: 65"
}
{
  "course code": "Ecpc72",
  "course title": "Wireless And Mobile Communication",
  "prerequisites": "Ecpc35, Ecpc53",
  "course type": "Pc",
  "course learning objectives": "\nCourse Will Provide An In Depth Understanding Of The Principles, Performance And Evolution Of\nWireless Communication Standards (2G To 5G)\n",
  "course content": "\n\nUnit I\n\nCellular Communications : Introduction To Cellular Communications, Frequency Reuse, Multiple\nAccess, Technologies, Cellular Processes, Gsm (Ss7), Call Setup, Handover Etc., Teletraffic\nTheory\n\nWireless Communications And Diversity: Fast Fading Wireless Channel Modeling,\nRayleigh/Ricean Fading Channels, Ber Performance In Fading Channels, Diversity Modeling For\nWireless Communications, Ber Performance Improvement With Diversity, Types Of Diversity\nFrequency, Time, Space.\n\nUnit Ii\n\nBroadband Wireless Channel Modeling : Wssus Channel Modeling, Rms Delay Spread,\nDoppler Fading, Jakes Model, Autocorrelation, Jakes Spectrum, Impact Of Doppler Fading\nCdma : Introduction To Cdma, Walsh Codes, Variable Tree Ovsf, Pn Sequences, Multipath\nDiversity, Rake Receiver, Cdma Receiver Synchronization.\n\nUnit Iii\n\nOfdm: Introduction To Ofdm, Multicarrier Modulation And Cyclic Prefix, Channel Model And\nSnr Performance, Ofdm Issues  Papr, Frequency And Timing Offset Issues\nMimo : Introduction To Mimo, Mimo Channel Capacity, Svd And Eigenmodes Of The Mimo\nChannel, Mimo Spatial Multiplexing  Blast, Mimo Diversity  Alamouti, Ostbc, Mrt,\nMimo-Ofdm.\n: 67\nUnit Iv\n\nUwb (Ultrawide Band) : Uwb Definition And Features, Uwb Wireless Channels, Uwb Data\nModulation, Uniform Pulse Train, Biterror Rate Performance Of Uwb\nEvolution Of Wireless Standards (2G-5G): Gprs, Wcdma, Lte/ Wimax, Cognitive Radios,\nIeee Wireless Standards.\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Understand The Crystal Growth Techniques In Silicon Device.\n2. Understand Oxidation And Lithography Techniques In Silicon Device.\n3. Understand The Deposition And Implantation Techniques Used For Device Fabrication.\n4. Understand The Key Issues With Assembly & Packaging Of Silicon Based Ics.\n5. Understand The Ic Fabrication Process Sequence.\n6. Understand Physical Design Of Ics: Layout Rules, Environments And Methodologies.\n: 66\n: Wireless And Mobile Communication\n",
  "credits": "4",
  "reference books": "\n1. Andrea Goldsmith, Wireless Communications: Cambridge University Press.\n2. Theodore Rappaport, Wireless Communications: Principles And Practice, Prentice Hall.\n3. Ezio Biglieri, Mimo Wireless Communications  Cambridge University Press.\n4. Aditya K. Jagannatham, Principles Of Modern Wireless Communication Systems: Mcgraw- Hill Education\n"
}
{
  "course code": "Ecpe70",
  "course title": "Wireless Sensor Networks",
  "prerequisites": "Ecpe51",
  "course type": "Pe",
  "course learning objectives": "\nWsns Provide An Excellent Information Infrastructure For The Remote Monitoring, Tracking And\nControl Of Indoor And Outdoor Environments, Industrial Plants, And Other Applications.\n",
  "course content": "\n\nUnit I\n\nIntroduction : Wireless Communication Technologies,Wireless Sensor Networks , Application\nAreas Of Wsns, Principle Of Wireless Sensor Networks, Ieee 802.15.4 Standard And Wireless\nSensor Network, Constructing Wsns With Ieee 802.15.4, Zigbee And Wireless Sensor Networks,\n6Lowpan And Wireless Sensor Network, Grand Challenges In The Design And Implementation Of\nWsns\nHardware Design For Wsns: General Wireless Sensor Node Architecture, System-On-Chip And,\nComponent-Based Design, Design Guidelines, Design Case, Energy Scavenging, Embedded\nSoftware Design For Wsns, Cross Layer Design Issues.\n\nUnit Ii\n\nRouting Technologies In Wsns: Classification Of Routing Protocols In Wsns, Aodv Routing\nProtocols Cluster-Tree Routing Protocol, Energy-Aware Routing Protocols\nOptimization Of Sink Node Positioning: Challenges Of Sink Node Positioning, Categories Of\nSink Node Positioning Approaches, Optimizing Locations Of Static Multiple Sink Nodes, Solving\nOptimal Location Problems, Mobile Target Localization And Tracking.\n\nUnit Iii\n\nInterference Of Wsns With Ieee 802.11B Systems: Wireless Coexistence And Interference In\nWsns, Performance Metrics, Coexistence Mechanism Of Ieee 802.15.4, Mitigating Interference\nBetween Ieee 802.11B, Advanced Mitigation Strategies, Empirical Study\n: 69\nSensor Data Fusion And Event Detection: Sensor Data Fusion Techniques, Event Detection,\nGeneric Sensor State Model, Sensor State Model Based Event Detection, Sensor Network As A\nDatabase, Wsn Security.\n\n\nUnit Iv\n\nHybrid Rfid/Wsns For Logistics Management: Rfid Tag And Reader, Hybrid Rfid/Sensor\nNetwork, Generic Hybrid Rfid/Sensor Network Architecture , Possible Use In Humanitarian\nLogistics Management, Wireless Nano-Sensor Networks\nInternet Of Things: Challenges And Features Of The Iot, Connecting Wsns With The Internet, Iot\nService-Oriented Architecture, Possible Implementations In Emergency Response.\nZigbee Smart Home Automation Systems: Analysis Of The Existing Home Automation Systems,",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Synthesis And Analyze Wireless And Mobile Cellular Communication Systems Over Different Stochastic Fading Channels\n2. Understand Advanced Multiple Access Techniques\n3. Learn Diversity Reception Techniques\n4. Explore The Need Of Mimo/ Ofdm As The Pivoting Technology For Capacity Maximization\n5. Analyse The Evolution Of Different Wireless Standards (2G To 5G Stds.) And The Need\n6. Contribute And Meet The Dynamic Requirements Of Telecom Companies.\n: 68\n: Wireless Sensor Networks\n\n",
  "credits": "3",
  "reference books": "\n1. Yang, Shuang-Hua, Wireless Sensor Networks: Principle Design And Applications, Springer\n2. Ian F. Akyildiz, Mehmet Can Vuran, Wireless Sensor Networks, Wiley\n\n"
}
{
  "course code": "Ecpe71",
  "course title": "Digital Image Processing",
  "prerequisites": "Ecpc32",
  "course type": "Pe",
  "course learning objectives": "\nThe Student Should Be Able To Understand And Apply The Various Concepts Of Digital Image\nProcessing.\n",
  "course content": "\n\n\nUnit I\n\nDigital Image Fundamentals: Elements Of Digital Image Processing Systems,\nElements Of Visual Perception, Brightness, Contrast, Hue, Saturation, Mach Band Effect, Color Image\nFundamentals - Rgb, Hsi Models, Image Sampling, Quantization, Dither, Two-Dimensional\nMathematical Preliminaries, 2D Transforms - Dft, Dct, Klt, Svd, Etc.\n\nUnit Ii\n\nImage Enhancement: Histogram Equalization And Specification Techniques, Noise\nDistributions, Spatial Averaging, Directional Smoothing, Median, Geometric Mean, Harmonic\nMean, Contraharmonic Mean Filters, Homomorphic Filtering, Color Image Processing: Basic\nConcepts.\n\nUnit Iii\n\nImage Restoration: Degradation Model, Unconstrained Restoration - Lagrange Multiplier\nAnd Constrained Restoration, Inverse Filtering-Removal Of Blur Caused By Uniform Linear Motion,\nWiener Filtering, Geometric Transformations-Spatial Transformations, Image Reconstruction From\nProjection, Image Compression; Huffman Coding, Golomb Coding, Arithmetic Coding, Lzw\nCoding, Etc, Digital Watermarking.\n\nUnit Iv\n\nImage Segmentation: Edge Detection, Edge Linking Via Hough Transform, Thresholding,\nRegion Based Segmentation ,Region Growing , Region Splitting And Merging ,\nMorphological Image Processing: Basic Concepts, Image Representation And Description.\n\n: 71",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To %1. Synthesis And Analyze Wireless Sensor Network Architecture 2. Understand The Software And Hardware Designing Aspects Of Wsn 3. Learn Advanced Routing Techniques For Wsn 4. Solve Optimal Location Problems For Sink Nodes 5. Study Different Data Fusion Techniques 6. Implement Iot Through Wsn Backbone For Numerous Applications\n: 70\n: Digital Image Processing (Ecpe71)\n",
  "credits": "3",
  "reference books": "\n1. Rafael C. Gonzalez, Richard E. Woods, Digital Image Processing, Pearson, 3Rd Edition, 2009.\n2. Anil K. Jain, Fundamentals Of Digital Image Processing, Pearson 2002.\n3. Kenneth R. Castleman, Digital Image Processing, Pearson, 2006.\n4. Rafael C. Gonzalez, Richard E. Woods, Steven Eddins, 'Digital Image Processing Using\nMatlab', Pearson Education, Inc., %2000."
}
{
  "course code": "Ecpe72",
  "course title": "Multicarrier Communication",
  "prerequisites": "Ecpc12, Ecpc52 And Ecpc53",
  "course type": "Pe",
  "course learning objectives": "\nTo Understand Various Techniques Used In Multicarrier Communication And Analyse The\nPerformance Of Multicarrier Communication Systems Under Different Conditions.\n",
  "course content": "\nUnit I\n\nBasics Of Multicarrier Communication: Orthogonal Frequency-Division\nMultiplexing, Frequency-Domain Spread Multicarrier Cdma, Single-Carrier Frequency-Division\nMultiple Access, Orthogonal Multicarrier Ds-Cdma, Multitone Ds-Cdma, Generalized\nMulticarrier Ds-Cdma, Time-Hopping Multicarrier Cdma, Time-Frequency-Domain Spread\nMulticarrier Ds-Cdma\n\nUnit Ii\nPerformance Analysis Over Gaussian Channels: Performance Of Orthogonal\nFrequency-Division Multiplexing Over Gaussian Channels, Performance Of Single-User\nFrequency-Domain Spread Multicarrier Cdma, Performance Of Single-User Multicarrier Ds-\nCdma, Single-User Time-Hopping Multicarrier Cdma And Time-Frequency-Domain Spread\nMulticarrier Ds-Cdma Supporting Multiusers.\n\nUnit Iii\nPerformance Analysis Over Fading Channels: Frequency-Selective Fading In\nMulticarrier Systems, Inter-Symbol Interference Suppression: Cyclic-Prefixing And Zero-Padding,\nGeneration Of Fading Statistics For Multicarrier Signals, Performance Of Ofdm, Single-User\nFrequency-Domain Spread Multicarrier Cdma, Single-User Multicarrier Ds-Cdma And Time-\nHopping Multicarrier Cdma Systems Over Fading Channels.\n\nUnit Iv\nMultiuser Detection: Multiuser Detection In Frequency-Domain Spread Multicarrier\nCdma And Multicarrier Ds-Cdma, Multiuser Detection In Time-Frequency-Domain Spread\nMulticarrier Ds-Cdma, Representation Of Discrete Time-Hopping Multicarrier Cdma Signals,\n\n: 73\nNoncoherent Single-User Multiuser Detection, Optimum Posterior Noncoherent Multiuser\nDetection, Principles Of Transmitter Preprocessing.\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To:\n1 Develop The Understanding About Digital Image, Hvs And Its Limitations.\n2 Understand And Apply The Filtering.\n3 Apply The Restoration Operation.\n4 Understand And Apply 2D Mathematics To Analyze The Processing.\n5 Apply The Vector Approach To Handle The Color Images.\n6 Apply The Morphological Operation For Shape Detection.\n: 72\n: Multicarrier Communication\n\n",
  "credits": "3",
  "reference books": "\n"
}
{
  "course code": "Ecpe73",
  "course title": "Satellite And Radar Engg.",
  "prerequisites": "Ecpc31, Eclr52 And Ecpc51",
  "course type": "Pe",
  "course learning objectives": "\n: To Provide Good Understanding Of Radar Systems, Radar Signal Processing, Radar Target\nTracking, Electronic Navigational Systems, And Satellite Communication Systems.\n",
  "course content": "\n\nUnit I\n\nIntroduction: Introduction To Radar, Radar Block Diagram And Operation, Radar Frequencies,\nApplications Of Radar, Prediction Of Range Performance, Minimum Detectable Signal, Receiver Noise,\nProbability Density Function, Snr, Integration Of Radar Pulses, Radar Cross-Section Of Targets, Prf\nAnd Range Ambiguities, Transmitter Power, System Losses.\n\nUnit Ii\n\nRadar Systems And Traking: Doppler Effect, Cw Radar, Fm Cw Radar, Multiple\nFrequency Cw Radar. Mti Radar, Delay Line Canceller, Range Gated Mti Radar, Blind Speeds,\nStaggered Prf, Limitations To The Performance Of Mti Radar, Non-Coherent Mti Radar.\nTracking Radar: Sequential Lobing, Conical Scan, Monopulse: Amplitude Comparison And Phase\nComparison Methods, Radar Antennas. Radar Displays. Duplexer.\n\nUnit Iii\n\nIntroduction To Satellite And Their Orbits: Orbital Aspects Of Satellite\nCommunication: Introduction To Geo-Synchronous And Geo-Stationary Satellites, Keplers Laws,\nLocating The Satellite With Respect To The Earth, Sub-Satellite Point, Look Angles, Mechanics Of\nLaunching A Synchronous Satellite, Orbital Effects, Indian Scenario In Communication Satellites.\n\nUnit Iv\n\nTelemetry, Tracking, Control And Link Design: Satellite Sub-Systems:\nAttitude And Orbit Control Systems, Telemetry, Tracking And Command Control System, Power\n\n: 75\nSupply System, Space Craft Antennas, And Multiple Access Techniques, Comparison Of Fdma,\nTdma, And Cdma.\nIntroduction To Satellite Link Design, Basic Transmission Theory, System Noise Temperature And G/T\nRatio, Design Of Down Link And Uplink, Design Of Satellite Links For Specified C/N, Satellite Data\nCommunication Protocols.\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To; %1. Understand The Basics Of Ofdm And Multicarrier Cdma Systems. 2. Analyse The Performance Of Multicarrier Systems Over Gaussian Channels. 3. Analyse The Performance Of Multicarrier Systems Over Fading Channels. 4. Apply The Techniques Of Interference Suppression In Multicarrier Communication Systems 5. Understand The Coherent Multiuser Detection Techniques Used In Multicarrier\n: Communication Systems %6. Understand The Noncoherent Multiuser Detection Techniques Used In Multicarrier\n: Communication Systems\n: 74\n: Satellite And Radar Engg.\n\n",
  "credits": "3",
  "reference books": "\n1. Merril. I. Skolnik, Introduction To Radar Systems, Mgraw Hill, 2Nd Edition, 1981.\n2. Mark A. Richards, James A. Scheer And William A. Holm, Principles Of Modern Radar: Basic Principles, Yes Dee Publishing Pvt. Ltd., India, 2012.\n3. Dennis Roddy, Satellite Communications, Mgraw Hill, Millan, 4Th Edition, 2013.\n4. Byron Edde, Radar: Principles, Technology, Applications, Pearson, 2008.\n5. D. C. Agarwal, Satellite Communications, Khanna Publications, Delhi.\n"
}
{
  "course code": "Ecpe74",
  "course title": "Advanced Dsp",
  "prerequisites": "Ecpc12, Ecpc52, Eclr51",
  "course type": "Pe",
  "course learning objectives": "\nTo Understand Adaptive Filter, Multirate Dsp, Optimum Linear Filters, Cepstrum Analysis And\nHomomorphic Deconvolution.\n",
  "course content": "\n\nUnit I\n\nAdaptive Filter: System Identification Of System Modeling, Adaptive Channel Equalization,\nEcho Cancellation In Data Transmission Over Telephone Channels, Suppression Of Narrowband\nInterference In A Wide Band Signal, Adaptive Line Enhancer, Adaptive Noise Cancelling, Minimum\nMean Square Error Criterion, The Lms Algorithm, Related Stochastic Gradient Algorithm, Properties\nOf Lms Algorithm, Rls Algorithm, The Ldu Factorization And Square Root Algorithm, Fast Rls\nAlgorithm.\n\nUnit Ii\n\nMultirate Dsp: Decimation And Interpolation, Digital Filter Banks, Interconnection Of\nBuilding Blocks, Noble Identities, Polyphase Representation, Polyphase Implementation Of Uniform\nDft Filter Banks, Fractional Decimation, Pr Systems, Multirate Implementation, Applications Of\nMultirate Systems, Pr Qmf Bank, Two Channel And M-Channel Qmf Banks And Polyphase\nRepresentations, Tree Structured Filter Banks.\n\nUnit Iii\n\nOptimum Linear Filters: Innovation Representation Of Stationary Random Process,\nForward And Backward Linear Prediction, Optimum Reflection Coefficients For Lattice Forward And\nBackward Predictors. Levinson Durbin Algorithm, Ar Lattice And Arma Lattice Ladder Filters, Fir\nAnd Iir Wiener Filter For Filtering And Prediction.\n\nUnit Iv\n\nCepstrum Analysis And Homomorphic Deconvolution: Complex Cepstrum\nAnd Its Properties, Complex And Real Cepstrum For Exponential, Periodic, Minimum Phase And\nMaximum Phase Sequences, Computation Of Complex Cepstrum, Homomorphic Systems\nDeconvolution, Homomorphic Deconvolution, Complex Cepstrum Of Simple Multipath Model And\nSpeech Model.\n\n: 77",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To: %1. Explain Radar And Radar Range Equation. 2. Explain The Principles, Concepts And Operation Of Radar System. 3. Understand Cw, Fmcw, Mti And Tracking Radar Systems. 4. Explain The Principles, Concepts And Operation Of Satellite Communication. 5. Explain The Concepts And Operation Of Telemetry And Command Control For Satellite Communication. 6. Describe The Concepts Of Signal Propagation Affects, Link Design, Rain Fading And Link Availability And Perform Interference Calculations\n: 76\n: Advanced Dsp\n\n",
  "credits": "3",
  "reference books": "\n1. J.G. Proakis And D.G. Manolakis: Digital Signal Processing, 3Rd Ed.\n2. A.V. Oppenheim And R.W. Schafer: Discrete Time Signal Processing, 3Rd Ed.\n"
}
{
  "course code": "Ecpe75",
  "course title": "Antenna Design",
  "prerequisites": "Ecpc51",
  "course type": "Pe",
  "course learning objectives": "\nThe Objectives Of This Course Are To Develop Students Analytical Skills And Understanding By\nIntroducing To Them Design Concepts Of A Variety Of Antenna Structures Of Practical Interest. Through\nThis Course They Will Learn About Fundamental Principles Of Micro-Strip Antennas And Will Also Be\nAble To Perform Various Antenna Measurements\n",
  "course content": "\n\nUnit I\n\nAntenna Arrays: Linear, Planar And Circular, Design Procedure , Phased Arrays Designs ,\nFrequency-Scanning Arrays , Adaptive Arrays And Smart Antennas.\nLong-Wire Antennas , V-Antennas , Rhombic Antennas , Cylindrical Antennas , Self And Mutual\nImpedances, Traveling Wave Antennas, Fractal Antennas, Aperture Antennas Design\nConsiderations.\n\nUnit Ii\n\nMicro-Strip Antennas: Salient Features Of Micro-Strip Antennas , Advantages And\nLimitations , Rectangular Micro-Strip Antennas , Circular Patch , Feed Methods , Characteristics ,\nImpact Of Different Parameters On Characteristics , Methods Of Analysis And Tuning , Techniques For\nIncreasing Bandwidth And Size Reduction , Design And Analysis Of Micro-Strip Arrays,\nApplications. Cad Model.\n\nUnit Iii\n\nAntennas For Special Applications: Electrically Small Antennas , Ground-Plane\nAntennas   , Omnidirectional Antennas, Antenna Design Considerations For Satellite\nCommunication , Receiving Versus Transmitting , Bandwidth , Antennas For Terrestrial Mobile\nCommunication Systems , Base Station Antennas , Mobile Station Antennas.\n: 79\nUnit  Iv\n\nAntenna Measurements: Introduction, Basic Concept, Reciprocity , Near Field And Far\nField ,Sources Of Error , Measurement Ranges , Instrumentation , Measurement Of Different\nAntennas Parameters , Directional Pattern , Gain , Phase , Polarization , Impedance , Efficiency ,\nCurrent Distribution.\n\n",
  "course outcomes": "\n1     Compute The Use Of Fft And Dft.\n2     Design And Implement Fir And Iir Filters\n3     Apply The Concepts Of Multirate Digital Signal Processing\n4     Understand And Apply Concepts Of Adaptive Filters In Various Applications\n5     Understand The Complex Cepstrum Of Simple Multipath Model And Speech Model.\n6     Understand And Apply The Knowledge Of Levinson Durbin Algorithm, Ar Lattice And Arma Lattice Ladder Filters For Prediction.\n: 78\n: Antenna Design\n\n",
  "credits": "3",
  "reference books": "\n1. John D. Kraus Antennas & Wave Propagation 4Th Ed.2010, Mc Graw Hill\n2. C. A Balanis Antennas Theory Analysis & Design 3Rd Ed ,2005, Wiley & Sons\n3. Jordan & Balmain Electromagnetic Waves And Radiation Systems 2Nd Ed ,2016 Pearson\n4. K.D Prasad Antennas & Wave Propagation 3Rd Ed ,1996 Satya Prakashan , N.Delhi\n\n"
}
{
  "course code": "Ecpe76",
  "course title": "Optical Communication",
  "prerequisites": "Phir 11, Ecpc35, Ecpc53",
  "course type": "Pe",
  "course learning objectives": "\n\nTo Provide Good Understanding Of Optical Fiber And Wireless Optical Communication Systems.\n",
  "course content": "\n\nUnit-I\nBasics Of Optical Fibre: Overview Of Optical Fibers: Basic Optical Laws And Definitions,\nClassifications Of Optical Fibers. Modes In Optical Fibers, Single Mode And Multimode Fibers. Fiber\nSplices, Connectors, And Couplers. Attenuation In Optical Fibers: Absorption Losses, Scattering\nLosses, Mode Coupling Loss, Leaky Modes, And Fiber Bend Losses. Dispersion In Optical Fibers:\nEffect Of Dispersion On Pulse Transmission And Transmission Rate, Material Dispersion, Wave Guide\nDispersion, Intermodal Dispersion, Total Dispersion.\n\nUnit-Ii\nOptical Sources And Detectors: Light Emitting Diodes: Introduction, Led Power And\nEfficiency. Led Structures- Sled, Eled, And Sld. Led Optical Output Power, Output Spectrum\nAnd Modulation Bandwidth.\nLasers: Laser Action In Semiconductor Lasers, Semiconductor Lasers For Optical\nCommunications. Optical Receivers: Principle Of Photodiodes, Photo Detector Responsivity, Rise\nTime And Bandwidth. P  N Photodiode, P-I-N Photodiode, And Msm And Avalanche Photo Detectors.\nPhoto Detector Noise, Avalanche Multiplication Noise. Comparison Of Photo Detectors.\n\nUnit-Iii\nIntroduction To Optical Wireless Communicaion Systems: Wireless Access\nSchemes, Brief History Of Owc, Owc/Radio Comparison, Owc Application Areas, Owc\nChallenges. Indoor And Outdoor Owc Channels. Modulation Techniques For Owc: Analog Intensity\nModulation, Pulse Position Modulation, Pulse Interval Modulation, Dual Header Pim, Multilevel\nDpim, Subcarrier Intensity Modulation, Optical Polarization Shift Keying And Orthogonal Frequency\nDivision Multiplexing (Ofdm).\n\n: 81\nUnit-Iv\nOwc Link Performance Analysis: Indoor Owc Link Performance Analysis, Fso Link\nPerformance Under The Effect Of Atmospheric Turbulence, Outdoor Owc Link With Diversity\nTechniques.\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Explore And Understand Advance Antenna Concepts.\n2. Understand The Significance Of Micro-Strip Antennas , Methods Of Analysis And Configurations.\n3. Analyze And Design Antennas Arrays.\n4. Implement Antenna Designs For Special Applications.\n5. Acquire Knowledge About Effects Of Mutual Coupling On Antennas, Applications And Numerical Techniques.\n6. Conduct All Types Of Antenna Measurements.\n: 80\n: Optical Communications\n",
  "credits": "3",
  "reference books": "\n1. John M. Senior, Optical Fiber Communications: Principles And Practice, Pearson Education.\n2. G. P. Agrawal, Fiber Optical Communication Systems, Wiley Publication.\n3. Steve Hranilovic, Wireless Optical Communication Systems, Springer\n4. Z. Ghassemlooy, W. P., S. Rajbhandari Optical Wireless Communications, Crc Presss, 2013.\n"
}
{
  "course code": "Ecpe 77",
  "course title": "Biomedical Electronics",
  "prerequisites": "Ecpc33, Ecpc30",
  "course type": "Pe",
  "course learning objectives": "\nCourse Provides Basic Concepts Of Bioelectric Potentials , Electrodes, General Properties Of\nTransducers And Sensors, Bioelectric Signal Acquisitions And Safety Measures. It Will Also\nFamiliarize The Process Of Bioelectric Signal Acquisitions Of Parameters Such As Displacement,\nMotion, Pressure And Temperature Measurement And Biopotential Electrodes. At The End It Provides\nThe Understanding Of Microcontroller Based Biomedical Applications Of The Above Transducers And\nSensors.\n",
  "course content": "\n\n\nUnit I\nIntroduction: Classification Of Biomedical Instrumentation, Sources Of Biomedical\nSignals, Components Of The Biomedical Instrumentation System, Design Factors Of\nBiomedical Instrumentation, Desirable Characteristics Of Biomedical Instrumentation\nSystems.\n\nUnit Ii\nTransducers For Biomedical Applications: Active Transducer, Passive\nTransducer, Sensors, Displacement Sensor, Strain Gauges, Inductive Transducers, Capacitive\nTransducers, Piezoelectric Transducers, Temperature Measurements.\n\nUnit Iii\nBioelectric Potentials & Electrodes: Resting& Action Potential, Propagation Of\nAction Potential, Bioelectric Potential, Various Bioelectric Potentials And Their Waveforms\nElectrode Theory, Biopotential Electrodes. Microelectrodes, Skin Surface Electrodes\nNeedle Electrodes, Biochemical Transducer\n\nUnit Iv\nBioelectric Signal Acquisitions, Biotelemetry & Electrical Safety\nMeasures: Bio-Signal Amplifiers, Microprocessor/Microcontroller Based Biomedical\nInstrumentation, Applications Of . Computer In Biomedical Instrumentation, Physiological\n\n: 83\nParameters Adaptable To Biotelemetry, Elements Of Biotelemetry System, Requirements\nFor A Biotelemetry System, Implantable Biotelemetry Units, Electrical Safety Of Medical\nEquipment And Patients.\n",
  "course outcomes": "\n\n\nOn Successful Completion Of This Course, Students Will Be Able To: %1. Explain Basics Of Optical Fibre. 2. Explain The Principles, Concepts And Operation Optical Communication. 3. Understand Light Propagation And Different Losses In Optical Fibre. 4. Explain The Concepts And Operation Of Different Optical Sources. 5. Explain The Principles, Concepts And Operation Of Optical Wireless Communication. 6. Analyze Owc Link Design And Effect Of Atmosphere On It.\n: 82\n: Biomedical Electronics\n\n",
  "credits": "3",
  "reference books": "\n1. Biomedical Instrumentation And Measurements By Ananda Natarajan, R. (Prentice Hall Inc)\n2. Design Of Micro- Controller Based Medical Instrumentation By J Tompkins & J G Webster (Prentice Hall Inc)\n3. L A Geddes & L E Baker :- Principles Of Applied Biomedical Instrumentation (John Wiley & Sons, Ny)\n4. J H Milsum:- Biological Control Systems(Mc Graw Hill, Ny)\n5. R Plonsey:- Bioelectric Phenomena (Mcgraw-Hill Co, Ny)\n6. Biomedical Sensors-Fundamentals And Applications By Harry N. Nortan (Plennum Press)\n7. Hand Book Of Biomedical Instrumentation By R.S. Khandpur (Tata Mcgraw Hill)\n"
}
{
  "course code": "Ecpe78",
  "course title": "Nano Electronics",
  "prerequisites": "Phir11, Phir13, Ecir11",
  "course type": "Pe Course Learning Objectives",
  "course learning objectives": "\nThe Major Goals And Objectives Are To Provide The Students With Knowledge And Understanding Of\nNano-Electronics And Their Applications In Nanotechnology",
  "course content": "\nUnit I\nSurvey Of Modern Electronics And Trends Towards Nanoelectronics. Discussion Of The International\nTechnology Roadmap Characteristics: Need For New Concepts In Electronics. From\nMicroelectronics Towards Biomolecule Electronics. Introduction To Particles And Waves, Classical\nParticles, Classical Waves, Wave-Particle Duality.\n\nUnit Ii\nIntroduction To Wave Mechanics, Schrodinger Wave Equation, Wave Mechanics Of Particles, Atoms\nAnd Atomic Orbitals. Introduction To Materials For Nanoelectronics, Semiconductors, Crystal\nLattices: Bonding In Crystals, Electron Energy Bands, Semiconductor Heterostructures, Lattice-\nMatched And Pseudomorphicheterostructures, Inorganic-Organic Heterostructures, Carbon\nNanomaterials: Nanotubes And Fullerenes.\n\nUnit Iii\nIntroduction To Growth, Fabrication, And Measurement Techniques For Nanostructures, Bulk Crystal\nAnd Heterostructure Growth, Nanolithography, Etching, And Other Means For Fabrication Of\nNanostructures And Nanodevices, Techniques For Characterization Of Nanostructures, Spontaneous\nFormation And Ordering Of Nanostructures, Clusters And Nanocrystals, Methods Of Nanotube Growth,\nChemical And Biological Methods For Nanoscale Fabrication, Fabrication Of Nano-Electromechanical\nSystems, Electron Transport In Semiconductors And Nanostructures, Time And Length Scales Of The\nElectrons In Solids, Statistics Of The Electrons In Solids And Nanostructures, Density Of States Of\nElectrons In Nanostructures, Electron Transport In Nanostructures.\n: 85\nUnit Iv\nElectrons In Traditional Low-Dimensional Structures, Electrons In Quantum Wells, Electrons In\nQuantum Wires, Electrons In Quantum Dots, Closing Remarks, Nanostructure Devices, Resonant-\nTunneling Diodes, Field-Effect Transistors, Single-Electron-Transfer Devices, Potential-Effect\nTransistors, Light-Emitting Diodes And Lasers, Nano-Electromechanical System Devices, Quantum-\nDot Cellular Automata.\n",
  "course outcomes": "\n: 84\n: Nano Electronics\n\n",
  "credits": "3",
  "reference books": "\n: Springer, %2004. 3. Nanometer Structures: Theory, Modeling, And Simulation, Editor: Akhleshlakhtakia,\n: Asme Press, %2004. 4. S. E. Lyshevski, Nano- And Micro-Electromechanical Systems Fundamentals Of Nano And\n: Microengineering, 2Nd Edition, Crc Press, %2004. 5. Http://Idol.Union.Edu/~Malekis/Esc24/Esc24Mainpage/Nanomainpage.Htm 6. Http://Mrsec.Wisc.Edu/Edetc/Index.Html 7. Www.Nanohub.Org (Supriyodatta And Mark Ludstrom Lectures)\n\n"
}
{
  "course code": "Ecpe 79",
  "course title": "Digital Ic Design",
  "prerequisites": "Ecpc10",
  "course type": "Pe Course Learning Objectives",
  "course learning objectives": "\nCourse Provides Basic Concepts Of Cmos Inverter And Its Applications In The Design Of\nCombinational & Sequential Circuits, Effects Of Parasitics In Circuit Design, Performance And\nPower Optimization In Circuit Design.\n",
  "course content": "\n\n\nUnit I\nCmos Inverter: Static And Dynamic Behavior, Power, Energy And Energy Delay,\nTechnology Scaling And Its Impact.\nInterconnects: Interconnect Parameters, Wire Models, Wires.Effects Of Interconnect\nParasitics, Advancedinterconnect Techniques.\n\nUnit Ii\nDesign       Of      Cmos        Combinational              &    Sequential           Circuits:\nCombinational Circuits- Static And Dynamic Cmosdesign, Speed And Power Dissipation\nIn Dynamic Circuits, Cascading Of Gates, Designing Logic For Reduced Supply Voltages.\nSequential Circuits- Static And Dynamic Latches Andregisters, Alternative Register Styles,\nPipelined Sequential Circuits, Non-Bistable Sequential Circuits.\n\nUnit Iii\nTiming Issues In Digital Circuits: Timing Classification, Synchronous Timingbasics,\nSources Of Skew And Jitter, Clock Distribution Techniques, Self-Timed Circuit Design, Synchronizers\nAnd Arbiters, Clock Synchronization Using Pll.\n\nUnit Iv\nDesign Of Alu: Data Paths, Adder, Multiplier, Shifter, Power Andspeed Trade-Off In Data Path\nStructures, Power Management.\n: 87",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Understand Basic And Advanced Concepts Of Nano-Electronic Devices.\n2. Understand The Energy Band Structures Of Semiconductors.\n3. Understand The Wave Mechanics Of Semiconductor And Nano-Materials.\n4. Understand Various Materials In The Field Nanoelectronics.\n5. Understand The Techniques For Characterization Of Nanostructures.\n6. Understand Sensors, Transducers, And Their Applications In Nanotechnology.\n: 86\n: Digital Ic Design\n\n",
  "credits": "3",
  "reference books": "\n"
}
{
  "course code": "Ecoe70",
  "course title": "Cellular Mobile Communication",
  "prerequisites": "Ecpc35, Ecpc32 And Ecpc53",
  "course type": "Oe",
  "course learning objectives": "\nTo Understand The Cellular Concept, Small Scale And Large Scale Fading, Diversity Reception And\nDifferent Types Of Multiple Access Techniques\n",
  "course content": "\n\nUnit I\n\nCellular System: Hexagonal Geometry Cell And Concept Of Frequency Reuse, Channel\nAssignment Strategies, Distance To Frequency Reuse Ratio, Channel & Co-Channel Interference\nReduction Factor, S/I Ratio Consideration And Calculation For Minimum Co-Channel And Adjacent\nInterference, Handoff Strategies, Umbrella Cell Concept, Trunking And Grade Of Service,\nImproving Coverage & Capacity In Cellular System-Cell Splitting, Cell Sectorization, Repeaters,\nMicro Cell Zone Concept, Channel Antenna System Design Considerations.\n\nUnit Ii\n\nLarge Scale Path Loss: Free Space Propagation Loss Equation, Path-Loss Of Nlos And\nLos Systems, Reflection, Ray Ground Reflection Model, Diffraction, Scattering, Link Budget\nDesign, Max. Distance Coverage Formula, Empirical Formula For Path Loss, Indoor And Outdoor\nPropagation Models.\n\n\nUnit Iii\n\nSmall Scale Fading: Small Scale Multipath Propagation, Impulse Model For Multipath\nChannel, Delay Spread, Fehers Delay Spread, Upper Bound Small Scale, Multipath Measurement\nParameters Of Multipath Channels, Types Of Small Scale Fading, Rayleigh And Rician Distribution,\nDiversity Techniques In Brief.\n\nUnit Iv\n\nAccess Techniques: Introduction And Comparisons Of Various Multiple Access Strategies-\nTdma, Cdma, Fdma, Ofdm, Csma And Modulation Schemes For Wireless Communication.\n: 89",
  "course outcomes": "\nAfter Completion Of The Course The Student Will Be Competent To: %1. Clearly Understand Of Cmos Inverter Design. 2. Clearly Understand Of Cmos Based Combinational & Sequential Circuits 3. Acquire Knowledge Of Timing Issues In Digital Circuits. 4. Acquire Knowledge Of Various Delays Introduced By Interconnects. 5. Design Clock Distribution Network In Complex Digital Circuits. 6. Design Of Alu For Different Applications.\n: 88\n: Cellular Mobile Communication\n\n",
  "credits": "3",
  "reference books": "\n\n"
}
{
  "course code": "Ecoe71",
  "course title": "Introduction To Communication",
  "prerequisites": "Ecir11",
  "course type": "Oe",
  "course learning objectives": "\nTo Familiarize The Students With The Evolution And Basics Of Communication Engineering And\nTheir Applications. The Student Should Also Be Able To Explain A Transmission Line, Do Transmission\nLine Calculations Using Smith Chart. The Students Should Be Able To Name The Basic Elements Of\nOptical Fiber Transmission Link, Describe Fiber Modes And Different Types Of Fibers And Their\nLosses.\n",
  "course content": "\n\nUnit I\n\nAnalog Communication: Basic Constituents Of Communication System, Amplitude\nModulation, Modulation Index, Dsbsc Modulation, Ssb Modulation, Vestigial Side Band\nModulation, Angle Modulation, Frequency And Phase Modulation Spectrum Of Fm Wave,\nModulation Index And Band Width Of Fm Signal, Nbfm And Wbfm, Transmitter And Receiver,\nClassification Of Radio Transmitters, Classification Of Radio Receivers, Noise, Classification Of\nNoise, Various Sources Of Noise.\n\nUnit Ii\n\nDigital Communication: Pulse Modulation, Pam, Ppm, Pcm, Pwm, Dm, Baseband\nPulse Transmission, Matched Filter And Its Properties, Average Probability Of Symbol Error In Binary\nEnclosed Pcm Receiver, Intersymbol Interference, Digital Pass Band Transmission, Gram Schmidt\nOrthogonalization Procedure, Geometric Interpretation Of Signals, Hierarchy Of Digital Modulation\nTechniques, Bpsk, Dpsk, Depsk, Qpsk, Systems; Ask, Fsk, Qask, Many Fsk, Msk, Spread\nSpectrum Modulation, Pseudonoise Sequence, A Notion Of Spread Spectrum, Direct Sequence Spread\nSpectrum With Coherent Bpsk.\n: 91\nUnit Iii\n\nPropagation Of Radio Waves And Waveguides: Different Modes Of\nPropagation, Ground Waves, Space Waves, Surface Waves And Tropospheric Waves, Ionosphere,\nWave Propagation In The Ionosphere, Transmission Line Equations, Graphical Methods, Smith Chart,\nTime Domain And Frequency Domain Analysis, Te, Tm And Tem Waves, Te And Tm Modes In\nRectangular And Circular Wave Guides.\n\nUnit Iv\n\nOptical Communication: Propagation Within The Fiber, Numerical Aperture Of Fiber,\nDiffraction, Step Index And Graded Index Fiber, Modes Of Propagation In The Fiber, Single Mode And\nMulti Mode Fibers, Losses In Optical Fiber, Rayleigh Scattering Losses, Absorption Losses, Leaky\nModes, Mode Coupling Losses, Bending Losses, Combined Losses In The Fiber.\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Apply And Analyze The Concepts Of Cellular System\n2. Understand The Different Techniques For Capacity Enhancement Of A Cellular System\n3. Compute Path Loss Using Various Path Loss Models\n4. Understand And Analyze Small And Large Scale Fading\n5. Compare The Various Multiple Access Techniques\n6. Understand The Basics Of Propagation Of Radio Signals\n: 90\n: Introduction To Communication Engineering\n\n\n",
  "credits": "3",
  "reference books": "\n: Edition, %2000.        %2. Simon Haykin, Communication Systems, John Wiley, 5Th Edition, 2009.\n: %3. John G. Proakis, Digital Communication, Phi, 4Th Edition, 2003.\n: %4. John Gowar, Optical Communication Systems, Prentice Hall, 2Nd Edition, 1993.\n\n"
}
{
  "course code": "Ecoe72",
  "course title": "Vhdl",
  "prerequisites": "Ecpc34",
  "course type": "Oe",
  "course learning objectives": "\nTo Enable The Students To Design Digital Circuits In Vhdl.\n",
  "course content": "\n\n\nUnit I\n\nIntroduction: Introduction To Vhdl, Hardware Design Construction.\nProgrammable Logic Devices : Introduction To Programmable Logic Device,\nArchitectures, Characteristics Of Plds, Cplds And Fpgas.\nBehavioral Modeling: Entity Declaration, Architecture Body, Process Statement, Variable\nAssignment, Signal Assignment. Inertial And Transport Delays, Simulation Deltas, Signal Drivers.\n\nUnit Ii\n\nData Flow And Structural Modelling: Concurrent Signal Assignment,\nSequential Signal Assignment, Multiple Drivers, Conditional Signal Assignment, Selected Signal\nAssignment, Block Statements, Concurrent Assertion Statement, Component Declaration,\nComponent Instantiation.\n\nUnit Iii\n\nGenerics And Configurations: Configurations. Generics In Configuration. Generic\nValue Specification In Architecture, Block Configurations, Architecture Configurations.\nSubprograms And Packages: Subprograms  Functions, Procedures, Declarations.\nPackage Declarations, Package Body, Use Clause, Predefinal Package Standard. Design Libraries,\nDesign File.\n: 93\nUnit Iv\n\nAdvanced Topics: Digital Design Using Fsm, Generate Statements, Aliases, Qualified\nExpressions, Type Conversions, Guarded Signals, User Defined Attributes, Predefined Attributes.,",
  "course outcomes": "\nAt The End Of The Course, Student Will Be Able To;\n1. Acquire Knowledge About Analog Communication.\n2. Learn The Basics Of Digital Communication.\n3. Understand Pulse Modulation And Its Types.\n4. Classify Various Types Of Radio Transmitters And Radio Receivers.\n5. Tell Various Types Of Waves And Their Propagation.\n6. Acquire Knowledge Of Fiber, Its Various Modes And Losses.\n: 92\n: Vhdl\n\n",
  "credits": "3",
  "reference books": "\n: %2002. 2.      J. Bhasker, A.Vhdl- Primer, Phi Learning, 3Rd Edition, 2009. 3.      K. Skahil, Vhdl For Programmable Logic, Pearson Education India; 1St Edition 2006.\n"
}
{
  "course code": "Ecpc80",
  "course title": "Data Security",
  "prerequisites": "Mair11, Mair12",
  "course type": "Pc",
  "course learning objectives": "\nThe Objective Of This Course Is To Familiarize The Students With Cryptography And Its Applications.\nTopics Will Include Historical Cryptography, Encryption, Authentication, Public Key Cryptography\nAnd Key Distribution.\n",
  "course content": "\n\nUnit I\nFundamental Of Data Security: Introduction To Security, Classification Of Security\nAttacks, Security Mechanisms And Services, Historical Ciphers, Shannon'S Perfect Security,\nSymmetric Key Encryption: Stream Ciphers: Rc4, Block Ciphers: Des, 3Des, Aes, Idea, Modes\nOf Operation, Symmetric-Key Distribution, Public Key Encryption Algorithms: Rsa, Elliptic Curve\nCryptography, Primality Testing And Factoring, Public Key Distribution, Public Key Infrastructure.\nAttacks On Symmetric Key And Asymmetric Key Ciphers.\nUnit Ii\nAuthentication: Attacks On Public Key Schemes, Signature Scheme, Mac And Hash\nFunctions, Properties And Requirements Of Digital Signatures, Mac And Hash, Kerberos, Entity\nAuthentication: Weak Authentication, Challenge-Response Identification (Strong Authentication),\nAnd Zero Knowledge Proofs.\nUnit Iii\nKey Distribution: Key Management, D-H Key Exchange Algorithm, Attacks On D-H\nAlgorithm, Key Predistribution, Mit Key Agreement Protocol, Key Agreement Using Self-Certifying\nKeys.\nUnit Iv\nPractical Applications: E-Mail Security Pki, Ca. X509 Certificates, Ssl/Tls,\nHttps, Ipv6 And Ipsec, Proxies And Firewalls, Wireless Network Security.\n\n\n: 96",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Understand Various Programmable Logic Devices And Eda Tools.\n2. Understand The Behavioral Modeling.\n3. Understand The Data Flow And Structural Modelling.\n4. Understand Modeling Styles In Vhdl And To Design Digital Systems.\n5. Understand Generics And Configurations Vhdl.\n6. Understand Advanced Topics In Vhdl.\n: 94\nB.Tech 8Th Semester\n: 95\n: Data Security\n\n",
  "credits": "3",
  "reference books": "\n1. Douglas Stinson, \"Cryptography Theory And Practice\", 2Nd Edition, Chapman & Hall/Crc.\n2. B. A. Forouzan, \"Cryptography & Network Security\", Tata Mc Graw Hill.\n3. W. Stallings, \"Cryptography And Network Security\", Pearson Education.\n"
}
{
  "course code": "Ecpe80",
  "course title": "Computer Crime Investigation And",
  "prerequisites": "Csir11, Ecpe51",
  "course type": "Pe",
  "course learning objectives": "\nTo Understand Computer Crimes And Why Computer Forensics Is An Integral Part Of Information\nSecurity.\n",
  "course content": "\n\nUnit I\nAuctions And Trading Mechanisms, Safe Exchange, Payment Mechanisms And Protocols,\nSearching Hyperlinked Structures, Data Mining, Copyright Protection And Security, Web Software\nInfrastructure, Personalization And Tracking, Integration Of Catalogues And Other Trading\nInformation.\n\nUnit Ii\nIndustrial Espionage And Cyber-Terrorism, Principles Of Criminal Law, Computer Forensic\nInvestigation, Elements Of Personnel Security And Investigations, Principles Of Risk And Security\nManagement, Conspiracy In Computer Crime, And Computer Fraud Investigation.\n\nUnit Iii\nForensics Overview-Computer Forensics Fundamentals, Benefits Of Computer Forensics,\nComputer Crimes, Computer Forensics Evidence And The Courts, Legal Concerns And Privacy\nIssues. Forensics Process-Forensics Investigation Process, Securing The Evidence And Crime\nScene, Chain Of Custody, Law Enforcement Methodologies\n\nUnit Iv\nForensics Evidence-Evidence Sources, Evidence Duplication, Preservation, Handling, And\nSecurity, Forensics Soundness, Order Of Volatility Of Evidence, Collection Of Evidence On A Live\nSystem, Court Admissibility Of Volatile Evidence, Forensics Readiness-Benefits Of Forensic\nReadiness, Preparing An Organization For Forensics Investigations, Managing An Investigation,\nInternet Forensics-Reconstructing Past Internet Activities And Events, E-Mail Analysis, Messenger\nAnalysis: Aol, Yahoo, Msn, And Chat\n: 98",
  "course outcomes": "\nAt The End Of The Course, The Students Will Be Able To:\n1. Understand The Concept And Need Of Cryptography.\n2. Implement And Design Symmetric And Asymmetric Key Algorithms.\n3. Implement Various Key Distribution And Authentication Techniques.\n4. Comprehend And Analyze Cryptographic Primitives In Real Time Applications.\n5. Understand And Analyze Various Network Security Protocols.\n6. Analyze Security Challenges In Wireless Networks And Its Preventive Measures.\n: 97\n: Computer Crime Investigation And Forensics\n\n",
  "credits": "3",
  "reference books": "\n1. Sherri Davidoff, Jonathan Ham. Network Forensics: Tracking Hackers Through Cyberspace, Prentice Hall, 2012.\n2. Clint P Garrison. Digital Forensics For Network, Internet, And Cloud Computing: A Forensic Evidence Guide For Moving Targets And Data, Syngress, 2010. Isbn 1597495387, 9781597495387.\n3. Vacca, J, Computer Forensics, Computer Crime Scene Investigation, 2Nd Ed, Charles River Media, 2005.\n4. Gallegos F, Computer Forensics: An Overview, Volume 6, 2005, Located At: Computer Forensics: An Overview (Last Visited Dec. 26, 2006)\n"
}
{
  "course code": "Ecpe81",
  "course title": "Pattern Recognition And Machine",
  "prerequisites": "Ecpc32",
  "course type": "Pe",
  "course learning objectives": "\nThe Student Should Be Able To Understand And Apply The Various Concepts Of Pattern Recognition\nAnd Machine Learning.\n",
  "course content": "\nUnit I\n\nIntroduction\nPolynomial Curve Fitting, Probability Theory Model Selection, The Curse Of Dimensionality,\nDecision Theory, Information Theory,Probability Distributions,Binary Variables, Multinomial\nVariables, The Gaussian Distribution ,The Exponential Family, Nonparametric Methods,Linear\nModels For Regression, Linear Basis Function Models, The Bias-Variance Decomposition,\nBayesian Linear Regression, Bayesian Model Comparison, The Evidence Approximation,\nLimitations Of Fixed Basis Functions, Linear Models For Classification, Discriminant Functions,\nProbabilistic Generative Models, Probabilistic Discriminative Models The Laplace\nApproximation, Bayesian Logistic Regression.\n\nUnit Ii\n\nFeed-Forward Network Functions\nNetwork Training, Error Backpropagation, The Hessian Matrix, Regularization In Neural\nNetworks, Mixture Density Networks, Bayesian Neural Networks Dual Representations,\nConstructing Kernels, Radial Basis Function Networks, Gaussian Processes,Sparse Kernel\nMachines, Maximum Margin Classifiers, Relevance Vector Machines.\n\nUnit Iii\n\nGraphical Models\nBayesian Networks, Conditional Independence, Markov Random Fields, Inference In Graphical\nModels, Mixture Models And Em, K-Means Clustering, Mixtures Of Gaussians, An Alternative\nView Of Em, The Em Algorithm In General, Approximate Inference, Variational Inference,\n\n: 100\nVariational Mixture Of Gaussians, Variational Linear Regression, Exponential Family\nDistributions, Local Variational Methods, Variational Logistic Regression, Expectation\nPropagation,Sampling Methods, Basic Sampling Algorithms, Markov Chain Monte Carlo, Gibbs\nSampling, Slice Sampling, The Hybrid Monte Carlo Algorithm, Estimating The Partition Function.\n\nUnit Iv\n\nContinuous Latent Variables\nPrincipal Component Analysis, Probabilistic Pca, Kernel Pca, Nonlinear Latent Variable\nModels, Sequential Data , Markov Models, Hidden Markov Models, Linear Dynamical Systems,\nCombining Models, Bayesian Model Averaging, Committees, Boosting, Tree-Based Models,\nConditional Mixture Models.\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Understand Computer Forensics, Prepare For Computer Investigations\n2. Understand Enforcement Agency Investigations And Corporate Investigations\n3. Maintain Professional Conduct\n4. Understand How To Identify Needs For Computer Forensics Tools\n5. Evaluate The Requirements And Expectations For Computer Forensics Tools\n6. Understand How Computer Forensics Hardware And Software Tools Are Integrated And Validated\n: 99\n: Pattern Recognition And Machine Learning\n\n",
  "credits": "3",
  "reference books": "\n"
}
{
  "course code": "Ecpe82",
  "course title": "Network Security",
  "prerequisites": "Ecpe-51",
  "course type": "Pe",
  "course learning objectives": "\n\nExtensive, Detailed And Critical Understanding Of The Concepts, Issues, Principles And Theories Of Network\nSecurity\n",
  "course content": "\n\nUnit I\nFundamental Of Data Security: Introduction To Security, Classification Of Security\nAttacks, Security Mechanisms And Services, Historical Ciphers, Shannon'S Perfect Security,\nSymmetric Key Encryption: Stream Ciphers: Rc4, Block Ciphers: Des, 3Des, Aes, Idea, Modes\nOf Operation, Symmetric-Key Distribution, Public Key Encryption Algorithms: Rsa, Elliptic Curve\nCryptography, Primality Testing And Factoring, Public Key Distribution, Public Key Infrastructure.\nAttacks On Symmetric Key And Asymmetric Key Ciphers.\nUnit Ii\nAuthentication: Attacks On Public Key Schemes, Signature Scheme, Mac And Hash\nFunctions, Properties And Requirements Of Digital Signatures, Mac And Hash, Kerberos, Entity\nAuthentication: Weak Authentication, Challenge-Response Identification (Strong Authentication),\nAnd Zero Knowledge Proofs.\nUnit Iii\nKey Distribution: Key Management, D-H Key Exchange Algorithm, Attacks On D-H\nAlgorithm, Key Predistribution, Mit Key Agreement Protocol, Key Agreement Using Self-Certifying\nKeys.\nUnit Iv\nPractical Applications: E-Mail Security Pki, Ca. X509 Certificates, Ssl/Tls,\nHttps, Ipv6 And Ipsec, Proxies And Firewalls, Wireless Network Security.\n: 102",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To:\n1. Develop The Understanding About Fundamentals Of Pattern Recognition And Machine\n: Learning.\n2. Apply Supervised And Unsupervised Learning Techniques.\n3. Understand And Apply Svm.\n4. Understand Different Graphical Models.\n5. Understand Different Clustering Techniques.\n6. Apply Continuous Latent Variable And Its Mixture Models.\nNetwork Security",
  "credits": "",
  "reference books": "\n1. Network Security Essentials (Applications And Standards), By William Stallings, Pearson Education.\n2. Hack Proofing Your Network By Ryan Russell, Dan Kaminsky, Rain Forest Puppy, Joe Grand, David Ahmad,Hal Flynn Ido Dubrawsky, Steve W.Manzuik And Ryan Permeh, Wiley Dremtech\n3. Fundamentals Of Network Security By Eric Maiwald, Dreamtech Press.\n4. Network Securityprivate Communication In A Public World By Charlie Kaufman, Radia Perlman And Mike Speciner, Pearson/Phi.\n5. Cryptography And Network Security, Third Edition, Stallings, Phi/Pearson.\n6. Network Security: The Complete Reference, Robert Bragg, Mark Rhodes, Tmh.\n"
}
{
  "course code": "Ecpe83",
  "course title": "Internet Of Things",
  "prerequisites": "Ecpc42, Ecpc53, Ecpc72",
  "course type": "Pe",
  "course learning objectives": "\nTo Acquaint Graduating Students With Fundamentals Of Iot Paradigm And Enable\nThem To Design Iot Solutions For Connected World\n\nUnit I\n\nIntroduction: General Internet And Internet Of Things, Web Of Things, Iot\nParadigm, Elements Of An Iot Ecosystem, Technology And Business Drivers,\nConvergence Of Technologies, Typical Iot Applications\n\nUnit Ii\n\nConnectivity And Networks: Wireless Technologies, Rfid, Edge\nConnectivity, Communication Protocols, Sensors\nArchitecture: Reference Model,Design Principle, Standards\n\nUnit Iii\nPrivacy And Security Issues: Security, Privacy, And Trust In Iot Data\nPlatforms, Data Aggregation\n\nUnit Iv\nAnalytics And Case Studies: Sensor Body Area Networks, Iot In Home,\nCities, And Healthcare\n",
  "course content": "",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Identify Network Security Threats And Their Preventive Measures.\n2. Analyze And Design Encryption And Authentication Mechanisms.\n3. Analyze And Design Network Security Protocols.\n4. Analyze Security Challenges In Wireless Networks And Their Preventive Measures.\n5. Analyze And Design Network Security Protocols Including Tls, Ssl Etc.\n6. Determine Firewall Requirements, And Configure A Firewall.\n: 103\n: Internet Of Things\n\n",
  "credits": "3",
  "reference books": "\n1. J. Biron, J, Follett, Foundational Elements Of An Iot Solution, Oreilly Media, 2016\n2. Francis Decosta: Rethinking The Internet Of Things: A Scalable Approach To Connecting Everything, 1St Ed. Apress Publications, 2013\n3. Cuno Pfister, Getting Started With The Internet Of Things, Oreilly Media, 2011, Isbn:978-4493-9357-1\n\n\n: 104\n4. Olivier Hersent, David Boswarthick, Omar Elloumi, The Internet Of Things: Key Applications And Protocols, Wiley Publications 2Nd Ed, Jan. 2012\n"
}
{
  "course code": "Ecpe84",
  "course title": "Artificial Intelligence And Expert",
  "prerequisites": "Mair11, Ecpc32",
  "course type": "Pe",
  "course learning objectives": "\n: To Present The Concepts Of Intelligent Agents, Searching, Knowledge And Reasoning,\nPlanning, Learning Neural Networks And Expert Systems.\n",
  "course content": "\n\nUnit I\n\nIntroduction: Introduction To Ai: Intelligent Agents, Perception, Natural Language\nProcessing, Problem Solving Agents, Searching For Solutions: Uniformed Search Strategies,\nInformed Search Strategies.\n\nUnit 1I\n\n\nKnowledge And Reasoning: Adversarial Search, Optimal And Imperfect Decisions,\nAlpha, Beta Pruning, Logical Agents: Propositional Logic, First Order Logic, Syntax And Semantics,\nUsing First Order Logic, Inference In First Order Logic. Uncertainty, Acting Under Uncertainty, Basic\nProbability Notation, Axioms Of Probability, Bayes Rule, Probabilistic Reasoning, Making Simple\nDecisions.\n\nUnit 1Ii\n\n\nPlanning And Learning: Planning: Planning Problem, Partial Order Planning, Planning\nAnd Acting In Non-Deterministic Domains. Learning: Learning Decision Trees, Knowledge In\nLearning, Neural Networks, Reinforcement Learning, Passive And Active.\n: 106\nUnit 1V\n\nExpert Systems: Definition, Features Of An Expert System, Organization, Characteristics,\nProspector, Knowledge Representation In Expert Systems. Expert System Tools, Mycin.\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To:\n1. Understand The Concept Of Iot\n2. Understand The Application Area Of Iot\n3. Able To Understand The Revolution Of Internet In Mobile Devices, Cloud And Sensor Networks\n4. Understand Constraints And Opportunities Of Wireless And Mobile Networks For Iot\n5. Iot Architecture And Design Constraints\n6. Able To Analyse The Requirements Of Connected World And Design Solutions In Iot Paradigm\n: 105\n: Artificial Intelligence And Expert Systems\n\n",
  "credits": "3",
  "reference books": "\n1. Stuart Russel And Peter Norvig, Artificial Intelligence A Modern Approach, Pearson\nEducation, 2Nd Edition, %2003. %2. Donald A. Waterman, A Guide To Expert Systems, Pearson Education.\n3. George F. Luger, Artificial Intelligence  Structures And Strategies For Complex Problem\nSolving, Pearson Education, 4Th Edition, %2002. %4. Elain Rich And Kevin Knight, Artificial Intelligence, Tata Mcgraw Hill, 2Nd Edition, 1995.\n5. W. Patterson, Introduction To Artificial Intelligence And Expert Systems, Prentice Hall Of\nIndia, %2003."
}
{
  "course code": "Ecpe85",
  "course title": "Computer Vision",
  "prerequisites": "Ecpe71",
  "course type": "Pe",
  "course learning objectives": "\nThe Student Should Be Able To Understand And Apply The Various Concepts Of Computer Vision.",
  "course content": "\nUnit I\n\nIntroduction: What Is Computer Vision? A Brief History , Image Formation Geometric\nPrimitives And Transformations, Photometric Image Formation, The Digital Camera, Point Operators,\nLinear Ltering, More Neighborhood Operators, Fourier Transforms, Pyramids And Wavelets\n,Geometric Transformations, Global Optimization.\n\nUnit Ii\n\nFeature Detection And Matching: Points And Patches, Edges, Lines, Segmentation\n: Active Contours , Split And Merge, Mean Shift And Mode Nding, Normalized Cuts ,Graph Cuts\nAnd Energy-Based Methods, Feature-Based-Alignment: 2D And 3D Feature-Based Alignment ,Pose\nEstimation, Geometric Intrinsic Calibration, Structure From Motion: Triangulation, Two-Frame\nStructure From Motion, Factorization ,Bundle Adjustment ,Constrained Structure And Motion.\n\nUnit Iii\n\nDense Motion Estimation: Translational Alignment, Parametric Motion, Spline-Based\nMotion , Optical Ow , Layered Motion, Image Stitching; Motion Models, Global Alignment,\nCompositing, Computational Photography: Photometric Calibration, High Dynamic Range Imaging,\nSuper-Resolution And Blur Removal, Image Matting And Compositing, Texture Analysis And\nSynthesis.\n\nUnit Iv\n\nStereo Correspondence: Epipolar Geometry, Sparse Correspondence, Dense\nCorrespondence, Local Methods, Global Optimization, Multi-View Stereo, 3D-Reconstruction:\nShape From X, Active Range Nding, Surface Representations, Point-Based Representations,\nVolumetric Representations, Model-Based Reconstruction, Recovering Texture Maps And Albedos,\n\n: 108\nImage-Based Rendering: View Interpolation, Layered Depth Images, Light Elds And Lumigraphs,\nEnvironment Mattes, Video-Based Rendering, Recognition: Object Detection, Face Recognition,\nInstance Recognition, Category Recognition, Context And Scene Understanding, Recognition\nDatabases And Test Sets.\n",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To: %1. Explain Artificial Intelligence For Solving Problems. 2. Understand Axioms Of Probability. 3. Explain The Principles, Concepts And Operation Certain And Uncertain Knowledge And Reasoning. 4. Explain The Principles, Concepts Of Planning And Learning For Neural Networks. 5. Explain The Concepts Expert Systems. 6. Use Expert System Tools Like Mycin, Emycin.\n: 107\n: Computer Vision\n\n",
  "credits": "3",
  "reference books": "\n: %1. Richard Szeliski, Computer Vision: Algorithms And Applications, Springer-Verlag\n: London Limited, %2011.         %2. Simon J. D. Prince, Computer Vision: Models, Learning And Interface, Cambridge\n: University Press, Ny, Usa, %2012.\n"
}
{
  "course code": "Ecpe86",
  "course title": "Memory Design",
  "prerequisites": "Ecpc10",
  "course type": "Pe",
  "course learning objectives": "\nCourse Provides Basic Concepts Of Different Types Of Memories. It Provides Understanding Of\nTransistor Based Design Of Memory Cell And Associated Circuits Like Sense Amplifiers And Decoders.\nElectromagnetic Compatibility Of Memory Devices When Working In High Speed Systems Will Be\nIntroduced.\n",
  "course content": "\nUnit I\n\nIntroduction To Semiconductor Memories And Technologies:\nInternal Organization Of Memory Chips, Basic Memory Elements, Memory Types, Trends In Sram\nAnd Dram Design, Non-Volatile Memory Technologies. Radiation Effects-Radiation Types Effecting\nThe Memory, Radiation Hardening Techniques (Emc).\n\nUnit Ii\n\nSram And Dram Cell Design: Basic Structures-Nmos Static/Dynamic Circuits,Cmos\nCircuits, Cell Design, Design Parameters, Read Write Operations.\n\nUnit Iii\n\nSense Amplifiers: Voltage And Current Sense Amplifiers; Reference Voltagegeneration;\nVoltage Converters.\n\nUnit Iv\nCache Memory Design: Concept Of Locality In Space And Time, Interfacing\nCachememory With Cpu, Associated Problems-Parasitic Capacitances, Critical Timing Paths,\n: 110",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To:\n1 Develop The Understanding About Fundamentals Of Computer Vision.\n2 Find Features Of The Given Image.\n3 Apply Matching Techniques.\n4 Understand Different Motion Techniques.\n5 Apply Super-Resolution On Images.\n6 Construct 3D Images From Various Image Segments.\n: 109\n: Memory Design\n\n",
  "credits": "3",
  "reference books": "\n1. K. Itoh, Vlsi Memory Chip Design, Springer-Verlag, 2001.\n2. B. Keeth And R. J. Baker, Dram Circuit Design : A Tutorial, Wiley/Ieee, 2000.\n3. B. Prince, Semiconductor Memories : A Handbook Of Design, Manufacture Andapplication, Second Edition, Wiley, 1996.\n4. A. K. Sharma, Advanced Semiconductor Memories : Architectures, Designs Andapplications, Wiley/Ieee, 2002.\n5. T. P. Haraszti, Cmos Memory Circuits, Kluwer, 2000.\n6. J. Handy, The Cache Memory Book, Second Edition, Ap, 1998.\n"
}
{
  "course code": "Ecpe87",
  "course title": "Bio Sensors",
  "prerequisites": "Chir11",
  "course type": "Pe",
  "course learning objectives": "\nTo Familiarize Students With Biosensor Technology And Their Application Area.\n\n",
  "course content": "\n\n\nUnit I\nDescription Of Biosensor And Its General Principles, Biomolecules Used In Biosensors And\nImmobilization Methods, Immobilization Of Biological Materials, Support Materials, Their Types And\nProperties.\n\nUnit Ii\nThe Properties And Characteristic Of Biosensors, Performance Factors In Biosensors, Enzymatic\nBiosensors, Immune-Biosensors.\n\nUnit Iii\nDna Biosensors, Cell Basis Biosensors, Electrochemical Biosensors, Electrochemical Biosensor,\nOptical Biosensors.\n\nUnit Iv\nOther Measurements Methods, Biosensors In Food Analysis, Biosensors In Environmental Analysis.\n",
  "course outcomes": "\nAfter The Completion Of Course, The Student Will Be Competent To: %1. Clearly Understand Different Types Of Memory Devices. 2. Clearly Understand Transistor Based Design Of Memory Cell And Associated Circuits Like\n: Sense Amplifiers And Decoders. %3. Clearly Understand The Concept Of Cache Memory. 4. Clearly Understand The Concept Of Emc Of Memory Devices. 5. Acquire Practical Knowledge Of Memory Devices Used In Industry. 6. Design And Analyze Memory Cells For Optimize Performance.\n: 111\n: Bio Sensors\n\n",
  "credits": "3",
  "reference books": "\n: Protocols, Humana Press, Totowa, New Jersey. %2. J.Cooper, T.Cass, Biosensors, Oxford University Press, Second Edition, 2004.\n\n: 112 %3. Chen Jianrong, Miao Yuqing, He Nongyue, Wu Xiaohua, Li Sijiao, Nanotechnology And\n: Biosensors, Biotechnology Advances, Volume 22, Issue 7, September 2004, Pages 505-"
}
{
  "course code": "Ecpe88",
  "course title": "Rf Circuit Design",
  "prerequisites": "Ecpc30, Ecpc40",
  "course type": "Pe",
  "course learning objectives": "\nTo Familiarize Students With The Importance Of Rf Circuit Design Techniques And Their Potential\nApplication Areas.\n",
  "course content": "\n\n\nUnit I\nRf Systems Architectures: Transmission Media And Reflections, Passive Rlc Networks: Matching,\nPassive Ic Components, Interconnects And Skin Effect, Review Of Mos Device Physics,\nDistributed Systems: Transmission Lines, Reflection Coefficient.\n\nUnit Ii\nHigh Frequency Amplifier Design: Bandwidth Estimation,Rise-Time, Delay And Bandwidth - Zeros\nTo Enhance Bandwidth - Shunt-Series Amplifiers, Tuned Amplifiers - Cascaded Amplifiers\nNoise : Thermal Noise, Flicker Noise Review - Noise Figure.\n\nUnit Iii\nLna Design: Intrinsic Mos Noise Parameters, Design Examples & Multiplier Based Mixers, Mixer\nDesign: Subsampling Mixers.Rf Power Amplifiers: Class A, Ab, B, C Amplifiers - Class D, E, F\nAmplifiers - Rf Power Amplifier Design Examples, Voltage Controlled Oscillators: Resonators -\nNegative Resistance Oscillators.\n\nUnit Iv\nPhase Locked Loops: Linearized Pll Models - Phase Detectors, Charge Pumps - Loop Filters, Pll\nDesign Examples, Frequency Synthesis And Oscillators, Phase Noise: General Considerations -\nCircuit Examples, Radio Architectures: Gsm Radio Architectures - Cdma, Umts Radio\nArchitectures.\n: 114",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To %1. Acquire Knowledge About The Biosensors. 2.   Understand Various Biomolecules Used In Biosensors And Immobilization Methods 3.   Design A Biosensor. 4.   Acquire Knowledge About Advantages Of Biosensors. 5.   Understand Dna Biosensors, Cell Basis Biosensors And Electrochemical Biosensors 6.   Understanding The Use Of Biosensors In Environmental Analysis.\n: 113\n: Rf Circuit Design\n\n",
  "credits": "3",
  "reference books": "\n: Cambridge University Press, %2004. 2. Behzad Razavi, Rf Microelectronics, Prentice Hall, 1997.\n"
}
{
  "course code": "Ecoe80",
  "course title": "Microcontrollers",
  "prerequisites": "Ecpc34",
  "course type": "Oe",
  "course learning objectives": "\nCourse Will Provide The Understanding Of The Difference Between Microprocessor And\nMicrocontroller And Basics Of Embedded System. Students Will Be Able To Apply The Principles Of\nLogic Design In Understanding Architecture And Memory Organization, Understand Different\nPeripherals And Their Interfacing Concepts With Microcontroller.\n",
  "course content": "\n\n\nUnit I\nIntroduction: Comparing Microprocessors And Microcontrollers. Technological Trends In\nMicrocontrollers Development, Survey Of Microcontrollers- 4 Bit, 8 Bit, 16 Bit, 32 Bit\nMicrocontrollers, Applications Of Microcontrollers.\n\nUnit Ii\n8051 Architecture: Block Diagram, Pin Diagram Of %8051. Functional Descriptions Of\nInternal Units, Registers, Psw, Internal Ram, Rom, Stack, Oscillator And Clock. I/O Pins, Ports\nAnd Circuits Connecting External Memory, Counters And Timers. Serial Data Interrupt. Serial Data\nTransmission/Reception And Transmission Modes, Timer Flag Interrupt. External Interrupt, Software\nGenerated Interrupts. External Memory And Memory Space Decoding, Expanding I/Os, Memory\nMapped I/O Reset & Clk Circuits.\n\nUnit Iii\n8051 Instruction Set And Programming: 8051 Instruction Syntax, Addressing\nModes, Data Transfer Instructions, Logical Instructions, Arithmetic Instructions, Jump And Call\nInstructions. Interrupts And Interrupt Handler Subroutines, Writing Assembly Language Programs,\nTime Delays, Pure S/W Time Delays. S/W Polled Timer, Pure H/W Delay. Lookup Tables, Serial\nData Transmission Using Time Delays And Polling. Interrupt Driven Serial Transmission And Reception.\n\nUnit Iv\n8051 Applications: Interfacing Keyboards Programs For Small Keyboards And Matrix\nKeyboards. Interfacing Multiplexed Displays, Numeric Displays And Lcd Displays, Measuring\n\n\n: 116\nFrequency And Pulse Width, Interfacing Adcs & Dacs. Hardware Circuits For Handling Multiple\nInterrupts, 8051 Serial Data Communication Modes- Mode 0, Mode 1, Mode 2 And Mode %3.",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To %1. Understand The Basics Of Rf Circuit Design. 2. Understand The Key Design Challenges In Rf Circuit Design. 3. Understand The Key Challenges In The Designing Of Lna. 4. Design The Various Rf Power Amplifiers. 5. Design Voltage Controlled Oscillators. 6. Design Phase Locked Loops And Radio Architectures.\n: 115\n: Microcontrollers\n\n",
  "credits": "3",
  "reference books": "\n1. K. J. Ayala, The 8051 Microcontroller  2Nd Ed. Penram International.\n2. Intels Manual On Embedded Microcontrollers\n"
}
{
  "course code": "Ecoe81",
  "course title": "Sensor Technology",
  "prerequisites": "Ecpe70",
  "course type": "Oe",
  "course learning objectives": "\nCourse Will Provide The Understanding Of The Right Sensors For A Given Application And Desi\nGn Basic Circuit Building Blocks. Also Help To Simulate, Synthesize, And Layout A Complete\nSensor And Sensor System.\n",
  "course content": "\n\n\nUnit I\nPrinciples Of Sensing, Classification And Terminology Of Sensors, Measurands. Sensors Ty\nPes And Classification  Mechanical, Acoustic, Magnetic, Thermal, Chemical, Radiation And B\nIosensors.\n\nUnit Ii\nPhysical Principle Of Sensing: Electric Charges, Field And Potential, Capacita\nNce, Magnetism And Induction, Resistance, Piezeoelectric Effect, Hall Effect, Temperature An\nD Thermal Properties Of Materials, Heat Transfer, Light, Dynamic Models Of Sensor Elements.\n\nUnit Iii\nWireless Sensors And Its Applications, Modeling And Simulation Of Microsensors And Actu\nAtors, Sensors And Smart Structures. Micro-Opto-Electro-Mechanical Sensors And System, In\nTerworking With Iot.\n\nUnit Iv\nSensors In Different Application Areas: Occupancy And Motion Detector\nS, Position Displacement And Level, Velocity And Acceleration, Force, Strain And Tactile Senso\nRs, Pressure Sensors And Temperature Sensors.\n: 118",
  "course outcomes": "\nAt The End Of The Course Student Will Be Able To\n1. Apply Knowledge Of Mathematics, Engineering To Understand Concepts In Microcontroller Based System.\n2: Analyze A Problem And Formulate Appropriate Computing Solution For Microcontroller Based Applications.\n3: Design Experiments In Microcontrollers Analyze Computer Based Process To Meet Desired Needs\n4: Work, Document And Present As An Individual And As A Team-Member To Design Formulate And Implement Experiments Using Modern Tools.\n5: Select Appropriate Microcontroller For Different Application.\n6: Write And Execute Assembly Language Programs (Software) For Given Application\n: 117\n: Sensor Technology\n",
  "credits": "3",
  "reference books": "\n\n: %1. J. Fraden, Handbook Of Modern Sensors:Physical, Designs, And Applications, Aip\n: Press, Springer.\n: %2. Sze S.M Semiconductor Sensors, John Wiley, New York, 1994.\n: %3. Ristic L,Sensor Technology And Devices, Artech House, London, 1994.\n: %4. Gerard Meijer, Kofi Makinwa, Smart Sensor Systems: Emerging Technologies\n: And Applications, Isbn: 978-0-470-68600-3,April %2014.\n"
}
