{
  "course code": "Phir11",
  "course title": "Physics I (Theory)",
  "prerequisites": "",
  "course type": "Epr",
  "course learning objectives": "To Develop The Understanding Of Fundamentals Of Physics Essential For Engineering And Technology.To Introduce Engineering Relevance Of Quantum Mechanics, Electromagnetic Theory, Crystal Physics, Optics, Theory Of Relativity, Lasers And Nuclear Technology.",
  "course content": "Unit-IQuantum Mechanics: Basics Of Quantum Mechanics, De-Broglies Hypothesis,Uncertainty Principle, Probability And Wave Function, Postulates Of Quantum Mechanics, Time-Dependent And Time-Independent Schrodinger Wave Equation, Particle In A Box.Electro Magnetic Theory: Maxwells Equations In Vacuum And Medium,Electromagnetic Waves, Propagation Energy And Poynting Vector.Unit-IiSolid State Physics: Space Lattice, Unit Cell And Translation Vectors; Miller Indices,Simple And Close-Packed Crystal Structures With Examples, Origin Of Energy Bands, KronigPenney Model (Qualitative), E-K Diagram, Brillouin Zones, Concept Of Effective Mass And Holes,Classification Into Metals, Semiconductors And Insulators, Liquid Crystals, Hall Effect.Unit-IiiSpecial Theory Of Relativity: The Michelson-Morley Experiment, RelativisticTransformations, Length Contraction, Time Dilation, Variation Of Mass With Velocity, Mass-EnergyEquivalence.Nuclear Technology: Interaction Of Radiation With Matter, Nuclear Reactors,Moderators, Reactor Criticality & Neutron Cross-SectionUnit-IvEngineering Optics: Basics Of Interference, Diffraction And Polarization. Lasers AndCharacteristics, Einsteins Coefficients, He-Ne Laser, Semiconductor Lasers, Applications OfLasers, Optical Fibres; Numerical Aperture, Classification Of Optical Fibres, Fibre Losses, FibreManufacturing, Applications Of Optical Fibre In Industry And Communication.",
  "course outcomes": "",
  "credits": "3",
  "reference books": "%1. D.J. Griffiths, Introduction To Electrodynamics, Phi Learning Publishers, New Delhi,2012 %2. H.D Young And R.A Freedman, University Physics With Modern Pearsons Publications,2012. 3. S.O.Pillai, Solid State Physics, New Age International Publishers, 2012 4. A. Beiser, Concepts Of Modern Physics, Mcgraw-Hill, 2008. 5. John Lilley, Nuclear Physics, Principles And Applications, Wiley, 2016"
}
{
  "course code": "Phir12A",
  "course title": "B. Tech. Physics-Ii (Ce, Me &Pr)",
  "prerequisites": "",
  "course type": "Epr",
  "course learning objectives": "To Understand Mechanical Properties Of Materials, Physics Of Magnetic Materials AndSuperconductors, Thermal Physics And Physics Of Nanotechnology.To Develop The Approach To Handle Engineering Problems On Various Materials.To Prepare The Students To Take Up The Future Engineering Challenges Related To Materials.",
  "course content": "Unit-IMechanical Properties Of Materials: Phase Diagram, Gibbs Phase Rule, BinaryPhase Diagram Its Types, Solid Solution: Hume Rothery Rules, Concepts Of Stress And Strain,Stress-Strain Diagrams; Tensile Test; Elastic Deformation, Plastic Deformation. Impact Testing &Toughness Behavior. Hardness Of Materials, Imperfections And DislocationsUnit-IiThermal Physics: Seebeck Effect, Peltier Effect, Thomson Effect, Kelvin Relationships,Wiedemann-Franz Law, Thermal Equilibrium, Entropy, The Laws Of Thermodynamics, ThermalConductivity Of Bulk Materials, Phonons: Lattice Vibration Heat Transfer, Specific Heat Of Solids,Classical, Einstein And Debye Model, Ideal Quantum Gases: Maxwell-Boltazmann, BoseEinstein, Fermi-Dirac Statistics, Carnot Efficiency.Unit-IiiMagnetic Materials And Superconductors: Orbital Diamagnetism, MagneticMoments, Orbital Diamagnetism, Classical Theory Of Paramagnetism, Ferromagnetism, MolecularField Theory And Domains, Applications Of Magnetic Materials, Type I And Ii Superconductors,London Equation, Applications Of Superconductivity.Unit-IvNanotechnology: Classifications Of Nanomaterials (3D, 2D, 1D And 0D) And TheirDensity Of States, Nanocomposites, Carbon Nanotubes (Cnts), Graphene, Nanoclusters, Structural,Thermal And Mechanical Properties Of Nanomaterials, Bottom Up And Bottom Down SynthesisProcesses, Basic Characterization Techniques For Nanomaterials, Applications Of Nanotechnology.",
  "course outcomes": "Students Will Be Able To Understand The Basics Of Quantum Mechanics And Electromagnetic Theory For Technological Applications.Students Will Be Able To Solve Engineering Problems On Solid State Materials And Nuclear ReactorsStudents Will Get Knowledge Of Latest Developments In Lasers And Fibre Optics And Their Applications In Technology.B. Tech. 1St Semester Physics Practicals",
  "credits": "3",
  "reference books": "1. Schroeder, Daniel V. \"An Introduction To Thermal Physics, 19992. Garg, Bansal. Thermal Physics, Tata Mcgraw-Hill Education, 20133. Wole Soboyejo, Mechanical Properties Of Engineered Materials, Marcel Dekker, 2003 4. D. K. Bhattacharya, Engineering Physics, Oxford University Press, 20155. Charles P. Poole, Jr And Frank J. Owens, Introduction To Nanotechnology, John Wiley & Sons,2006"
}
{
  "course code": "Phir12B",
  "course title": "Physics  Ii (Ee & Ece)",
  "prerequisites": "",
  "course type": "Epr",
  "course learning objectives": "To Gain Knowledge Of The Electronic, Dielectric And Magnetic Properties Of Materials.To Understand Theories Relevant To The Engineering Principles Of Materials And Devices.To Solve Problems Related To Semiconductor Device Operation In Technology.",
  "course content": "Unit-IElectronic Properties Of Materials: Drude And Sommerfelds Free ElectronTheory Of Metals, Concept Of Fermi Level, Fermi-Dirac Distribution Function, Charge CarrierDensities.Nanotechnology: Classifications Of Nanomaterials (3D, 2D, 1D And 0D) And TheirDensity Of States, Quantum Confinement, Manifestation Of Quantum Confinement On Optical,Electrical And Mechanical Properties, Basic Characterization Techniques For Nanomaterials,Applications Of Nanotechnology.Unit-IiDielectric Properties Of Materials: Polarization, Bound Charges, ElectricDisplacement, Susceptibility, Dielectric Coefficient, Permittivity & Various Relations BetweenThese, Dielectrics In Ac Fields, Dielectric Loss Factor, Effect Of Temperature And Frequency OnDielectric Constant And Dielectrics Loss Factor (Qualitative Description), Applications Of Dielectrics.Unit-IiiSemiconducting Properties Of Materials: Direct And Indirect Band GapSemiconductors, Elemental And Compound Semiconductors, Equilibrium And Extrinsic CarrierConcentration, Carrier Transport, Drift And Diffusion Current, Mobility, Excess Carrier GenerationAnd Recombination, Tunnel Diode, Solar Cell, LedsUnit-IvMagnetic Materials And Superconductors: Orbital Diamagnetism, AtomicMagnetic Moments, Orbital Diamagnetism, Classical Theory Of Paramagnetism, Ferromagnetism,Molecular Field Theory And Domains, Applications Of Magnetic Materials, Type I And IiSuperconductors, London Equation, Applications Of Superconductivity.",
  "course outcomes": "Students Will Be Able To Solve The Practical Problems Related To The Technological Applications Of Materials.Students Will Be Able To Design And Develop Materials For Industrial Applications---",
  "credits": "3",
  "reference books": "%1. Arthur Beiser, Tata Mcgraw Hill, Concept Of Modern Physics, Publication, 2003 2. Charles Kittel, John Wiley, Introduction To Solid State Physics, Publication, 2013 3. Ben G. Streetman, Prentice-Hall Of India, Solid State Electronic Devices, 2012 4. Jaspreet Singh, John Wiley, Semiconductor Devices-Basic Principles, Publication 2008 5. D. K. Bhattacharya, Oxford University Press, Engineering Physics, 2015"
}
{
  "course code": "Phir12C",
  "course title": "Physics Ii (Cs & It)",
  "prerequisites": "",
  "course type": "Ir",
  "course learning objectives": "To Understand The Basics Of Quantum ComputingTo Understand The Fundamental Concepts Of Optoelectronic Devices For Information TechnologyTo Understand The Behavior Of Emerging Magnetic Materials For Data Storage Devices And Nanomaterials",
  "course content": "Unit-IPhysics Of Quantum Computing: Quantum Theory- Simple Concepts, Wave FunctionAnd Its Physical Significance, Applications Of Schrdinger Wave Equations, Concept Of Spin, QubitsAnd Quantum ComputingUnit IiOptoelectronic Devices: Optoelectronic Processes And Systems, PhotoconductiveDevices, Photoemissive Devices, Photovoltaic Devices, Photodetectors, Light Emitting Diode,Liquid Crystal Display, Plasma Display Panel.Unit- IiiMagnetic Materials And Devices: Molecular Field Theory And Domains, Basic IdeasOf Magnetoresistance, Types And Applications Of Magnetoresistance, Spintronics, FundamentalConcepts Of Magnetic Data Storage: Writing And Read Head Sensors.Unit-IvNanotechnology: Classification             Of Nanomaterials (3D, 2D, 1D And 0D) And TheirDensity Of States, Nanocomposites, Carbon Nanotubes (Cnts), Graphene, Nanoclusters, Structural,Thermal And Mechanical Properties Of Nanomaterials, Bottom Up And Bottom Down SynthesisProcesses, Basic Characterization Techniques For Nanomaterials, Applications Of Nanotechnology.",
  "course outcomes": "Students Will Understand The Physics Underlying The Electronic And Magnetic Behavior OfMaterials.Students Will Be Able To Estimate Materials Properties And Engineer These.Students Will Understand The Operation Mechanism Of Basic Components Of VariousElectrical And Electronic Devices.---",
  "credits": "3",
  "reference books": "%1. Alastair I. M. Rae, Quantum Mechanics, Taylor And Francis, 2011 2. S. O. Kasap, Principles Of Electronic Materials And Devices, Mcgraw Hill, 2006. 3. John Wilson And John Hawkes, Optoelectronics: An Introduction, Prentice Hall, 1997. 4. S. L. Gupta, V. Kumar, A Hand Book Of Electronics, Pragati Prakashan, 2012. 5. Katsuaki Sato And Eiji Saitoh (Editors), Fundamentals Of Magnetoresistance Effects, JohnWiley Publication, 2016 %6. Charles P. Poole, Jr, Frank J. Owens, Introduction To Nanotechnology, Wiley, 2016"
}
{
  "course code": "Phoe10",
  "course title": "Laser Technology",
  "prerequisites": "",
  "course type": "Oe",
  "course learning objectives": "To Familiarize The Students In The Field Of Laser Physics And Their Spectroscopic Applications In Different Fields Of Science And Technology.To Understand The Interaction Of Light And Matter And Physical Principles Underlying The Fabrication Of Laser Systems.",
  "course content": "Unit-ILaser Fundamentals: Concept Of Laser Emission, Characteristics Of Lasers, Main ComponentsOf Laser System, Necessary And Sufficient Conditions For Laser Action, Einstein Coefficients,Population Inversion, Laser Pumping, Two, Three And Four Level Laser Systems.Unit-IiLaser Beam Propagation And Transformation: Optical Cavities, Types Of Optical Resonator,Stability Criterion (Stable And Unstable Resonator), Threshold Gain Coefficient, Resonator Modes(Longitudinal And Transverse Modes), Threshold Condition Of Laser Oscillation, Q-Switching AndMode Locking.Unit-IiiTypes Of Laser: Solid State Laser (Ruby Laser, Nd: Yag, Nd: Glass Etc), Gas Laser (Co2 AndArgon Ion Laser) And Dye Laser, Excimer Laser, Free Electron Laser, Chemical Laser AndSemiconductor Laser, Homojunction Laser (Laser Diode) And Heterojunction Laser.Unit-IvLaser Applications: Laser In Materials Processing And Industry, Lasers In Micro- And Nano-Fabrication And Metrology, Lasers In Spectroscopy, Lasers In Communication And Holography,Lasers Induced Fusion, Laser Systems For Biomedical And Remote Sensing Applications.",
  "course outcomes": "Students Will Understand Quantum Computing For Information Technology.Students Will Be Able To Use The Physics Of Optoelectronic Devices, Fiber Optics In Engineering ApplicationsStudents Will Be Able To Develop New Magnetic Materials And Devices Used For Data StorageB. Tech. 2Nd Semester Physics Practicals",
  "credits": "3",
  "reference books": "%1. W.T. Silfvast: Laser Fundamentals, Cambridge University Press, 2004 2. B.B. Laud: Lasers And Non-Linear Optics, Wiley Eastern Limited, 2Nd Edition 1991 3. Laser In Bioscience, Industry, And Defence By Mansharamani Narain, Defence Research & Development Organisation (India) 2012 4. Principle Of Lasers, 5Th Edition, Orazio Svelto, Springer New York 2010 5. Lasers: Fundamentals And Applications, K Thyagarajan And Ajoy Ghatak, Springer, Usa, 2010 6. Fiber Optics And Lasers: The Two Revolutions, Ajay Ghatak And K. Thyagarajan, Macmillan India, 2006, Reprint 2008-09 7. Modern Physics, G.Kaur And Gary R. Pickrell, Mcgraw Hill Education, 2014"
}
{
  "course code": "Phoe11",
  "course title": "Nuclear Technology",
  "prerequisites": "",
  "course type": "Oe",
  "course learning objectives": "To Gain Knowledge Of Nuclear Physics And Implement It In Science And Technology.To Learn About Nuclear Radiations And Their Detection And Understand The Biological Effect Of Radiation.To Learn About Nuclear Physics And Instrumentation In Different Fields Of Science, Technology And Research.",
  "course content": "Unit-IGeneral Properties Of Atomic Nucleus: Alpha, Beta And Gamma Radiation And Their Properties.Properties Of Nucleus, Binding Energy, Nuclear Stability, Radioactivity: Natural And Artificial,Half Life, Mean Life, Laws Of Radioactivity, Radioactive Equilibrium.Unit-IiInteraction And Detection Of Nuclear Radiation: Interaction Of Radiation With Matter (ChargeParticle, Electromagnetic And Neutron) Stopping Power, Cross Section, Gas Filled RadiationDetectors, Scintillation Detectors, Semiconductor Detectors, Ssntd And Their Applications.Unit-IiiNuclear Reactors: Nuclear Reaction And Their Type, Conservation Laws, Direct And CompoundNucleus Reaction, Nuclear Fission, Fission Products, Mass And Energy Distribution Of FissionProducts, Nuclear Fission Reactors, Fast Breeder Reactor, Nuclear Fuel, Control Rods, NuclearFusioncontrolled Thermonuclear Reactions.Unit-IvAccelerators And Their Applications: Accelerators: Cyclotron, Tandem, Linac And Pelletron,Ion Source, Role Of Accelerators In Research And Technology.Radiation Dosimetry: Radiation Monitoring And Dosimeters, Physical And Biological Effects.Applications Of Radiation In Medical And Forensic Sciences, Radiation Therapy.",
  "course outcomes": "Students Will Become Aware Of Latest Developments In Laser Technology And TheirApplications In Science, Technology And Research.Students Will Be Able To Understand The Utilization Of Laser Technology Modern Devices AndTechnologies Based On Lasers.Students Will Be Able To Use Laser Technology In Spectroscopic And Industrial Applications.---",
  "credits": "3",
  "reference books": "%1. Glenn F Knoll, Jhon Wiley & Sons Inc. Singapore,                Radiation Detection And Measurement, 2012 2. R M Singru, Wiley Eastern Pvt. Ltd ,New Delhi, Experimental Nuclear Physics, 2011 3. Roy And Nigam, Himalaya Publishing House, Nuclear Physics: Theory And Experiment,2016 %4. D C Tayal, John Wiley & Sons Ltd; Nuclear Physics, 2015"
}
{
  "course code": "",
  "course title": "",
  "prerequisites": "",
  "course type": "",
  "course learning objectives": "To Gain Current Knowledge Of Energy Generation Techniques, Environmental Effects AndIts Industrial ImpactTo Understand Basic Physics And Chemistry Behind Various Industrial Devices/ Processes.To Gain Knowledge In Designing Of Emerging Devices/ Processes",
  "course content": "Unit-IEnergy- Environment And Its Industrial Impact: Energy And Power- Principles, DemandsOutlook, Transformation Of Energy And Its Cost, Thermal Pollution, Electrical Energy From FossilFuels, Hydroelectric Generation- Principles And Problems, Costs, Capacity, Storage, Reserves,Efficiency, New Environmental Effects, Electrical Energy From Nuclear Reactors, Fusion Power,Solar Power, Biomass, Etc.Unit-IiChemical Energy Scavenging: Absolute Activities Of Joint Dilute Solution In Common Solvent,Volta Potential, Equilibrium, Non-Cosmic Membrane And Contact Examples Of Electrochemical,General Treatment Of Electromotive Force-Electrochemical Transport, Fuel Cells.Unit- IiiLithography And Nano-Devices: Nano-Manipulation, E Beam Lithography Ion Beam Lithography,Deep Uv Lithography, X-Ray Based Lithography, Dip Pen Lithography, Diffraction Effects InNanolithography, Mem/ Nems- Basics And Fabrication, Nems/Mems Based Oscillators, SensorsAnd DetectorUnit-IvIndustrial Application Of Vacuum: Fundamentals Of Vacuum Science, Vacuum Measurements,Vacuum Coating, Vacuum Impregnation, Freeze Drying, Space Simulation, Ion Implantation,Vacuum Distillation,Sensors: Fabrication Of Sensors, Gas Sensors, Magnetic Sensors, Piezoelectric Sensors, OpticalSensors, Etc., Sensing Mechanisms In Different Sensors",
  "course outcomes": "Students Will Be Able To Understand The Nuclear Processes And Reactions In VariousPhenomena.Students Will Learn To Apply Nuclear Physics In Research And Devolvement For Science AndTechnology.Students Will Become Aware Of Latest Developments In Nuclear Reactors And Detectors AndTheir Applications In Science, Technology And Research.",
  "credits": "",
  "reference books": "%1. Kenneth J. Skipka, Louis Theodore, Energy Resources: Availability, Management, AndEnvironmental Impacts, Crc Press, 2014 %2. Sugiyama, Masakazu, Fujii, Katsushi, Nakamura, Shinichiro (Eds.), Solar To Chemical EnergyConversion- Theory And Application, Springer, 2016 %3. Sergy Edward Lyshevski, Micro-Electro Mechanical And Nano-Electro Mechanical Systems, CrcPress, 2005 %4. Mick Wilson Et Al, Nanotechnology-Basic Science And Emerging Technologies, Overseas Press,2002 %5. A. Roth, Vacuum Technology, A. Roth, Elsevier, 1990"
}
{
  "course code": "",
  "course title": "",
  "prerequisites": "",
  "course type": "",
  "course learning objectives": "To Gain Current Knowledge Of Various Energy Harvesting Approaches.To Understand Basic Physics Behind Various Energy Harvesting Systems.To Understand Hybrid Approaches And Design Emerging Energy Harvesting Systems",
  "course content": "Unit-IIntroduction To Energy Harvesting, Available Energy, Experimental CharacterizationTechniques, ApplicationsPhotovoltaic Energy Harvesting: Background Physics, Solar Cell Design And Strategies ForOptimizing Figure Of Merit, Various Types Of Solar Cells, Future DirectionsUnit-IiThermoelectric Energy Harvesting: Background Physics, Semiconductors And Thermoelectrics,Bulk Thermoelectric Materials Performance, Strategies For Optimizing Figure Of Merit (Zt),Thermoelectric Modules, Future DirectionsUnit-IiiPiezoelectric Energy Harvesting: Background Physics, Piezoelectric Harvester Design, ModelingOf Piezoelectric Harvesters, Strategies For Optimizing Figure Of Merit, Future DirectionsMagnetostrictive Energy Harvesting: Background Physics, Magnetostrictive Harvester Design,Modeling Of Magnetostrictive Harvesters, Strategies For Optimizing Figure Of Merit, FutureDirectionsUnit-IvHybrid And Emerging Energy Harvesting Approaches: Solar-Thermal Energy Harvesting, EnergyFor Garbage, Emerging Nanotechnology Based Approaches Of Energy HarvestingIntroduction To Other Energy Harvesting Approaches: Bio-Inspired Energy HarvestingApproaches, Dielectric Elastomer Based Harvesters, Electrostatic Energy Harvesters, ElectretsBased Harvesters",
  "course outcomes": "Student Will Understand Various Energy Generation Techniques, Environmental Effects AndIts EconomicsStudent Will Be Able To Solve Technical Problems On Various Industrial Devices/ Processes.Student Will Be Able To Design Emerging Devices Of Current Industrial Importance.",
  "credits": "",
  "reference books": "%1. D . M . Rowe (Ed.), Thermoelectrics Handbook- Macro To Nano, Crc Press, 2005 2. Antonio Luque And Steven Hegedus Handbook Of Photovoltaic Science And Engineering,Wiley, 2010 %3. T. J. Kazmierski And S. Beeby, Energy Harvesting Systems: Principles, Modeling AndApplications, Springer-Verlag, 2011 %4. S. Priya, D. J. Inman (Eds.), Energy Harvesting Technologies, Springer, 2009"
}
{
  "course code": "",
  "course title": "",
  "prerequisites": "",
  "course type": "",
  "course learning objectives": "To Gain Knowledge About The Physics Of UltrasonicsTo Gain Skills Of Ultrasonics InstrumentationTo Have Insight Of Applications Of Ultrasonics In Industry",
  "course content": "Unit- IConcept Of Ultrasonics: Physics Of Ultrasonics-Wave Motion, Velocity Of Propagation,Characteristic Impedance, Reflection, Attenuation And Transmission Through Layers, Acousto-OpticEffect, Acoustic Grating, Ultrasonic Velocity And Thickness MeasurementUnit IiProduction Of Ultrasonics: Ultrasonic Transducers: Piezoelectric And MagnetostrictiveTransducers, Equivalent Circuits, Impedance Matching, High And Low Power Devices.Unit IiiUltrasonic Instrumentation: Detection Of Ultrasonic, Instrumentation And Applications:Ultrasonic Sensing Using Plus Echo And Doppler Techniques, Sonar, Industrial Processing Units,Ultrasonic Measurement And Control; Limitation Of Ultrasonics.Unit IvUltrasonic Industry Application: Industrial Ultrasonic: Drilling, Welding And Soldering,Ultrasonic Testing, Cavitation, Ultrasonic Cleaning, Flaw Detection Diagnostic: Pulseecho AndTransmission Technique, Echocardiogram, Laser Ultrasonics, Ultrasonic Microscopy, UltrasonicImaging And Therapy.",
  "course outcomes": "Students Will Have Knowledge Of The Physics Of Various Energy Harvesting Approaches.Students Will Be Able To Analyze Practical Problems On Various Energy HarvestingTechniques.Students Will Be Able To Design Energy Harvesting Systems",
  "credits": "",
  "reference books": "1. J. David & N. Checke, Fundamental And Applications Of Ultrasonics, 2Nd Edition, Crc Press, 2017.2. Ensminger, Ultrasonics Fundamental, Technology & Applications, Crc Press, 20113. K C Shrivastava, Ultrasonic Testing, 2003"
}
{
  "course code": "Phoe15",
  "course title": "Nanoscience And Technology",
  "prerequisites": "",
  "course type": "Oe",
  "course learning objectives": "To Understand The Fundamentals Of Nanoscience And Technology.To Impart Knowledge About Various Synthesis And Characterization Techniques Involved InNanoscience And Technology.To Familiarize The Students With Nanotechnology Potentials And Its Applications InDifferent Fields.",
  "course content": "Unit IBasics Of Nano Science And Technology: Basic Concepts Of Nanoscience:Quantum Dot, Potential Barrier, Background Of Nanotechnology, Types Of Nanotechnology AndNano-Machines, Top Down And Bottom Up Techniques, Atomic Manipulation, Self-AssemblyMonolayers, Time And Length Scale In Structures, Dimensionality And Size Dependent Phenomena,Surface To Volume Ratio, Fraction Of Surface Atoms, Properties At Nanoscale (Electronic, Magnetic,Optical And Mechanical).Unit IiSynthesis Methods Of Nanomaterials: Introduction To Nanomaterials, SynthesisOf Nanomaterials: Sol-Gels Techniques, Co-Precipitation And Hydrothermal Method, Lithography:Photolithography, Electron Beam Lithography, Focused Ion Beam Lithography (Fib); Dip-PenNanolithography, Template Synthesis; Self Assembly And Bio/Chemical Methods, ChemicalVapor Deposition(Cvd); Electron Beam Evaporation, Pulse Laser Deposition (Pld), Dc/RfMagnetron Sputtering, Molecular Beam Epitaxy (Mbe).Unit-IiiCharacterization                Techniques         For      Nanomaterials: StructuralCharacterization: X-Ray Diffraction (Xrd), Surface Characterization: Scanning ElectronMicroscopy (Sem), High Resolution Transmission Electron Microscope (Hrtem), ScanningProbe Microscope (Stm, Afm, Mfm), Raman Spectrometry.Unit-IvPotential Applications: Applications Of Nanomaterials: Data Storage, WaterPurification, Photocatalytic Degradation, Targeted Drug Delivery, Hyperthermia, Solar EnergyConversion And Catalysis, Molecular Electronics And Nanoelectronics, Nanomedicine AndNanobiotechnology: Nanotoxicology Challenges, Cosmetics, Building Construction, Heat TransferEtc.",
  "course outcomes": "Students Will Able To Understand The Concept Of Ultrasonics And Its Industrial ApplicationsStudents Will Gain Knowledge Of Ultrasonic InstrumentationStudents Will Be Able To Solve Industrial Problems And Design Instruments On Ultrasonics---",
  "credits": "3",
  "reference books": "1. Pradeep T., A Textbook Of Nanoscience And Nanotechnology, Tata Mcgraw HillEducation Pvt. Ltd., %2012.        %2. Hari Singh Nalwa, Nanostructured Materials And Nanotechnology, Academic Press,2002.        %3. Nabok A., Organic And Inorganic Nanostructures, Artech House, 2005.4. 4. Dupas C., Houdy P., Lahmani M., Nanoscience: Nanotechnologies AndNanophysics, Springer-Verlag Berlin Heidelberg, %2007."
}
{
  "course code": "Phoe16",
  "course title": "Sensors-Science And Technology",
  "prerequisites": "",
  "course type": "Oe",
  "course learning objectives": "To Gain Knowledge About The Working Principle Of Different Types Of Sensors Used InVarious Applications.To Gain Skills About The Modelling And Calibration Of Different Types Of Sensors.To Gain Knowledge Of The Sensor Materials And Technology At Nano-Scale.",
  "course content": "Unit-IPrinciples Of Physical And Chemical Sensors: Sensors Fundamentals And Characteristics,Sensing Mechanism Of Mechanical, Electrical, Thermal, Magnetic, Optical, Chemical AndBiological Sensors.Unit-IiSensor Characteristics And Calibration: Static And Dynamic Characteristics, Sensor Reliability,Aging Test, Failure Mechanisms And Their Evaluation And Stability Study.Unit-IiiFabrication Methods: Sensor Configurations And Geometries, Use Of Nano-Materials In Sensors,Thin/Thick Film Formation Techniques (Physical, Chemical And Langmuir-Blodgett Film FormationTechniques),Unit-IvSensor Modeling: Numerical Modeling Techniques, Modeling Effects On Different Parameters OfSensing Mechanisms (Mechanical, Electrical, Thermal, Magnetic, Optical, Chemical AndBiological) And Examples Of Modeling. Sensors Applications.",
  "course outcomes": "1. Students Will Be Able To Understand Engineering Of The Properties At Nanoscale Materials.2. Students Will Be Able To Synthesize And Characterize The Nanomaterials Of Different ShapesAnd Sizes.3. Students Will Be Able To Design And Develop The Nanotechnology Based Devices Based OnThe Learned Fundamentals.---",
  "credits": "3",
  "reference books": "1. J. Fraden, Handbook Of Modern Sensors: Physical, Designs, And Applications, Aip Press,Springer, %2010. %2. D. Patranabis, Sensors And Transducers, Phi Publication, New Delhi, 2003.3. Ganesh S. Hegde, Mechatronics, University Science Press, 2008.4. P.T. Moseley, B.C. Toefield, Solid State Gas Sensors, Crc Press, 1987.5. M. Meyyappan, Carbon Nanotubes Science And Applications, Crc Press, 2014."
}
